// BSLLS:ParseError-on

// Создание процедуры
ПараметрыПроцедуры = ПолучитьПараметрыПроцедурыФункции();
ПараметрыПроцедуры.Тип = "Процедура";
ПараметрыПроцедуры.Расположение = "Справочник.Контрагенты.Форма.Форма";
ПараметрыПроцедуры.Область = "ОбработчикиСобытийФормы";
ПараметрыПроцедуры.Имя = "ПриСозданииНаСервере";
ПараметрыПроцедуры.Префикс = "&НаСервере";
ПараметрыПроцедуры.Параметры = "(Отказ, СтандартнаяОбработка)";

СоздатьПолучитьПроцедуруФункцию(ПараметрыПроцедуры);

ПараметрыПроцедуры.Тело = СтрСоединить(
		ПараметрыПроцедуры.Тело, Символы.ПС, "Сообщить(""Привет"");");

ЗаписатьПроцедуруФункцию(ПараметрыПроцедуры);

// Установка обработчика
ПараметрыОбработчика = ПолучитьПараметрыОбработчика();
ПараметрыОбработчика.Расположение = "Справочник.Контрагенты.Форма.Форма";
ПараметрыОбработчика.Объект = "Форма";
ПараметрыОбработчика.Событие = "ПриСозданииНаСервере";
ПараметрыОбработчика.Обработчик = "ПриСозданииНаСервере";

ДобавитьОбработчик (ПараметрыОбработчика);

// BSLLS:ParseError-off