#Область ОбработчикиСобытийФормы

&НаКлиенте
Функция Разобрать(СтрокаДляРазбора) Экспорт
	МассивСтрок = СтрРазделить(СтрокаДляРазбора, Символы.ПС);
	
	ДанныеГрупп = ПарсингСтруктуры(МассивСтрок);

	ПарсингВертикальнойГруппы(ДанныеГрупп); 
	
	ПарсингОчистка(ДанныеГрупп);
	
	Возврат ДанныеГрупп;
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция Лексема(ИмяПараметра)
	Возврат ВладелецФормы.Лексема(ИмяПараметра);
КонецФункции

#Область ПарсингГрупп
 
&НаКлиенте
Функция ПерейтиНаСледующийЭлемент(ПараметрыВыполнения)
	ПараметрыВыполнения.Индекс = ПараметрыВыполнения.Индекс + 1;
	Возврат ПараметрыВыполнения.Индекс <= ПараметрыВыполнения.МассивЭлементов.ВГраница();
КонецФункции

&НаКлиенте
Функция ПолучитьТекущийЭлемент(ПараметрыВыполнения)
	Возврат ПараметрыВыполнения.МассивЭлементов[ПараметрыВыполнения.Индекс];
КонецФункции

&НаКлиенте
Функция ПарсингСтруктуры(МассивСтрок)  
	ГруппаФормы = ПолучитьОписаниеВертикальнойГруппы(Неопределено);
	
	ПараметрыВыполнения = Новый Структура("Форма,Группы", ГруппаФормы, Новый Массив);
	ПараметрыВыполнения.Группы.Добавить(ГруппаФормы);
	
	НомерСтроки = 1;
	Для Каждого Строка Из МассивСтрок Цикл
		Текст = НовыйТекст(Строка, НомерСтроки, 1);
		ПарсингГруппПоСтроке(ПараметрыВыполнения, Текст);

		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат ПараметрыВыполнения.Форма;
КонецФункции

&НаКлиенте
Процедура ПарсингГруппПоСтроке(ПараметрыВыполнения, Текст)
	ТекущиеГруппы = Новый Массив;
	
	Разделитель = Лексема("РазделительГруппа");
	ТекстВертикальныеГруппы = ПолучитьПодгруппыСтроки(Текст, Разделитель);        

	Сч = 0;
	Для Сч = 0 По ТекстВертикальныеГруппы.ВГраница() Цикл
		ТекстВертикальнаяГруппа = ТекстВертикальныеГруппы[Сч];
		ПрошлаяГруппаОписание = ПараметрыВыполнения.Группы[Сч];
		ПарсингДобавляемыхГрупп(ТекущиеГруппы, ТекстВертикальнаяГруппа, ПрошлаяГруппаОписание);
	КонецЦикла;
	
	ПараметрыВыполнения.Группы = ТекущиеГруппы;
КонецПроцедуры

&НаКлиенте
Процедура ПарсингДобавляемыхГрупп(ТекущиеГруппы, ТекстГруппа, ПрошлаяГруппа) 
	
	Если ТекстНачинаетсяС(ТекстГруппа, "/") Тогда 
		Если ПрошлаяГруппа.Тип = "Страница" Тогда
			Страницы = ПрошлаяГруппа.Родитель;
		Иначе
			Страницы = ПолучитьОписаниеСтраниц(ПрошлаяГруппа);

		КонецЕсли;     
		
		Содержимое = ВыделитьНачальныйКонечныйСимволы(ТекстГруппа, "/");
		Текст = Содержимое.Текст;
		
		НоваяСтраница = ПолучитьОписаниеСтраницы(Страницы); 
		НоваяСтраница.НаборСвойств.Заголовок = СокрЛП(Текст.Значение);     

		ТекущиеГруппы.Добавить(НоваяСтраница);
		
		Возврат;
	КонецЕсли;

	РазделительОднострочнаяГруппа = Лексема("РазделительГруппаОднострочная");
	
	ДобавляемыеГруппы = ПолучитьПодгруппыСтроки(ТекстГруппа, РазделительОднострочнаяГруппа);
	
	Если ДобавляемыеГруппы.Количество() > 1 Тогда        
		ОднострочнаяГруппа = ПолучитьОписаниеОднострочнойГруппы(ПрошлаяГруппа);

		Для Каждого ДобавляемаяГруппа Из ДобавляемыеГруппы Цикл
			СтрочныйЭлемент = ПолучитьОписаниеСтрочногоЭлемента(ОднострочнаяГруппа);
			СтрочныйЭлемент.Текст =  ДобавляемаяГруппа;
		КонецЦикла;
		
		ТекущиеГруппы.Добавить(ПрошлаяГруппа);
		
		Возврат;
	КонецЕсли;

	Разделитель = Лексема("РазделительГруппаДобавить");
	
	ДобавляемыеГруппы = ПолучитьПодгруппыСтроки(ТекстГруппа, Разделитель);
	
	// Не добавляются новые группы
	Если ДобавляемыеГруппы.Количество() <= 1 Тогда   
		СтрочныйЭлемент = ПолучитьОписаниеСтрочногоЭлемента(ПрошлаяГруппа);
		СтрочныйЭлемент.Текст =  ТекстГруппа;
		
		ТекущиеГруппы.Добавить(ПрошлаяГруппа);
		Возврат;
	КонецЕсли;
	
	ГоризонтальнаяГруппа = ПолучитьОписаниеГоризонтальнойГруппы(ПрошлаяГруппа);

	// Первый элемент пропускаем
	Для Сч = 1 По ДобавляемыеГруппы.ВГраница() Цикл
		ДобавляемаяГруппа = ДобавляемыеГруппы[Сч];

		НоваяВертикальнаяГруппа = ПолучитьОписаниеВертикальнойГруппы(ГоризонтальнаяГруппа);

		ЗаголовокЭлемента = СокрЛП(ДобавляемаяГруппа.Значение);
		НоваяВертикальнаяГруппа.НаборСвойств.Заголовок = ЗаголовокЭлемента;
		НоваяВертикальнаяГруппа.НаборСвойств.ОтображатьЗаголовок = НЕ ПустаяСтрока(ЗаголовокЭлемента);
		
		ТекущиеГруппы.Добавить(НоваяВертикальнаяГруппа);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеВертикальнойГруппы(ГоризонтальнаяГруппа = Неопределено)
	Результат = ПолучитьОписаниеЭлемента("ВертикальнаяГруппа", ГоризонтальнаяГруппа);
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.НаборСвойств.Вставить("ОтображатьЗаголовок", Ложь);
	Результат.Вставить("Элементы", Новый Массив);
	Результат.Вставить("ЭлементыПарсинг", Новый Массив);
	
	Результат.Вставить("Текст", НовыйПустойТекст());
	
	Если ГоризонтальнаяГруппа <> Неопределено Тогда
		ГоризонтальнаяГруппа.Элементы.Добавить(Результат);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции  

&НаКлиенте
Функция ПолучитьОписаниеОднострочнойГруппы(ВертикальнаяГруппа)
	Результат = ПолучитьОписаниеЭлемента("ОднострочнаяГруппа", ВертикальнаяГруппа);
	
	Результат.Вставить("Элементы", Новый Массив);
	Результат.Вставить("ЭлементыПарсинг", Новый Массив);
	
	ВертикальнаяГруппа.ЭлементыПарсинг.Добавить(Результат);
	
	Возврат Результат;
КонецФункции  

&НаКлиенте
Функция ПолучитьОписаниеГоризонтальнойГруппы(ВертикальнаяГруппа)
	Результат = ПолучитьОписаниеЭлемента("ГоризонтальнаяГруппа", ВертикальнаяГруппа);
	Результат.Вставить("Элементы", Новый Массив);
	
	ВертикальнаяГруппа.ЭлементыПарсинг.Добавить(Результат);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПарсингОчистка(Элемент)
	Если Элемент.Свойство("Родитель") Тогда
		Элемент.Удалить("Родитель");
	КонецЕсли;	
	
	Если Элемент.Свойство("ЭлементыПарсинг") Тогда
		Элемент.Удалить("ЭлементыПарсинг");
	КонецЕсли;	

	ОчищаемыеЭлементы = Новый Массив;
	ОчищаемыеЭлементы.Добавить("Элементы");
	ОчищаемыеЭлементы.Добавить("Строки");
	ОчищаемыеЭлементы.Добавить("Колонки");
	ОчищаемыеЭлементы.Добавить("Ячейки");

	Для Каждого ОчищаемыйЭлемент Из ОчищаемыеЭлементы Цикл
		Если НЕ Элемент.Свойство(ОчищаемыйЭлемент) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Подэлемент Из Элемент[ОчищаемыйЭлемент] Цикл
			ПарсингОчистка(Подэлемент);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПарсингСтрочныхЭлементов

&НаКлиенте
Функция ПарсингНабораСвойств(НаборСвойств, Текст) 
    Результат = Текст;
	
	СтрСвойства = ПолучитьГруппуСтроки(Текст, "{", "}", "СКонца");
	
	Если НЕ СтрСвойства.Найден Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СтрСвойства.Текст;
	
	МассивСвойства = ПолучитьПодгруппыСтроки(СтрСвойства.Группа, ";");        

	Для Каждого Свойство Из МассивСвойства Цикл
		СтрКлючЗначение = ПолучитьКлючЗначениеТекста(Свойство, "=");
		ИмяСвойства = СокрЛП(СтрКлючЗначение.Ключ.Значение);
		ЗначениеСвойства = СокрЛП(СтрКлючЗначение.Значение.Значение);
		НаборСвойств.Вставить(ИмяСвойства, ЗначениеСвойства);
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции    

&НаКлиенте
Процедура ЗаполнитьНаборСвойств(ПараметрыВыполнения, Элемент)
	Для Каждого КлючЗначение Из ПараметрыВыполнения.НаборСвойств Цикл
		Элемент.НаборСвойств.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;	
	
	ПараметрыВыполнения.НаборСвойств = Новый Структура;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеЭлемента(Тип, Родитель)  
	Результат = Новый Структура;
	Результат.Вставить("Тип", Тип); 
	Результат.Вставить("УИД", Новый УникальныйИдентификатор);
	Результат.Вставить("Родитель", Родитель); 
	
	Результат.Вставить("НаборСвойств", Новый Структура);
	Результат.Вставить("Координаты", Новый Массив);
	Результат.Вставить("Формат", Новый Структура("Результат,Длина", Новый Массив, 0));
	Результат.Вставить("ИмяРеквизита", "");
	Результат.Вставить("ИмяЭлемента", "");
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьТекстСКартинкой(Текст)
	Результат = Новый Структура("Текст,Картинка,ПоложениеКартинки", СокрЛП(Текст.Значение), Неопределено, "Лево");
	
	Если ТекстНачинаетсяС(Текст, "@")  Тогда
		Результат.ПоложениеКартинки = "Лево";
		
		ГруппаКартинка = ПолучитьГруппуСтроки(Текст, "@", " ");
		Если ГруппаКартинка.Найден Тогда
			Результат.Текст = СокрЛП(ГруппаКартинка.Текст.Значение);
			Результат.Картинка = СокрЛП(ГруппаКартинка.Группа.Значение);
		Иначе
			// Вся строка - картинка
			Результат.Текст = "";
			Результат.Картинка = СокрЛП(ГруппаКартинка.Текст.Значение);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	ГруппаКартинка = ПолучитьГруппуСтроки(Текст, "@", , "СКонца");
	Если НЕ ГруппаКартинка.Найден Тогда
		Возврат Результат;
	КонецЕсли;
	Результат.Текст = СокрЛП(ГруппаКартинка.Текст.Значение);
	Результат.Картинка = СокрЛП(ГруппаКартинка.Группа.Значение);
	Результат.ПоложениеКартинки = "Право";
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЭтоКонечныйЭлемент(Знач Значение)
	Значение = СокрЛП(Значение);
	Возврат Значение <> "" И СтрЗаменить(Значение, "-", "") = "";
КонецФункции

&НаКлиенте
Функция ПолучитьПараметрыВыполненияСтрочныхЭлементов(Родитель, Элементы)
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Родитель", Родитель);

	ПараметрыВыполнения.Вставить("МассивЭлементов", Элементы);
	ПараметрыВыполнения.Вставить("Индекс", 0);
	
	ПараметрыВыполнения.Вставить("НаборСвойств", Новый Структура);

	ПараметрыВыполнения.Вставить("Таблица", Неопределено);
	ПараметрыВыполнения.Вставить("ТаблицаЗаголовокЗаполнен", Ложь);
	ПараметрыВыполнения.Вставить("ТаблицаИерархия", Новый Массив);
	ПараметрыВыполнения.Вставить("ТаблицаПолныйФормат", Ложь);

	ПараметрыВыполнения.Вставить("ПолеВвода", Неопределено);

	ПараметрыВыполнения.Вставить("КоманднаяПанельСМеню", Неопределено);
	ПараметрыВыполнения.Вставить("КоманднаяПанельИерархия", Новый Массив);
	
	Возврат ПараметрыВыполнения;
КонецФункции

&НаКлиенте
Процедура ПарсингСтрочныхЭлементов(ПараметрыВыполнения)
	Пока Истина Цикл
		ПарсингСтрочногоЭлемента(ПараметрыВыполнения); 
		
		Если НЕ ПерейтиНаСледующийЭлемент(ПараметрыВыполнения) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПарсингСтрочногоЭлемента(ПараметрыВыполнения)

	Если ПарсингГоризонтальнойГруппы(ПараметрыВыполнения) Тогда
		Возврат;
	КонецЕсли;

	Если ПарсингОднострочнойГруппы(ПараметрыВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПарсингСтраниц(ПараметрыВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПарсингКоманднойПанели(ПараметрыВыполнения) Тогда
		ПараметрыВыполнения.ПолеВвода = Неопределено;
		ПараметрыВыполнения.Таблица = Неопределено;    
		ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен = Ложь;    
		ПараметрыВыполнения.ТаблицаИерархия = Новый Массив;    
			
		Возврат;
	КонецЕсли;
	
	Если ПарсингТаблицы(ПараметрыВыполнения) Тогда
		ПараметрыВыполнения.ПолеВвода = Неопределено;
		
		Возврат;
	КонецЕсли;
	
	ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	Текст = ТекЭлемент.Текст;
	
	ТекстБезСвойств = ПарсингСвойствСтрочногоЭлемента(Текст, ПараметрыВыполнения.НаборСвойств);
	
	Если ПарсингПоляВвода(ПараметрыВыполнения, ТекстБезСвойств) Тогда
		ПараметрыВыполнения.Таблица = Неопределено;    
		ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен = Ложь;    
		ПараметрыВыполнения.ТаблицаИерархия = Новый Массив;    
		
		Возврат;
	КонецЕсли;

	Если ПарсингФлажкаЛевый(ПараметрыВыполнения, ТекстБезСвойств) Тогда
		ПараметрыВыполнения.ПолеВвода = Неопределено;
		ПараметрыВыполнения.Таблица = Неопределено;    
		ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен = Ложь;    
		ПараметрыВыполнения.ТаблицаИерархия = Новый Массив;    
		
		Возврат;
	КонецЕсли;
	
	Если ПарсингФлажкаПравый(ПараметрыВыполнения, ТекстБезСвойств) Тогда
		ПараметрыВыполнения.ПолеВвода = Неопределено;
		ПараметрыВыполнения.Таблица = Неопределено;    
		ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен = Ложь;    
		ПараметрыВыполнения.ТаблицаИерархия = Новый Массив;    
		
		Возврат;
	КонецЕсли;

	Если ПарсингМногострочногоПоляВвода(ПараметрыВыполнения, ТекстБезСвойств) Тогда
		ПараметрыВыполнения.Таблица = Неопределено;    
		ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен = Ложь;    
		ПараметрыВыполнения.ТаблицаИерархия = Новый Массив;    
		
		Возврат;
	КонецЕсли;

	Если ПарсингНадписи(ПараметрыВыполнения, ТекстБезСвойств) Тогда
		ПараметрыВыполнения.ПолеВвода = Неопределено;
		ПараметрыВыполнения.Таблица = Неопределено;    
		ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен = Ложь;    
		ПараметрыВыполнения.ТаблицаИерархия = Новый Массив;    
		
		Возврат;
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Функция ПарсингСвойствСтрочногоЭлемента(Текст, НаборСвойств)
	СвойствоГоризонтальноеПоложение = ПарсингПолучитьГоризонтальноеПоложение(Текст);
	Если СвойствоГоризонтальноеПоложение <> Неопределено Тогда
		НаборСвойств.Вставить("ГоризонтальноеПоложение", СвойствоГоризонтальноеПоложение);
	КонецЕсли;
	
	Возврат ПарсингНабораСвойств(НаборСвойств, Текст);
КонецФункции

&НаКлиенте
Функция ПарсингПолучитьГоризонтальноеПоложение(Текст)
	СтрРасположение = ВыделитьНачальныйКонечныйСимволы(Текст, "->", "<-");
	Текст = СтрРасположение.Текст;
	
	Если СтрРасположение.ЕстьНачальный И СтрРасположение.ЕстьКонечный Тогда
		Возврат "Центр";
	КонецЕсли;
	
	Если СтрРасположение.ЕстьНачальный Тогда
		Возврат "Право";
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#Область ПарсингСтраниц

&НаКлиенте
Функция ПолучитьОписаниеСтраниц(ВертикальнаяГруппа)  
	Результат = ПолучитьОписаниеЭлемента("Страницы", ВертикальнаяГруппа);  
	Результат.Вставить("Элементы", Новый Массив);
	Результат.Вставить("Родитель", ВертикальнаяГруппа);
	
	ВертикальнаяГруппа.ЭлементыПарсинг.Добавить(Результат);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеСтрочногоЭлемента(Родитель)  
	Результат = ПолучитьОписаниеЭлемента("СтрочныйЭлемент", Родитель);  
	Результат.Вставить("Родитель", Родитель);
	Результат.Вставить("Текст", Неопределено);
	
	Родитель.ЭлементыПарсинг.Добавить(Результат);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеСтраницы(Страницы)  
	Результат = ПолучитьОписаниеЭлемента("Страница", Страницы);
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.Вставить("Родитель", Страницы);
	Результат.Вставить("Элементы", Новый Массив);
	Результат.Вставить("ЭлементыПарсинг", Новый Массив);
	Результат.Вставить("Текст", НовыйПустойТекст());
	
	Страницы.Элементы.Добавить(Результат);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПарсингСтраниц(ПараметрыВыполнения) 
	Страницы = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	
	Если НЕ Страницы.Тип = "Страницы" Тогда
		 Возврат Ложь;
	КонецЕсли;
	
	Родитель = Страницы.Родитель;
	
	Родитель.Элементы.Добавить(Страницы);
	
	Для Каждого Страница Из Страницы.Элементы Цикл
		ПарсингСтраницы(Страница);
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПарсингСтраницы(Страница) 
	ПараметрыВыполнения = ПолучитьПараметрыВыполненияСтрочныхЭлементов(Страница, Страница.ЭлементыПарсинг);
	ПарсингСтрочныхЭлементов(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Функция ПарсингВертикальнойГруппы(ВертикальнаяГруппа)    
	Если НЕ ВертикальнаяГруппа.Тип = "ВертикальнаяГруппа" Тогда
		 Возврат Ложь;
	КонецЕсли;

	ПараметрыВыполнения = ПолучитьПараметрыВыполненияСтрочныхЭлементов(
		ВертикальнаяГруппа, 
		ВертикальнаяГруппа.ЭлементыПарсинг);
	ПарсингСтрочныхЭлементов(ПараметрыВыполнения);
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ПарсингОднострочнойГруппы(ПараметрыВыполнения)
	ОднострочнаяГруппа = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	Если НЕ ОднострочнаяГруппа.Тип = "ОднострочнаяГруппа" Тогда
		 Возврат Ложь;
	КонецЕсли;

	ВертикальнаяГруппа = ОднострочнаяГруппа.Родитель;
	ВертикальнаяГруппа.Элементы.Добавить(ОднострочнаяГруппа);
	
	ПараметрыВыполненияОднострочнаяГруппа = ПолучитьПараметрыВыполненияСтрочныхЭлементов(
		ОднострочнаяГруппа, 
		ОднострочнаяГруппа.ЭлементыПарсинг);
	ПарсингСтрочныхЭлементов(ПараметрыВыполненияОднострочнаяГруппа);
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ПарсингГоризонтальнойГруппы(ПараметрыВыполнения)         
	ГоризонтальнаяГруппа = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	Если НЕ ГоризонтальнаяГруппа.Тип = "ГоризонтальнаяГруппа" Тогда
		 Возврат Ложь;
	КонецЕсли;
	
	ВертикальнаяГруппа = ГоризонтальнаяГруппа.Родитель;
	ВертикальнаяГруппа.Элементы.Добавить(ГоризонтальнаяГруппа);
	
	Для Каждого ВертикальнаяГруппа Из ГоризонтальнаяГруппа.Элементы Цикл
		ПарсингВертикальнойГруппы(ВертикальнаяГруппа);
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

#КонецОбласти 

#Область ПарсингКоманднойПанели

&НаКлиенте
Функция ПолучитьОписаниеКнопки(КоманднаяПанель)  
	Результат = ПолучитьОписаниеЭлемента("Кнопка", КоманднаяПанель);
	Результат.Вставить("Картинка", Неопределено);
	Результат.Вставить("КлючПоиска", "");
	Результат.Вставить("Элементы", Новый Массив);
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.НаборСвойств.Вставить("ПоложениеКартинки", "Лево");     
	КоманднаяПанель.Элементы.Добавить(Результат);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеГруппыКнопок()  
	Результат = ПолучитьОписаниеЭлемента("ГруппаКнопок", Неопределено);
	Результат.Вставить("Элементы", Новый Массив);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеКоманднойПанели(Родитель)  
	Результат = ПолучитьОписаниеЭлемента("КоманднаяПанель", Родитель); 
	Результат.НаборСвойств.Вставить("ГоризонтальноеПоложение", "Лево");
	Результат.Вставить("Элементы", Новый Массив);
	
	Родитель.Элементы.Добавить(Результат);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПарсингКоманднойПанели(ПараметрыВыполнения)  
	ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	Текст = ТекЭлемент.Текст;
	
	ПозицияНачало = СтрНайтиСЭкранированием(Текст.Значение, Лексема("КоманднаяПанельНачало"), "СНачала");
	
	Если ПозицияНачало = 0 Тогда
		 Возврат Ложь;
	КонецЕсли; 
	 
	ТекстПоиск = ТекстСред(Текст, ПозицияНачало);
	
	Буфер = НовыйПустойТекст();	

	Пока Истина Цикл   
		ТекстДобавить(Буфер, Текст);
		
		Если СтрНайтиСЭкранированием(ТекстПоиск.Значение, Лексема("КоманднаяПанельКонец"), "СКонца") <> 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ ПерейтиНаСледующийЭлемент(ПараметрыВыполнения) Тогда
			Прервать;
		КонецЕсли;
		
		ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
		Текст = ТекЭлемент.Текст;
		ТекстПоиск = Текст;
	КонецЦикла;
	
	ПарсингКоманднойПанелиИзТекста(ПараметрыВыполнения, Буфер);    
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПарсингКоманднойПанелиИзТекста(ПараметрыВыполнения, Знач Текст)
	Текст = ПарсингСвойствСтрочногоЭлемента(Текст, ПараметрыВыполнения.НаборСвойств);
	
	Содержимое = ВыделитьНачальныйКонечныйСимволы(
		Текст, 
		Лексема("КоманднаяПанельНачало"), 
		Лексема("КоманднаяПанельКонец"));

	Текст = Содержимое.Текст;   

	НоваяКоманднаяПанель = ПолучитьОписаниеКоманднойПанели(ПараметрыВыполнения.Родитель);
	ЗаполнитьНаборСвойств(ПараметрыВыполнения, НоваяКоманднаяПанель);

	КоманднаяПанельИерархия = Новый Массив;
	
	МассивТекст = ТекстРазделить(Текст);
	Для Индекс = 0 По МассивТекст.ВГраница() Цикл
		ТекТекст = МассивТекст[Индекс];
		
		Если Индекс = 0 Тогда
			ПарсингКоманднойПанелиПерваяСтрока(ПараметрыВыполнения, НоваяКоманднаяПанель, ТекТекст);
			Продолжить;
		КонецЕсли;
		
		ПарсингМеню(
			ПараметрыВыполнения,
			НоваяКоманднаяПанель,
			КоманднаяПанельИерархия,
			ТекТекст);
	КонецЦикла;   
	ПарсингКоманднойПанелиДобавитьГруппыКнопок(НоваяКоманднаяПанель, НоваяКоманднаяПанель);
КонецПроцедуры

&НаКлиенте
Процедура ПарсингКоманднойПанелиПерваяСтрока(ПараметрыВыполнения, НоваяКоманднаяПанель, Текст)
	Кнопки = ПолучитьПодгруппыСтроки(Текст, Лексема("КоманднаяПанельРазделительКнопок"));
	Для Каждого ОписаниеКнопки Из Кнопки Цикл   
		ПарсингКнопкиКоманднойПанели(ПараметрыВыполнения, НоваяКоманднаяПанель, НоваяКоманднаяПанель, ОписаниеКнопки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПарсингКоманднойПанелиДобавитьГруппыКнопок(НоваяКоманднаяПанель, Родитель)
	ТекНаборЭлементов = Новый Массив;  
	НовыеЭлементы = Новый Массив;
	
	ГруппыКнопок = Новый Массив;
	БылиРазделители =  Ложь;
	
	Для Каждого Элемент Из Родитель.Элементы Цикл  
		Если Элемент.Тип = "Меню" Тогда
			ТекНаборЭлементов.Добавить(Элемент); 
			
			ПарсингКоманднойПанелиДобавитьГруппыКнопок(НоваяКоманднаяПанель, Элемент);
			Продолжить;
		КонецЕсли;
		
		Если СокрЛП(Элемент.НаборСвойств.Заголовок) = Лексема("КоманднаяПанельРазделительМеню") Тогда
			ЭлементГруппаКнопок = ПарсингГруппыКнопок(НоваяКоманднаяПанель, ТекНаборЭлементов);
			ГруппыКнопок.Добавить(ЭлементГруппаКнопок);
			
			НовыеЭлементы.Добавить(ЭлементГруппаКнопок);
			ТекНаборЭлементов.Очистить();
			
			БылиРазделители = Истина;
			
			Продолжить;
		КонецЕсли;
		ТекНаборЭлементов.Добавить(Элемент); 
	КонецЦикла;	 
	
	Если БылиРазделители И ТекНаборЭлементов.Количество() > 0 Тогда
		ЭлементГруппаКнопок = ПарсингГруппыКнопок(НоваяКоманднаяПанель, ТекНаборЭлементов);
		ГруппыКнопок.Добавить(ЭлементГруппаКнопок);
		
		НовыеЭлементы.Добавить(ЭлементГруппаКнопок);
	Иначе
		Для Каждого ТекЭлемент Из ТекНаборЭлементов Цикл
			НовыеЭлементы.Добавить(ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
	Родитель.Элементы = НовыеЭлементы;
	
	Для Каждого ГруппаКнопок Из ГруппыКнопок Цикл
		ГруппаКнопок.Родитель = Родитель;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПарсингГруппыКнопок(НоваяКоманднаяПанель, МассивЭлементов)
	ЭлементГруппаКнопок = ПолучитьОписаниеГруппыКнопок();

	Для Каждого ТекЭлемент Из МассивЭлементов Цикл
		ЭлементГруппаКнопок.Элементы.Добавить(ТекЭлемент);
		ТекЭлемент.Родитель = ЭлементГруппаКнопок;
	КонецЦикла;
	
	Возврат ЭлементГруппаКнопок;
КонецФункции

&НаКлиенте
Процедура ПарсингМеню(ПараметрыВыполнения, КоманднаяПанельСМеню, Иерархия, Знач Текст) 
	СтрУровень = ВыделитьУровеньИзИерархическогоЭлемента(Текст);  

	Если СтрУровень.Уровень = 0 Тогда
		ТекЭлементМеню = ПолучитьКнопкуМеню(СтрУровень.Текст, КоманднаяПанельСМеню);
	Иначе
		ТекРодитель = Иерархия[СтрУровень.Уровень - 1];  
		
		Если ТекРодитель.Тип = "Кнопка" Тогда
			ТекРодитель.Тип = "Меню";
		КонецЕсли;
		
		ТекЭлементМеню = ПарсингКнопкиКоманднойПанели(
			ПараметрыВыполнения, 
			КоманднаяПанельСМеню, 
			ТекРодитель, 
			СтрУровень.Текст); 
			
		// Пустой текст в названии кнопки
		Если ТекЭлементМеню = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекИерархия = Новый Массив;
	
	Для СчРодители = 0 По СтрУровень.Уровень - 1 Цикл
		ТекИерархия.Добавить(Иерархия[СчРодители]);
	КонецЦикла;
	ТекИерархия.Добавить(ТекЭлементМеню);
	Иерархия = ТекИерархия;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКнопкуМеню(Меню, КоманднаяПанель)
	ТекстСКартинкой = ПолучитьТекстСКартинкой(Меню);
    КлючПоиска = ПолучитьКлючПоискаКнопки(ТекстСКартинкой);
	
	Возврат НайтиКнопкуКоманднойПанелиПоКлючу(КоманднаяПанель, КлючПоиска);
КонецФункции

&НаКлиенте
Функция ПолучитьКлючПоискаКнопки(ТекстСКартинкой)
	Если ПустаяСтрока(ТекстСКартинкой.Текст) Тогда
		Возврат "@" + НРег(СокрЛП(ТекстСКартинкой.Картинка));
	КонецЕсли;
	
	Возврат НРег(СокрЛП(ТекстСКартинкой.Текст));
КонецФункции

&НаКлиенте
Функция ПарсингКнопкиКоманднойПанели(ПараметрыВыполнения, ТекущаяКоманднаяПанель, Родитель, Знач Текст) 
	
	Если ПустаяСтрока(Текст.Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяКнопка = ПолучитьОписаниеКнопки(Родитель); 
	
    Текст = ПарсингНабораСвойств(НоваяКнопка.НаборСвойств, Текст); 

	ТекстСКартинкой = ПолучитьТекстСКартинкой(Текст);
	
	НоваяКнопка.НаборСвойств.Заголовок = ТекстСКартинкой.Текст;
	НоваяКнопка.НаборСвойств.ПоложениеКартинки = ТекстСКартинкой.ПоложениеКартинки;
	НоваяКнопка.Картинка = ТекстСКартинкой.Картинка; 
    НоваяКнопка.КлючПоиска = ПолучитьКлючПоискаКнопки(ТекстСКартинкой);

	Возврат НоваяКнопка;
КонецФункции

&НаКлиенте
Функция НайтиКнопкуКоманднойПанелиПоКлючу(Родитель, КлючПоиска)
	Для Каждого Элемент Из Родитель.Элементы Цикл
		Если Элемент.Тип <> "ГруппаКнопок" 
			И Элемент.КлючПоиска = КлючПоиска Тогда
			Возврат Элемент;
		КонецЕсли;    
		
		РезультатПоиска = НайтиКнопкуКоманднойПанелиПоКлючу(Элемент, КлючПоиска);
		Если РезультатПоиска <> Неопределено Тогда
			Возврат РезультатПоиска;
		КонецЕсли;
	КонецЦикла;    
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти 

#Область ПарсингФлажка

&НаКлиенте
Функция ПолучитьОписаниеФлажка(Родитель) 
	Результат = ПолучитьОписаниеЭлемента("Флажок", Родитель);
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.НаборСвойств.Вставить("ПоложениеЗаголовка", "Право");
	Результат.НаборСвойств.Вставить("ГоризонтальноеПоложение", "Лево");
	Результат.Вставить("Значение", Ложь);
	
	Родитель.Элементы.Добавить(Результат);
	
	Возврат Результат;
	
КонецФункции 
 
&НаКлиенте
Функция ПарсингФлажкаЛевый(ПараметрыВыполнения, Знач Текст) 
	Если НЕ ТекстНачинаетсяС(Текст, "[") Тогда
		 Возврат Ложь;
	КонецЕсли;

	РезультатПарсинга = ПолучитьГруппуСтроки(Текст, "[", "]", "СНачала");
	ПараметрыПарсинга = ПараметрыПарсингаФлажка(РезультатПарсинга, "Право");
	
	ПарсингФлажкаОбщий(ПараметрыВыполнения, ПараметрыПарсинга); 
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ПарсингФлажкаПравый(ПараметрыВыполнения, Знач Текст) 
	Если НЕ ТекстЗаканчиваетсяНа(Текст, "]") Тогда
		 Возврат Ложь;
	КонецЕсли;

	РезультатПарсинга = ПолучитьГруппуСтроки(Текст, "[", "]", "СКонца");
	ПараметрыПарсинга = ПараметрыПарсингаФлажка(РезультатПарсинга, "Лево");
	
	ПарсингФлажкаОбщий(ПараметрыВыполнения, ПараметрыПарсинга); 
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ПараметрыПарсингаФлажка(РезультатПарсинга, ПоложениеЗаголовка) 
	Результат = Новый Структура("ПоложениеЗаголовка,Заголовок,Значение");
	Результат.ПоложениеЗаголовка = ПоложениеЗаголовка;
	Результат.Заголовок = РезультатПарсинга.Текст;
	Результат.Значение = НЕ ПустаяСтрока(РезультатПарсинга.Группа.Значение);
	
	Возврат Результат;
КонецФункции 

&НаКлиенте
Процедура ПарсингФлажкаОбщий(ПараметрыВыполнения, ПараметрыПарсинга)
	Родитель = ПараметрыВыполнения.Родитель;

	НовыйЭлемент = ПолучитьОписаниеФлажка(Родитель);
	НовыйЭлемент.НаборСвойств.ПоложениеЗаголовка = ПараметрыПарсинга.ПоложениеЗаголовка;
	НовыйЭлемент.НаборСвойств.Заголовок = СокрЛП(ПараметрыПарсинга.Заголовок.Значение);
	НовыйЭлемент.Значение = ПараметрыПарсинга.Значение;
	ЗаполнитьНаборСвойств(ПараметрыВыполнения, НовыйЭлемент);

КонецПроцедуры

#КонецОбласти

 #Область ПарсингТаблицы
 
&НаКлиенте
Функция ПолучитьОписаниеТаблицы(Родитель)  
	Результат = ПолучитьОписаниеЭлемента("Таблица", Родитель); 
	Результат.Вставить("Колонки", Новый Массив);
	Результат.Вставить("Строки", Новый Массив);
	
	Родитель.Элементы.Добавить(Результат);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеКолонкиТаблицы(Родитель)   
	Результат = ПолучитьОписаниеЭлемента("КолонкаТаблицы", Родитель); 
	Результат.Вставить("ЕстьКартинка", Ложь);
	Результат.Вставить("ЕстьФлажок", Ложь);
	Результат.Вставить("ЕстьЗначение", Ложь);	
	Результат.Вставить("УИДФлажок", Новый УникальныйИдентификатор);	
	Результат.Вставить("Колонки", Новый Массив);
	
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.НаборСвойств.Вставить("ГоризонтальноеПоложение", "Лево");
	
	Родитель.Колонки.Добавить(Результат);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеСтрокиТаблицы(Родитель)
	Результат = ПолучитьОписаниеЭлемента("СтрокаТаблицы", Родитель); 
	Результат.Вставить("Ячейки", Новый Массив);
	Результат.Вставить("Строки", Новый Массив);
	Родитель.Строки.Добавить(Результат);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеЯчейкиТаблицы(СтрокаТаблицы)
	Результат = ПолучитьОписаниеЭлемента("ЯчейкаТаблицы", СтрокаТаблицы); 
	Результат.Вставить("Значение", "");
	Результат.Вставить("ЕстьФлажок", Ложь);
	Результат.Вставить("ЕстьКартинка", Ложь);
	Результат.Вставить("ЗначениеФлажка", Ложь);
	Результат.Вставить("Картинка", Неопределено);
	
	СтрокаТаблицы.Ячейки.Добавить(Результат);
	
	Возврат Результат;
КонецФункции

 &НаКлиенте
Функция ПарсингТаблицы(ПараметрыВыполнения) 
	ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	Текст = ТекЭлемент.Текст;
	 
	Колонки = ПолучитьПодгруппыСтроки(Текст, Лексема("ТаблицаРазделитель"));
	
	КоличествоКолонок = Колонки.Количество();
	Если Колонки.Количество() <= 1 Тогда
		Возврат Ложь;
	КонецЕсли;       
	
	Родитель = ПараметрыВыполнения.Родитель;
	
	Таблица = ПолучитьОписаниеТаблицы(Родитель);
	ЗаполнитьНаборСвойств(ПараметрыВыполнения, Таблица);
	
	ПараметрыПарсингаТаблицы = Новый Структура(
		"Таблица,ЗаголовокЗаполнен,КоличествоКолонок,ВысотаСтроки,НаборКолонок,ПолныйФормат",
		Таблица,
		Ложь,
		КоличествоКолонок,
		1,
		Неопределено,
		Ложь);
	//НаборКолонок = новый Массив;
	//ТекущаяКолонка = Неопределено;
	//ТекущиеКолонки = Новый Массив;
	//Для Каждого Колонка Из Колонки Цикл
	//	Если ЭтоПустаяКолонка(Колонка) Тогда
	//		
	//	КонецЕсли;	
	//КонецЦикла;	
	
	Пока Истина Цикл
		Выполнен = Ложь;
		Если ПарсингРазделителяЗаголовкаТаблицы(ПараметрыПарсингаТаблицы, Таблица, Колонки) Тогда
			Выполнен = Истина;
			Возврат Истина;
		КонецЕсли;    

		Если НЕ Выполнен И ПарсингЗаголовкаТаблицы(ПараметрыПарсингаТаблицы, Таблица, Колонки) Тогда
			Выполнен = Истина;
		КонецЕсли;          
		
		//Если ПарсингСтрокиТаблицы(ПараметрыВыполнения, Таблица, Колонки) Тогда
		//	Возврат Истина;
		//КонецЕсли;  	
		
		Если НЕ ПерейтиНаСледующийЭлемент(ПараметрыВыполнения) Тогда
			Прервать;
		КонецЕсли;
		
		ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
		Текст = ТекЭлемент.Текст;
		Колонки = ПолучитьПодгруппыСтроки(Текст, Лексема("ТаблицаРазделитель"));
	КонецЦикла;
 
	//Возврат Ложь;       
	
	//ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	//Текст = ТекЭлемент.Текст;
	//
	//ПозицияНачало = СтрНайтиСЭкранированием(Текст.Значение, Лексема("КоманднаяПанельНачало"), "СНачала");
	//
	//Если ПозицияНачало = 0 Тогда
	//	 Возврат Ложь;                                                    |f|f|d|
	//КонецЕсли;                                                          |f|f|d|
	// 
	//ТекстПоиск = ТекстСред(Текст, ПозицияНачало);
	//
	//Буфер = НовыйПустойТекст();	

	//Пока Истина Цикл   
	//	ТекстДобавить(Буфер, Текст);
	//	
	//	Если СтрНайтиСЭкранированием(ТекстПоиск.Значение, Лексема("КоманднаяПанельКонец"), "СКонца") <> 0 Тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//	Если НЕ ПерейтиНаСледующийЭлемент(ПараметрыВыполнения) Тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//	ТекЭлемент = ПолучитьТекущийЭлемент(ПараметрыВыполнения);
	//	Текст = ТекЭлемент.Текст;
	//	ТекстПоиск = Текст;
	//КонецЦикла;
	//
	//ПарсингКоманднойПанелиИзТекста(ПараметрыВыполнения, Буфер);    
	//
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПарсингЗаголовкаТаблицы(ПараметрыВыполнения, Таблица, Колонки) 
	
	Если ПараметрыВыполнения.ЗаголовокЗаполнен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементКолонка = Колонки[0];
	ПараметрыВыполнения.ПолныйФормат = ПустаяСтрока(ЭлементКолонка.Значение);
	Если ПараметрыВыполнения.ПолныйФормат Тогда
		Колонки.Удалить(Колонки.ВГраница());
		Колонки.Удалить(0);
	КонецЕсли;
	
	ПрошлыйНаборКолонок = ПараметрыВыполнения.НаборКолонок;
	
	НаборКолонок = Новый Массив;
	
	// Порядок определения родителя для пустой колонки
	// 1. Если родитель изменился - родитель
	// 2. Если была уже заполненная колонка - берем ее, - это продолжение
	// 3. Иначе - родитель
	
	ТекущаяКолонка = Неопределено;
	ТекущаяРодитель = Неопределено;
	Для Сч = 0 По Колонки.ВГраница() Цикл
		ЭлементКолонка = Колонки[Сч];
		
		КолонкаРодитель = Неопределено;
		Если ПрошлыйНаборКолонок <> Неопределено Тогда
			КолонкаРодитель = ПрошлыйНаборКолонок[Сч];
		КонецЕсли;
		
		Если ТекущаяРодитель <> КолонкаРодитель Тогда
			ТекущаяКолонка = Неопределено;
		КонецЕсли;  
		
		ТекущаяРодитель = КолонкаРодитель;
		
		Если ЭтоПустаяКолонка(ЭлементКолонка) Тогда
			Если ТекущаяКолонка = Неопределено Тогда
				НаборКолонок.Добавить(КолонкаРодитель);
			Иначе
				НаборКолонок.Добавить(ТекущаяКолонка);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если КолонкаРодитель = Неопределено Тогда
			КолонкаРодитель = Таблица;
		КонецЕсли;
		
		НовыйЭлемент = ПолучитьОписаниеКолонкиТаблицы(КолонкаРодитель);
		Текст = ПарсингНабораСвойств(НовыйЭлемент.НаборСвойств, ЭлементКолонка);
		
		НовыйЭлемент.ЕстьЗначение = Истина;
		
		СтрНачальныйКонечный = ВыделитьНачальныйКонечныйСимволы(
			Текст, 
			Лексема("ТаблицаКолонкаГруппа"),
			Лексема("ТаблицаКолонкаГруппа"));
		
		Если СтрНачальныйКонечный.ЕстьНачальный 
				И СтрНачальныйКонечный.ЕстьКонечный Тогда
			НовыйЭлемент.Тип = "ГруппаКолонокТаблицы";
		КонецЕсли;
		
		НовыйЭлемент.НаборСвойств.Заголовок = СокрЛП(СтрНачальныйКонечный.Текст.Значение);  
		
		НаборКолонок.Добавить(НовыйЭлемент); 
		
		ТекущаяКолонка = НовыйЭлемент;
	КонецЦикла; 
	
	ПараметрыВыполнения.НаборКолонок = НаборКолонок;
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ЭтоПустаяКолонка(Колонка)
	Возврат ПустаяСтрока(Колонка.Значение);
КонецФункции

&НаКлиенте
Функция ЭтоКонечныйЭлементТаблицы(Знач Значение)
	Значение = СокрЛП(Значение);
	
	Если СтрНачинаетсяС(Значение, ":") Тогда
		Значение = Сред(Значение, 2);
	КонецЕсли;

	Если СтрЗаканчиваетсяНа(Значение, ":") Тогда
		Значение = Сред(Значение, 1, СтрДлина(Значение) - 1);
	КонецЕсли;
	
	Возврат ЭтоКонечныйЭлемент(Значение);
КонецФункции

&НаКлиенте
Функция ПарсингРазделителяЗаголовкаТаблицы(ПараметрыВыполнения, Таблица, Колонки) 
	Если ПараметрыВыполнения.ЗаголовокЗаполнен Тогда
		Возврат Ложь;
	КонецЕсли;      
	
	МассивГоризонтальноеПоложение = Новый Массив;
	Для Сч = 0 По Колонки.ВГраница() Цикл 
		ЭлементКолонка = Колонки[Сч];
		Если ПараметрыВыполнения.ПолныйФормат И (Сч = 0 ИЛИ Сч = Колонки.ВГраница()) Тогда
			Продолжить;	
		КонецЕсли;
		Содержимое = ВыделитьНачальныйКонечныйСимволы(ЭлементКолонка, ":", ":");
		Текст = Содержимое.Текст;
		
		Если НЕ ЭтоКонечныйЭлемент(Текст.Значение) Тогда
			Возврат Ложь;
		КонецЕсли;                               
		
		Если Содержимое.ЕстьНачальный И Содержимое.ЕстьКонечный Тогда
			МассивГоризонтальноеПоложение.Добавить("Центр");
		ИначеЕсли Содержимое.ЕстьКонечный Тогда
			МассивГоризонтальноеПоложение.Добавить("Право");
		Иначе
			МассивГоризонтальноеПоложение.Добавить("Лево");
		КонецЕсли;
	КонецЦикла;

	Сч = 0;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если Сч > МассивГоризонтальноеПоложение.ВГраница()  Тогда
			Прервать;
		КонецЕсли;
		Колонка.НаборСвойств.Вставить("ГоризонтальноеПоложение", МассивГоризонтальноеПоложение[Сч]);
		Сч = Сч + 1;
	КонецЦикла;   
	
	ПараметрыВыполнения.ЗаголовокЗаполнен = Истина;
	
	Возврат Истина;
КонецФункции
 
&НаКлиенте
Функция ВыделитьУровеньИзИерархическогоЭлемента(Знач Текст)
	Результат = Новый Структура("Текст,Уровень", Текст, 0);
	
	Пока Истина Цикл
		СтрУровень = ВыделитьНачальныйКонечныйСимволы(Результат.Текст, ".", Неопределено);
		Если НЕ СтрУровень.ЕстьНачальный Тогда
			Прервать;
		КонецЕсли;
		
		Результат.Уровень = Результат.Уровень + 1;
		Результат.Текст = СтрУровень.Текст;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуТаблицы(ПараметрыВыполнения, Знач Текст) 
	Результат = Новый Структура("СтрокаТаблицы,Уровень,Текст");
	
	СтрУровень = ВыделитьУровеньИзИерархическогоЭлемента(Текст);  
	
	Результат.Текст = СтрУровень.Текст;
	Результат.Уровень = СтрУровень.Уровень;
	
	Таблица = ПараметрыВыполнения.Таблица;

	Если СтрУровень.Уровень = 0 Тогда
		Результат.СтрокаТаблицы = ПолучитьОписаниеСтрокиТаблицы(Таблица);
	Иначе
		ТекРодитель = ПараметрыВыполнения.ТаблицаИерархия[СтрУровень.Уровень - 1];
		Результат.СтрокаТаблицы = ПолучитьОписаниеСтрокиТаблицы(ТекРодитель);
	КонецЕсли;             
	
	Иерархия = Новый Массив;
	
	Для СчРодители = 0 По СтрУровень.Уровень - 1 Цикл
		Иерархия.Добавить(ПараметрыВыполнения.ТаблицаИерархия[СчРодители]);
	КонецЦикла;
	Иерархия.Добавить(Результат.СтрокаТаблицы);
	ПараметрыВыполнения.ТаблицаИерархия = Иерархия;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПарсингЯчейкиТаблицы(ПараметрыВыполнения, КолонкаТаблицы, СтрокаТаблицы, Текст)
	
	НоваяЯчейка = ПолучитьОписаниеЯчейкиТаблицы(СтрокаТаблицы);
	
	Текст = ПарсингНабораСвойств(НоваяЯчейка.НаборСвойств, Текст);
	
	Если ТекстНачинаетсяС(Текст, "[") Тогда
		РезультатПарсинга = ПолучитьГруппуСтроки(Текст, "[", "]", "СНачала");
		ПараметрыПарсинга = ПараметрыПарсингаФлажка(РезультатПарсинга, "Право");
		
		СтроковоеЗначение = СокрЛП(ПараметрыПарсинга.Заголовок.Значение);
		НоваяЯчейка.Значение = СтроковоеЗначение;
		НоваяЯчейка.ЕстьФлажок = Истина;
		НоваяЯчейка.ЗначениеФлажка = ПараметрыПарсинга.Значение;  	
		
		Если НЕ ПустаяСтрока(СтроковоеЗначение) Тогда
			КолонкаТаблицы.ЕстьЗначение = Истина;
		КонецЕсли;

		КолонкаТаблицы.ЕстьФлажок = Истина;

		Возврат;
	КонецЕсли;

	СтроковоеЗначение = СокрЛП(Текст.Значение);
	
	НоваяЯчейка.Значение = СтроковоеЗначение;  	
	
	Если НЕ ПустаяСтрока(СтроковоеЗначение) Тогда
		КолонкаТаблицы.ЕстьЗначение = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПарсингСтрокиТаблицы(ПараметрыВыполнения, Таблица, Колонки) 
	Если НЕ ПараметрыВыполнения.ТаблицаЗаголовокЗаполнен Тогда
		Возврат Ложь;
	КонецЕсли;   

	СтрокаТаблицы = Неопределено;
	
	ПерваяКолонка = Истина;

	Для Сч = 0 По Колонки.ВГраница() Цикл 
		ЭлементКолонка = Колонки[Сч];
		Если ПараметрыВыполнения.ТаблицаПолныйФормат И (Сч = 0 ИЛИ Сч = Колонки.ВГраница()) Тогда
			Продолжить;	
		КонецЕсли;
		
		ИндексКолонки = Сч - ?(ПараметрыВыполнения.ТаблицаПолныйФормат, 1, 0);
		КолонкаТаблицы = Таблица.Колонки[ИндексКолонки]; 
		Текст = ЭлементКолонка;
		Если ПерваяКолонка Тогда
			ДанныеСтрокаТаблицы = ПолучитьСтрокуТаблицы(ПараметрыВыполнения, Текст);
			СтрокаТаблицы = ДанныеСтрокаТаблицы.СтрокаТаблицы;
			
			Если ДанныеСтрокаТаблицы.Уровень > 0 Тогда
				Таблица.Тип = "Дерево";
			КонецЕсли;
			
			Текст = ДанныеСтрокаТаблицы.Текст;
			
			ПерваяКолонка = Ложь;
		КонецЕсли;
		
		ПарсингЯчейкиТаблицы(ПараметрыВыполнения, КолонкаТаблицы, СтрокаТаблицы, Текст);
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

 #КонецОбласти

#Область ПарсингПоляВвода

&НаКлиенте
Функция ПолучитьОписаниеПоляВвода(Родитель) 
	Результат = ПолучитьОписаниеЭлемента("ПолеВвода", Родитель);
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.НаборСвойств.Вставить("ПоложениеЗаголовка", "Лево");
	Результат.НаборСвойств.Вставить("ГоризонтальноеПоложение", "Лево");
	
	Результат.Вставить("Значение", "");
	
	Родитель.Элементы.Добавить(Результат);
	
	Возврат Результат;
КонецФункции 
 
&НаКлиенте
Функция ПарсингПоляВвода(ПараметрыВыполнения, Знач Текст) 
	КлючЗначение = ПолучитьКлючЗначениеТекста(Текст, ":");
	
	Если НЕ КлючЗначение.Найден Тогда
		 Возврат Ложь;
	КонецЕсли;

	Родитель = ПараметрыВыполнения.Родитель;

	ЗаголовокЭлемента = СокрЛП(КлючЗначение.Ключ.Значение);
	Значение = КлючЗначение.Значение;
	КлючиСвойств = Неопределено;

	СвойстваПоляВвода = ПолучитьКлючЗначениеТекста(Значение, "__");
	Если СвойстваПоляВвода.Найден Тогда
		Значение = СвойстваПоляВвода.Ключ;
		КлючиСвойств = СокрЛП(СвойстваПоляВвода.Значение.Значение);
	КонецЕсли;   
	
	СтрокаЗначение = СокрЛП(Значение.Значение);
	
	НовыйЭлемент = ПолучитьОписаниеПоляВвода(Родитель);
	НовыйЭлемент.НаборСвойств.Заголовок = ЗаголовокЭлемента;
	НовыйЭлемент.Значение = СокрЛП(Значение.Значение);       
	Если ПустаяСтрока(СтрокаЗначение) Тогда
		НовыйЭлемент.НаборСвойств.ПоложениеЗаголовка = "Верх";
	КонецЕсли;
	
	ЗаполнитьНаборСвойств(ПараметрыВыполнения, НовыйЭлемент);
	
	ПарсингПоляВводаМодификаторы(КлючиСвойств, НовыйЭлемент);

	ПараметрыВыполнения.ПолеВвода = НовыйЭлемент;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПарсингПоляВводаМодификаторы(Модификаторы, ЭлементДанных)
	Если Модификаторы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для СчКлюча = 1 По СтрДлина(Модификаторы) Цикл
		КлючСвойств = НРег(Сред(Модификаторы, СчКлюча, 1));
		Если КлючСвойств = "v" ИЛИ КлючСвойств = "с" Тогда
			ЭлементДанных.НаборСвойств.Вставить("КнопкаВыпадающегоСписка", Истина);
		ИначеЕсли КлючСвойств = "." ИЛИ КлючСвойств = "в" Тогда
			ЭлементДанных.НаборСвойств.Вставить("КнопкаВыбора", Истина);
		ИначеЕсли КлючСвойств = "х" ИЛИ КлючСвойств = "x" Тогда
			ЭлементДанных.НаборСвойств.Вставить("КнопкаОчистки", Истина);
		ИначеЕсли КлючСвойств = "^" или КлючСвойств = "д" Тогда
			ЭлементДанных.НаборСвойств.Вставить("КнопкаРегулирования", Истина);
		ИначеЕсли КлючСвойств = "о" ИЛИ КлючСвойств = "o" Тогда
			ЭлементДанных.НаборСвойств.Вставить("КнопкаОткрытия", Истина);
		Иначе 
			// Ошибка
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 
&НаКлиенте
Функция ПарсингМногострочногоПоляВвода(ПараметрыВыполнения, Знач Текст) 
	Если НЕ ЭтоМногострочноеПолеВвода(Текст.Значение) Тогда
		Возврат Ложь;
	КонецЕсли;     
	
	СвойстваПоляВвода = ПараметрыВыполнения.ПолеВвода.НаборСвойств;
	
	СвойстваПоляВвода.Вставить("МногострочныйРежим", Истина);
	
	Если СвойстваПоляВвода.Свойство("Высота") Тогда
		ТекВысота = СвойстваПоляВвода.Высота;
	Иначе 
		ТекВысота = 1;
	КонецЕсли;
	
	СвойстваПоляВвода.Вставить("Высота", ТекВысота + 1);
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция ЭтоМногострочноеПолеВвода(Знач Значение)
	Значение = СокрЛП(Значение);
	Возврат Значение <> "" И СтрЗаменить(Значение, "_", "") = "";
КонецФункции

#КонецОбласти   

#Область ПарсингНадписи

&НаКлиенте
Функция ПолучитьОписаниеНадписи(Родитель) 
	Результат = ПолучитьОписаниеЭлемента("Надпись", Родитель);
	Результат.НаборСвойств.Вставить("Заголовок", "");
	Результат.НаборСвойств.Вставить("ГоризонтальноеПоложение", "Лево");
	
	Родитель.Элементы.Добавить(Результат);
	
	Возврат Результат;
КонецФункции 
 
&НаКлиенте
Функция ПарсингНадписи(ПараметрыВыполнения, Знач Текст) 
	Если ПустаяСтрока(Текст.Значение) Тогда
		 Возврат Ложь;
	КонецЕсли;

	НовыйЭлемент = ПолучитьОписаниеНадписи(ПараметрыВыполнения.Родитель);
	НовыйЭлемент.НаборСвойств.Заголовок = СокрЛП(Текст.Значение);
	ЗаполнитьНаборСвойств(ПараметрыВыполнения, НовыйЭлемент);

	Возврат Истина;
КонецФункции

#КонецОбласти   

#КонецОбласти   

#Область РаботаСТекстом

&НаКлиенте
Функция НовыйТекст(Значение, Верх, Лево)
	Результат = НовыйПустойТекст();
	Результат.Значение = Значение;
	
	Результат.Координаты.Добавить(НовыеКоординаты(Верх, Лево));
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция НовыйПустойТекст()
	Результат = Новый Структура("Значение,Координаты", "", Новый массив);
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция НовыеКоординаты(Верх, Лево)
	Возврат Новый Структура("Верх,Лево", Верх, Лево);
КонецФункции

&НаКлиенте
Функция ТекстЛев(Текст, ЧислоСимволов)  
	СтрДоПосле = ТекстРазделитьПоИндексу(Текст, ЧислоСимволов + 1);
	
	Возврат СтрДоПосле.До;
КонецФункции

&НаКлиенте
Функция ТекстНачинаетсяС(Текст, СтрокаПоиска)
	Возврат СтрНачинаетсяС(СокрЛ(Текст.Значение), СтрокаПоиска);
КонецФункции

&НаКлиенте
Функция ТекстЗаканчиваетсяНа(Текст, СтрокаПоиска)
	Возврат СтрЗаканчиваетсяНа(СокрП(Текст.Значение), СтрокаПоиска);
КонецФункции

&НаКлиенте
Функция ТекстСред(Текст, НачальныйНомер, ЧислоСимволов = Неопределено)
	СтрДоПосле = ТекстРазделитьПоИндексу(Текст, НачальныйНомер);
	
	Если ЧислоСимволов = Неопределено Тогда
		Возврат СтрДоПосле.После;
	КонецЕсли;
	
	СтрДоПосле = ТекстРазделитьПоИндексу(СтрДоПосле.После, ЧислоСимволов + 1);

	Возврат СтрДоПосле.До;
КонецФункции  

&НаКлиенте
Функция ТекстРазделитьПоИндексу(Текст, Знач Индекс)
	ТекстДо = НовыйПустойТекст();
	ТекстПосле = НовыйПустойТекст();
	
	ТекстДоДобавлен = Ложь;
	МассивТекст = ТекстРазделить(Текст);
	Для Каждого ТекТекст Из МассивТекст Цикл
		Если ТекстДоДобавлен Тогда
			ТекстДобавить(ТекстПосле, ТекТекст);
			Продолжить;
		КонецЕсли;
		
		Длина = ТекстДлина(ТекТекст);
		Если Индекс > Длина Тогда
			Индекс = Индекс - Длина;
			ТекстДобавить(ТекстДо, ТекТекст);
			Продолжить;
		КонецЕсли;
		
		Если Индекс > 1 Тогда
			СтрокаДо = Лев(ТекТекст.Значение, Индекс - 1); 
			НовыйТекстДо = НовыйТекст(СтрокаДо, ТекТекст.Координаты[0].Верх, ТекТекст.Координаты[0].Лево);
			ТекстДобавить(ТекстДо, НовыйТекстДо);
		КонецЕсли;

		СтрокаПосле = Сред(ТекТекст.Значение, Индекс); 
		НовыйТекстПосле = НовыйТекст(СтрокаПосле, ТекТекст.Координаты[0].Верх, ТекТекст.Координаты[0].Лево + Индекс - 1);
		ТекстДобавить(ТекстПосле, НовыйТекстПосле);
		
		ТекстДоДобавлен = Истина;
	КонецЦикла;

	Возврат Новый Структура("До,После", ТекстДо, ТекстПосле);
КонецФункции

&НаКлиенте
Функция ТекстДлина(Текст)
	Возврат СтрДлина(Текст.Значение);
КонецФункции

&НаКлиенте
Процедура ТекстДобавить(Текст, ДобавляемыйТекст)
	Если Текст.Координаты.Количество() > 0 Тогда
		Текст.Значение = Текст.Значение + Символы.ПС;
	КонецЕсли;
	
	Текст.Значение = Текст.Значение + ДобавляемыйТекст.Значение;
	
	Для Каждого Координата Из ДобавляемыйТекст.Координаты Цикл
		Текст.Координаты.Добавить(Координата);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ТекстРазделить(Текст)
	Результат = Новый Массив;
	Значения = СтрРазделить(Текст.Значение, Символы.ПС);
	
	Для Сч = 0 По Значения.ВГраница() Цикл
		Значение = Значения[Сч];
		Координата = Текст.Координаты[Сч];  
		НовыйТекст = НовыйТекст(Значение, Координата.Верх, Координата.Лево);
		Результат.Добавить(НовыйТекст);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СтрНайтиСЭкранированием(Знач Строка, ПодстрокаПоиска, Направление = "СНачала")
	Строка = СтрЗаменить(Строка, Символы.ПС, "");
	НомерВхождения = 1;
	Пока Истина Цикл
		Позиция = СтрНайти(Строка, ПодстрокаПоиска, НаправлениеПоиска[Направление], , НомерВхождения);	
		НомерВхождения = НомерВхождения + 1;
		
		Если Направление = "СНачала" Тогда
			Подстрока = Лев(Строка, Позиция);
		Иначе
			Подстрока = Сред(Строка, Позиция);
		КонецЕсли;

		Если Позиция = 0 Тогда
			Возврат 0;
		КонецЕсли;
		
		Если СтрЧислоВхождений(Подстрока, """") % 2 <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрЧислоВхождений(Подстрока, "'") % 2 <> 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		Возврат Позиция;
	КонецЦикла;
КонецФункции

&НаКлиенте
Функция ПолучитьКлючЗначениеТекста(Знач Текст, Разделитель, Направление = "СНачала")
	Результат = Новый Структура("Значение,Ключ,Найден", Текст, "", Ложь);
	
	Позиция = СтрНайтиСЭкранированием(Текст.Значение, Разделитель, Направление);
	
	Если Позиция = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.Найден = Истина;
	Результат.Ключ =  ТекстЛев(Текст, Позиция - 1);
	Результат.Значение = ТекстСред(Текст, Позиция + СтрДлина(Разделитель));
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьПодгруппыСтроки(Знач Строка, Разделитель)
	Результат = Новый Массив;
	
	Пока Истина Цикл
		СтрКлючЗначение = ПолучитьКлючЗначениеТекста(Строка, Разделитель);
		Если НЕ СтрКлючЗначение.Найден Тогда
			Прервать;
		КонецЕсли;
		
		Результат.Добавить(СтрКлючЗначение.Ключ);
		
		Строка = СтрКлючЗначение.Значение;
	КонецЦикла;

	Результат.Добавить(Строка);
	
	Возврат Результат;
КонецФункции 

&НаКлиенте
Функция ВыделитьНачальныйКонечныйСимволы(Текст, НачальныеСимволы = Неопределено, КонечныеСимволы = Неопределено)
	Результат = Новый Структура("Текст,ЕстьНачальный,ЕстьКонечный", Текст, Ложь, Ложь);
	
	ТекТекст = Текст;
	
	Если НачальныеСимволы <> Неопределено И ТекстНачинаетсяС(ТекТекст, НачальныеСимволы) Тогда  
		ГруппаСтроки = ПолучитьГруппуСтроки(ТекТекст, Неопределено, НачальныеСимволы, "СНачала");
		
		Если ГруппаСтроки.Найден Тогда
			Результат.ЕстьНачальный = Истина;
			ТекТекст = ГруппаСтроки.Текст;
		КонецЕсли;
	КонецЕсли;   
	
	Если КонечныеСимволы <> Неопределено И ТекстЗаканчиваетсяНа(ТекТекст, КонечныеСимволы) Тогда   
		ГруппаСтроки = ПолучитьГруппуСтроки(ТекТекст, КонечныеСимволы, Неопределено, "СКонца");
		
		Если ГруппаСтроки.Найден Тогда
			Результат.ЕстьКонечный = Истина;
			ТекТекст = ГруппаСтроки.Текст;			
		КонецЕсли;
	КонецЕсли;

	Результат.Текст = ТекТекст;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьГруппуСтроки(Текст, Открывающая, Закрывающая = Неопределено, Направление = "СНачала")
	Результат = Новый Структура("Текст,Группа,Найден", Текст, "", Ложь);

	Если Открывающая <> Неопределено И Направление = "СНачала" И НЕ ТекстНачинаетсяС(Текст, Открывающая) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Если Закрывающая <> Неопределено И Направление = "СКонца" И НЕ ТекстЗаканчиваетсяНа(Текст, Закрывающая) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	Если Направление = "СНачала" Тогда    
		Если Открывающая <> Неопределено Тогда
			КЗСтроки = ПолучитьКлючЗначениеТекста(Результат.Текст, Открывающая, Направление);
			Результат.Текст = КЗСтроки.Значение;
		КонецЕсли;
		
		Разделитель = Закрывающая;

		ПолеГруппа = "Ключ";
		ПолеСтрока = "Значение";
	Иначе
		Если Закрывающая <> Неопределено Тогда
			КЗСтроки = ПолучитьКлючЗначениеТекста(Результат.Текст, Закрывающая, Направление);
			Результат.Текст = КЗСтроки.Ключ;
		КонецЕсли;
		
		Разделитель = Открывающая;
		
		ПолеГруппа = "Значение";
		ПолеСтрока = "Ключ";
	КонецЕсли;
	
	СтрКлючЗначение = ПолучитьКлючЗначениеТекста(Результат.Текст, Разделитель, Направление);
	Если НЕ СтрКлючЗначение.Найден Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Найден = Истина;
	Результат.Текст = СтрКлючЗначение[ПолеСтрока];
	Результат.Группа = СтрКлючЗначение[ПолеГруппа];
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти  

#КонецОбласти