// MIT License

// Copyright (c) 2025 Zherebtsov Nikita <nikita@crimsongold.ru>

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/crimsongoldteam/md_design

#Область ОписаниеПеременных

// Структура, хранящие в себе инициализированные модули
&НаКлиенте
Перем мМодули;

// Абстрактное синтаксическое дерево
&НаКлиенте
Перем мСемантическоеДерево;

// Текущая строка таблицы группы
&НаКлиенте
Перем мТекущаяСтрокаГруппы;

// Контекст редактора
&НаКлиенте
Перем мКонтекстОкнаРедактораHTML;

&НаКлиенте
Перем ЭтоLinux;

&НаКлиенте
Перем мТекущееИмяФайла;

&НаКлиенте
Перем мПутьКФайлу;

&НаКлиенте
Перем мОтключитьОбработчикОбновленияСодержимогоРедактора;

&НаКлиенте
Перем мОтключитьОбработчикОбновленияТекущегоЭлементаРедактора;

&НаКлиенте
Перем мДеревоМетаданных;

&НаКлиенте
Перем мПрефикс;

&НаКлиенте
Перем мДанныеТекущегоЭлемента;

&НаКлиенте
Перем мВариантыТипов;

&НаКлиенте
Перем мСобытиеПриИзмененииСодержимогоРедактора;
&НаКлиенте
Перем мСобытиеПриИзмененииТекущегоЭлементаРедактора;

#КонецОбласти
 
#Область ПрограммныйИнтерфейс

&НаКлиенте
Функция ПолучитьТекстРедактора() Экспорт
	Возврат АПИ_ПолучитьТекст();
КонецФункции

&НаКлиенте
Процедура УстановитьТекстРедактора(Знач Значение, ОбновлятьГруппу = Истина, УстанавливатьМодифицированность = Истина) Экспорт    
	КодСимволаАбзац = Символ(182);
	Значение = СтрЗаменить(Значение, КодСимволаАбзац, Символы.ПС); 
	Если НЕ УстанавливатьМодифицированность Тогда
		мОтключитьОбработчикОбновленияСодержимогоРедактора = Истина;
	КонецЕсли;
	
	
	АПИ_УстановитьТекст(Значение);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСФормы(Форма) Экспорт  
	ЗаполнениеСФормы().Заполнить(Форма, мСемантическоеДерево);

	ПараметрыПередачи = АПИ_ПолучитьПараметрыПередачиЭлемента(
		мСемантическоеДерево, 
		Новый Массив,
		Ложь);
	
	АПИ_СоздатьОбновитьЭлемент(ПараметрыПередачи);
КонецПроцедуры

&НаКлиенте
Функция СоздатьНовуюКолонкуТаблицы() Экспорт
	Возврат АПИ_ПолучитьНовоеЗначение("КолонкаТаблицы");
КонецФункции

&НаКлиенте
Функция ПолучитьНовоеЗначение(Тип) Экспорт
	Возврат АПИ_ПолучитьНовоеЗначение(Тип);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СведенияОВнешнейОбработке = ОбработкаОбъект.СведенияОВнешнейОбработке();	
	
	Версия = СведенияОВнешнейОбработке.Версия;
	ЭтотОбъект.ТекущаяВерсия = Версия;
	
	Элементы.ДекорацияОднострочнаяГруппа.Заголовок = Элементы.ДекорацияОднострочнаяГруппа.Заголовок + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"); 
	
	ЭтаФорма.ИдентификаторОбработки = ОбработкаОбъект.Метаданные().ПолноеИмя();
	
	Элементы.ПалитраСвойств.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Отбор", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мМодули = Новый Структура;
	
	мВариантыТипов = Новый Соответствие;
	
	ИнициализироватьМодули( 
		"УправлениеСвойствами
		|ПостроительСхемФормы
		|СлужебныеФункции
		|БиблиотекаJS");

	Если НЕ НеПроверятьОбновления Тогда
		Таймаут = 0.1;
		ПодключитьОбработчикОжидания("ПроверитьАктуальнуюВерсию", Таймаут, Истина);
	КонецЕсли;
	
	ЭтотОбъект.ПоказыватьСправку = Истина;
	
	УстановитьВидимостьДоступностьЭлементов();    

	УправлениеСвойствами().ЗаполнитьВсеСвойстваДляПалитры(ПалитраСвойств);
	
	мОтключитьОбработчикОбновленияСодержимогоРедактора = Ложь;
	мОтключитьОбработчикОбновленияТекущегоЭлементаРедактора = Ложь;
	ОбновитьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Элементы.ПолеHTMLРедактора.Документ.location.href="about:blank";
	ПолеHTMLРедактора = "";


	//Если Модифицированность И Не ЗавершениеРаботы Тогда
	//
	//	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Ваша форма не сохранена, сохранить?'"), РежимДиалогаВопрос.ДаНет);
	//	Если Ответ = КодВозвратаДиалога.Да Тогда
	//		ВыполнитьСохранениеФайла();
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ГруппаКнопки

&НаКлиенте
Процедура ПоказатьСкрытьПроект(Команда)
	Если ПоказыватьГруппуЛево = "Проект" Тогда
		ПоказыватьГруппуЛево = "";
	Иначе 
		ПоказыватьГруппуЛево = "Проект";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьЧатИИ(Команда)
	Если ПоказыватьГруппуЛево = "ЧатИИ" Тогда
		ПоказыватьГруппуЛево = "";
	Иначе 
		ПоказыватьГруппуЛево = "ЧатИИ";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПодменюЭкспорт(Команда)  
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("ГенераторXML", "Выгрузить в конфигурацию");
	СписокВыбора.Добавить("ГенераторКода", "Программное создание реквизитов");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПодменюЭкспортЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещенияОЗавершении, СписокВыбора,  Элементы.ПодменюЭкспорт);
КонецПроцедуры    

&НаКлиенте
Процедура ПодменюЭкспортЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ГенераторКода" Тогда
		 ОткрытьГенераторКода();
		 Возврат;
	 КонецЕсли;
	 
	Если ВыбранныйЭлемент.Значение = "ГенераторXML" Тогда
		 ОткрытьГенераторXML();
		 Возврат;
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	Настройки = Новый Структура;
	
	ПоляНастроек = "НеПроверятьОбновления,ТокенИИ,МодельИИ,ПровайдерИИ";
	МассивНастроек = СтрРазделить(ПоляНастроек, ",");
	Для Каждого ИмяНастройки Из МассивНастроек Цикл
		Настройки.Вставить(ИмяНастройки, ЭтаФорма[ИмяНастройки]);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Настройки", Настройки);
	ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаНастройка", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из РезультатЗакрытия Цикл
		ЭтаФорма[КлючЗначение.Ключ] = КлючЗначение.Значение;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область КоманднаяПанельРедактора

&НаКлиенте
Процедура ПостроитьФорму(Команда)   
	ДанныеГенератора = ПолучитьДанныеДляГенерацииФормы(мПрефикс);
	Если ДанныеГенератора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Построить(ДанныеГенератора);
	
	ЗаголовокФормы = ДанныеГенератора.ЗаголовокФормы;
	Если ПустаяСтрока(ЗаголовокФормы) Тогда
		ЗаголовокФормы = "<Без заголовка>";
	КонецЕсли;
	
	ЭтотОбъект.ПоказыватьСправку = Ложь;
	
	УстановитьВидимостьДоступностьЭлементов();
	
	ЭтотОбъект.ЗаголовокФормы = ЗаголовокФормы;      
	
	Попытка
		ДеревоЭлементов.ПолучитьЭлементы().Очистить();     
		ЗаполнитьДеревоЭлементов(мСемантическоеДерево.Элементы, ДеревоЭлементов.ПолучитьЭлементы());
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при построении формы: %1", ОписаниеОшибки());
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПостроитьФормуВОтдельномОкне(Команда)    
	ДанныеГенератора = ПолучитьДанныеДляГенерацииФормы();
	Если ДанныеГенератора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаПросмотр = ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаПросмотр", , ЭтаФорма);
	ФормаПросмотр.Построить(ДанныеГенератора);
КонецПроцедуры

&НаКлиенте
Процедура Форматировать(Команда)  
	АПИ_Форматировать();

	ЭтотОбъект.ТекущийЭлемент = Элементы.ПолеHTMLРедактора;
	
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКартинкиЗавершение", ЭтотОбъект);
						 
	ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаВыбораКартинки", , ЭтаФорма, , , , ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборКартинкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АПИ_ВставитьТекстВПозицию("@" + РезультатЗакрытия);  
	
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РедакторТаблицы(Команда)
	ДанныеТаблицы = АПИ_ПолучитьТаблицу();
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОписаниеТаблицы", ДанныеТаблицы.Элемент);   

	ДополнительныеПараметры = Новый Структура("Путь,ЭтоНовый", ДанныеТаблицы.Путь, ДанныеТаблицы.ЭтоНовый);
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеТаблицыЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаРедактированияТаблицы", ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеТаблицыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;           
	
	ПараметрыПередачи = АПИ_ПолучитьПараметрыПередачиЭлемента(
		РезультатЗакрытия, 
		ДополнительныеПараметры.Путь,
		ДополнительныеПараметры.ЭтоНовый);
	
	АПИ_СоздатьОбновитьЭлемент(ПараметрыПередачи);       
	
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)  
	ЗаполнитьСФормы(ЭтотОбъект);
	
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ЧатИИ

&НаКлиенте
Процедура ОтправитьИИ(Команда)
	Если ПустаяСтрока(ЗапросИИ) Тогда
		Возврат;
	КонецЕсли;
	
	ОжиданиеОтветаИИ = Истина;
	
	Элементы.ГруппаЗапросИИ.Доступность = НЕ ОжиданиеОтветаИИ;

	ПодключитьОбработчикОжидания("ОтправитьИИЗавершение", 1, Истина);
КонецПроцедуры      

&НаКлиенте
Процедура ОтправитьИИЗавершение()
	ОжиданиеОтветаИИ = Ложь;

	Элементы.ГруппаЗапросИИ.Доступность = НЕ ОжиданиеОтветаИИ;
	
	Контекст = Новый Массив;
	Для Каждого Строка Из ЧатИИ Цикл
		Контекст.Добавить(Новый Структура("ЭтоВходящее,Сообщение", Строка.Входящее, Строка.Сообщение));
	КонецЦикла;
	
	Настройки = РаботаСИИ().ПолучитьНастройки();
	Настройки.ПровайдерИИ = ПровайдерИИ;
	Настройки.МодельИИ = МодельИИ;
	Настройки.ТокенИИ = ТокенИИ;
	
	Ответ = РаботаСИИ().Отправить(ЗапросИИ, Контекст, Настройки);
	
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Не удалось получить ответ!";
	КонецЕсли;

	СтрокаЧата = ЧатИИ.Добавить();
	СтрокаЧата.Сообщение = ЗапросИИ;
	ЗапросИИ = "";   
	
	СтрокаЧата = ЧатИИ.Добавить();
	СтрокаЧата.Сообщение = Ответ;
	СтрокаЧата.Входящее = Истина;
	
	Элементы.ЧатИИ.ТекущаяСтрока = СтрокаЧата.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИИ(Команда)
	ЧатИИ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьИИ(Команда)
	ТекущаяСтрока = Элементы.ЧатИИ.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ТекущаяСтрока.Входящее Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Сообщение = Редактор;
КонецПроцедуры

#КонецОбласти 

#Область Подвал

&НаКлиенте
Процедура ПоказатьСкрытьПодвал(Команда)   
	ПоказыватьПодвал = НЕ ПоказыватьПодвал;
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьВсеСвойства(Команда)
	ЭтотОбъект.ПоказыватьВсеСвойства = Не ЭтотОбъект.ПоказыватьВсеСвойства;
	ОбновитьОтборПалитрыСвойств();	
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область Обозреватель

&НаКлиенте
Процедура СохранитьФайл(Команда)

	ВыполнитьСохранениеФайла();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура НовыйФайл(Команда)
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Ответ = Ждать ВопросАсинх(
			НСтр("ru = 'Файл не сохранен, сохранить?'"), 
			Режим, 
			30, 
			КодВозвратаДиалога.Да, 
			"Сохранение файла", 
			КодВозвратаДиалога.Отмена);
			
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ВыполнитьСохранениеФайла();
		КонецЕсли;  
	КонецЕсли;
	
	Модифицированность = Ложь;    
	УстановитьТекстРедактора("",, Ложь);
	УстановитьТекущийФайл(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область Просмотр

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	ЭтотОбъект.ПоказыватьСправку = Истина;
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументацию(Команда)
	ПерейтиПоНавигационнойСсылке("https://crimsongoldteam.github.io/md_design");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТелеграмКанал(Команда)
	ПерейтиПоНавигационнойСсылке("https://t.me/overlay1c");
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьТелеграмЧат(Команда)
	ПерейтиПоНавигационнойСсылке("https://t.me/+dq7AG3MMofU0YWUy");
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура КомандаЗаглушка(Команда)
	// Ничего не делаем
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоваяВерсияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке("https://github.com/crimsongoldteam/md_design/releases");
КонецПроцедуры

&НаКлиенте
Процедура РедакторПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ВходящиеПараметры = АПИ_ПолучитьПараметрыСобытия(ДанныеСобытия);
	
	Если ВходящиеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВходящиеПараметры.ВидСобытия = мСобытиеПриИзмененииСодержимогоРедактора Тогда
		Если мОтключитьОбработчикОбновленияСодержимогоРедактора Тогда
			мОтключитьОбработчикОбновленияСодержимогоРедактора = Ложь;
			Возврат;
		КонецЕсли;      
		
		УстановитьМодфицированность = НЕ мОтключитьОбработчикОбновленияСодержимогоРедактора И Редактор <> ВходящиеПараметры.Текст;
		Редактор = ВходящиеПараметры.Текст;        
		
		мСемантическоеДерево = ВходящиеПараметры.СемантическоеДерево;

		Если УстановитьМодфицированность Тогда
			УстановитьМодифицированность();
		КонецЕсли;  
		
		Возврат;
	КонецЕсли;

	Если ВходящиеПараметры.ВидСобытия = мСобытиеПриИзмененииТекущегоЭлементаРедактора Тогда
		Если мОтключитьОбработчикОбновленияТекущегоЭлементаРедактора Тогда
			мОтключитьОбработчикОбновленияТекущегоЭлементаРедактора = Ложь;
			Возврат;
		КонецЕсли;
		
		ОтключитьОбработчикОжидания("ИзменениеПозицииКурсораЗавершение");
		
		мДанныеТекущегоЭлемента = ВходящиеПараметры.Элемент;

		Таймаут = 0.1;
		ПодключитьОбработчикОжидания("ИзменениеПозицииКурсораЗавершение", Таймаут, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПозицииКурсораЗавершение()
	ОбновитьОтборПалитрыСвойств();

	Если мДанныеТекущегоЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	НаборСвойств = мДанныеТекущегоЭлемента.Элемент.НаборСвойств;
	
	Для Каждого СтрокаТаблица Из ПалитраСвойств Цикл
		Если НЕ СтрокаТаблица.Отбор Тогда
			Продолжить;
		КонецЕсли;
		
		Если НаборСвойств.Свойство(СтрокаТаблица.ИмяПоля) Тогда 
			Если СтрокаТаблица.Категория = "Цвет" Тогда
				СтрокаТаблица["Значение" + СтрокаТаблица.Категория] = WebЦвета[НаборСвойств[СтрокаТаблица.ИмяПоля]];
			ИначеЕсли СтрокаТаблица.Категория = "СписокЗначений" Тогда
				СтрокаТаблица["Значение" + СтрокаТаблица.Категория].ЗагрузитьЗначения(НаборСвойств[СтрокаТаблица.ИмяПоля]);
			Иначе
				СтрокаТаблица["Значение" + СтрокаТаблица.Категория] = НаборСвойств[СтрокаТаблица.ИмяПоля];
			КонецЕсли;
			
			СтрокаТаблица.Изменено = Истина;  
			
		//ИначеЕсли СтрокаТаблица.ИмяПоля = "Тип" И мТекущийЭлемент.Тип = "ПолеВвода" Тогда
		//	ПредставлениеТипа = Форматтер().ФорматироватьОписаниеТипов(мТекущийЭлемент.ОписаниеТипов);
		//	СтрокаТаблица["Значение" + СтрокаТаблица.Категория] = ПредставлениеТипа;
		Иначе
			СтрокаТаблица["Значение" + СтрокаТаблица.Категория] = СтрокаТаблица.ЗначениеПоУмолчанию;
			СтрокаТаблица.Изменено = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РедакторДокументСформирован(Элемент)
	КонтекстДокументаHTML = Элемент.Документ;
	
	мКонтекстОкнаРедактораHTML = КонтекстДокументаHTML.parentWindow;
	Если мКонтекстОкнаРедактораHTML = Неопределено Тогда
		мКонтекстОкнаРедактораHTML = КонтекстДокументаHTML.defaultView;	
	КонецЕсли;	
	
	УстановитьТекстРедактора(Редактор);  
	Элементы.ПолеHTMLРедактора.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПримерНажатие(Элемент)
	МассивСтрок = Новый Массив;
	Если НЕ ПустаяСтрока(Редактор) Тогда
		МассивСтрок.Добавить(Редактор);	
	КонецЕсли;
	МассивСтрок.Добавить(Элемент.Заголовок);
	
	УстановитьТекстРедактора(СтрСоединить(МассивСтрок, Символы.ПС + Символы.ПС));
КонецПроцедуры

&НаКлиенте
Процедура СтраницыЛевоПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ЭтотОбъект.ПоказыватьГруппуЛево = Сред(ТекущаяСтраница.Имя, СтрДлина("Страница") + 1);
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПапкеСФайламиПриИзменении(Элемент)
	ОбновитьДеревоФайлов();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКПапкеСФайламиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Каталог = ПутьКПапкеСФайлами;
	ВыбранныеФайлы = Ждать ДиалогОткрытияФайла.ВыбратьАсинх();
	Если Не ВыбранныеФайлы = Неопределено Тогда
		ПутьКПапкеСФайлами = ВыбранныеФайлы[0];
		ОбновитьДеревоФайлов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиФайла(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьДеревоФайлов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЧатИИ

&НаКлиенте
Процедура ЧатИИВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.ЧатИИ.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ТекущаяСтрока.Входящее Тогда
		Возврат;
	КонецЕсли;
	
	Текст = ТекущаяСтрока.Сообщение;
	УстановитьТекстРедактора(Текст);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаГруппы

&НаКлиенте
Процедура ТаблицаГруппыПриАктивизацииСтроки(Элемент)
	мТекущаяСтрокаГруппы = Элементы.ТаблицаГруппы.ТекущиеДанные;

	УстановитьТекстРедактора(мТекущаяСтрокаГруппы.Текст, Ложь, Ложь);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыПалитраСвойств

&НаКлиенте
Процедура ПалитраСвойствПриАктивизацииСтроки(Элемент)
	Если мДанныеТекущегоЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;                
	
	АктивныйЭлемент = мДанныеТекущегоЭлемента.Элемент;
	
	ТекущаяСтрока = Элементы.ПалитраСвойств.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Категория = "СписокЗначений" Тогда
    	ТекущаяСтрока.ЗначениеСписокЗначений.ТипЗначения = Новый ОписаниеТипов("Строка");
		Возврат;
	КонецЕсли;
	
	Элементы.ПалитраСвойствЗначениеСтрока.КнопкаВыпадающегоСписка = Неопределено;
	Если ТекущаяСтрока.ИмяПоля = "Тип" Тогда
		Элементы.ПалитраСвойствЗначениеСтрока.КнопкаВыпадающегоСписка = Истина;
		Возврат;
	КонецЕсли;
	
	СписокСвойств = УправлениеСвойствами().ПолучитьСписокСвойствПоТипу(
		АктивныйЭлемент.ТипЭлемента, 
		АктивныйЭлемент.ВидЭлемента, 
		ТекущаяСтрока.ИмяПоля);

	Элементы.ПалитраСвойствЗначениеСписок.СписокВыбора.Очистить();
	Для Каждого КлючЗначение Из СписокСвойств Цикл
		Элементы.ПалитраСвойствЗначениеСписок.СписокВыбора.Добавить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если мДанныеТекущегоЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборСвойств = мДанныеТекущегоЭлемента.Элемент.НаборСвойств;
	
	Если НЕ НаборСвойств.Свойство("Заголовок") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ПалитраСвойств.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущаяСтрока.ИмяПоля <> "Тип" Тогда
		Возврат;
	КонецЕсли;
	
	//Варианты = ПолучитьВарианты(НаборСвойств.Заголовок);
	ДанныеВыбора = Новый СписокЗначений;  
	
	//Сч = 0;
	//Для Каждого Вариант Из Варианты.Существующие Цикл
	//	Картинка = ?(СтрНачинаетсяС(Вариант, "Справочник"), БиблиотекаКартинок.Справочник, БиблиотекаКартинок.Перечисление);
	//	
	//	ДанныеВыбора.Добавить(Вариант, , , Картинка);
	//	Сч = Сч + 1;
	//	Если Сч > 5 Тогда
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Сч = 0;
	//Для Каждого Вариант Из Варианты.Новые Цикл
	//	ТекВариант = Вариант;   
	//	
	//	Если НаборСвойств.Свойство("СписокВыбора") Тогда
	//		ТекВариант = "ПеречислениеСсылка." + Вариант;   
	//	Иначе
	//		ТекВариант = "СправочникСсылка." + Вариант;   
	//	КонецЕсли;
	//	
	//	ДанныеВыбора.Добавить(ТекВариант,,, БиблиотекаКартинок.СоздатьЭлементСписка);
	//	Сч = Сч + 1;
	//	Если Сч > 3 Тогда
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеСписокПриИзменении(Элемент)
	ИзменитьЗначениеСвойстваПалитры();
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеБулевоПриИзменении(Элемент)
	ИзменитьЗначениеСвойстваПалитры();
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеЧислоПриИзменении(Элемент)
	ИзменитьЗначениеСвойстваПалитры();
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеСтрокаПриИзменении(Элемент)
	ИзменитьЗначениеСвойстваПалитры();
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеСписокЗначенийПриИзменении(Элемент)
	ИзменитьЗначениеСвойстваПалитры();
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.ПалитраСвойств.ТекущиеДанные;
	
	Если ТекущаяСтрока.Категория = "Булево" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока.ЗначениеБулево = НЕ ТекущаяСтрока.ЗначениеБулево;
		ИзменитьЗначениеСвойстваПалитры();
		Возврат;
	КонецЕсли;  
	
	Если ТекущаяСтрока.Категория = "Цвет" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВыбораЦвета();
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраСвойствЗначениеЦветНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;                                       
	
	ОткрытьФормуВыбораЦвета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДеревоФайлов

&НаКлиенте
Асинх Процедура ДеревоФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяСтрока = ДеревоФайлов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущаяСтрока.ЭтоПапка Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Файл не сохранен, сохранить?'"), Режим, , КодВозвратаДиалога.Да, "Сохранение файла");
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ВыполнитьСохранениеФайла();
		КонецЕсли;  
	КонецЕсли;                                      
	
	Модифицированность = Ложь;

	УстановитьТекущийФайл(ТекущаяСтрока.ПолныйПуть);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Ждать ТекстовыйДокумент.ПрочитатьАсинх(мПутьКФайлу, "UTF-8");
	УстановитьТекстРедактора(ТекстовыйДокумент.ПолучитьТекст(), , Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область Модули

&НаКлиенте
Функция ПостроительСхемФормы() Экспорт
	Возврат ПолучитьМодуль("ПостроительСхемФормы");
КонецФункции     

&НаКлиенте
Функция ГенераторКода() Экспорт
	Возврат ПолучитьМодуль("ГенераторКода");
КонецФункции     

&НаКлиенте
Функция РаботаСИИ() Экспорт
	Возврат ПолучитьМодуль("РаботаСИИ");
КонецФункции  

&НаКлиенте
Функция ПолучитьМодуль(ИмяМодуля)
	ФормаМодуля = Неопределено;
	
	Если НЕ мМодули.Свойство(ИмяМодуля, ФормаМодуля) Тогда
		ФормаМодуля = ИнициализироватьМодуль(ИмяМодуля); 
		мМодули.Вставить(ИмяМодуля, ФормаМодуля);
	КонецЕсли;
	Возврат ФормаМодуля;
КонецФункции

&НаКлиенте
Функция УправлениеСвойствами() Экспорт
	Возврат ПолучитьМодуль("УправлениеСвойствами");
КонецФункции   

&НаКлиенте
Функция СлужебныеФункции() Экспорт
	Возврат ПолучитьМодуль("СлужебныеФункции");
КонецФункции 

&НаКлиенте
Функция ЗаполнениеСФормы()
	Возврат ПолучитьМодуль("ЗаполнениеСФормы");
КонецФункции 

&НаКлиенте
Процедура ИнициализироватьМодули(ИменаМодулей)
	
	МассивМодулей = СтрРазделить(ИменаМодулей, Символы.ПС);
	Для Каждого Модуль Из МассивМодулей Цикл
		ИнициализироватьМодуль(Модуль);
	КонецЦикла;  
		
	мМодули.УправлениеСвойствами.Инициализировать();
	мМодули.БиблиотекаJS.Инициализировать(ЭтотОбъект, "ПолеHTMLРедактора", ТекущаяВерсия);
КонецПроцедуры

&НаКлиенте
Функция ИнициализироватьМодуль(ИмяМодуля)
	ТекИмя = СтрШаблон("%1.Форма.%2", ИдентификаторОбработки, ИмяМодуля);
	
	// BSLLS:GetFormMethod-off 
	Результат = ПолучитьФорму(ТекИмя, , ЭтотОбъект);
	// BSLLS:GetFormMethod-on
	мМодули.Вставить(ИмяМодуля, Результат);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ПалитраСвойств

&НаКлиенте
Процедура ОбновитьОтборПалитрыСвойств()   
	Для Каждого СтрокаТаблица Из ПалитраСвойств Цикл
		СтрокаТаблица.Отбор = 
			мДанныеТекущегоЭлемента <> Неопределено И
			(мДанныеТекущегоЭлемента.Элемент.ТипЭлемента = СтрокаТаблица.ТипЭлемента) И 
			(мДанныеТекущегоЭлемента.Элемент.ВидЭлемента = СтрокаТаблица.ВидЭлемента) И 
			(ЭтотОбъект.ПоказыватьВсеСвойства ИЛИ СтрокаТаблица.Основное);
	КонецЦикла;
	
	Элементы.ПалитраСвойств.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Отбор", Истина));
КонецПроцедуры

#КонецОбласти
 
#Область ОбозревательФайлов

&НаКлиенте
Асинх Процедура ВыполнитьСохранениеФайла()

	Если Не ПустаяСтрока(мПутьКФайлу) Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Редактор);
		ТекстовыйДокумент.НачатьЗапись(, мПутьКФайлу, "UTF-8");
	Иначе
		Режим = РежимДиалогаВыбораФайла.Сохранение;
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогСохраненияФайла.Фильтр = "Файл Накидки (*.txt)|*.txt";
		ДиалогСохраненияФайла.Расширение = РасширениеФайлаНакидка();
		ВыбранныеФайлы = Ждать ДиалогСохраненияФайла.ВыбратьАсинх();
		Если Не ВыбранныеФайлы = Неопределено Тогда
			ПослеЗаписиФайла = Новый ОписаниеОповещения("ПослеЗаписиФайла", ЭтотОбъект);
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(Редактор);
			ТекстовыйДокумент.НачатьЗапись(ПослеЗаписиФайла, ВыбранныеФайлы[0], "UTF-8");
			УстановитьТекущийФайл(ВыбранныеФайлы[0]);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.Модифицированность = Ложь;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьГенераторКода()
	УправлениеСвойствами().ЗаполнитьНеизвестныеСвойства(мСемантическоеДерево);
	
	ПараметрыВыполнения = ПостроительСхемФормы().СоздатьПараметрыВыполнения();
	ДанныеГенератора = ПостроительСхемФормы().Получить(мСемантическоеДерево, ПараметрыВыполнения);

	ФормаПросмотр = ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаКода", , ЭтаФорма);
	
	ФормаПросмотр.Результат = ГенераторКода().Получить(ДанныеГенератора);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГенераторXML()
	УправлениеСвойствами().ЗаполнитьНеизвестныеСвойства(мСемантическоеДерево);

	ПараметрыВыполнения = ПостроительСхемФормы().СоздатьПараметрыВыполнения();
    ПараметрыВыполнения.ДеревоМетаданных = ПолучитьДеревоКонфигурацииНаСервере();
	
	ДанныеГенератора = ПостроительСхемФормы().Получить(мСемантическоеДерево, ПараметрыВыполнения);

	СхемыФормы = Новый Структура("СхемаЭлементы, СхемаРеквизиты, СхемаМетаданные", ДанныеГенератора.Элементы[0], ДанныеГенератора.Реквизиты, ДанныеГенератора.Метаданные);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СхемыФормы", СхемыФормы);
	
	СлужебныеФункции().СтруктураВJSON(ПараметрыОткрытия);
	
	ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаГенераторXML", ПараметрыОткрытия, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗначениеСвойстваПалитры()
	Если мДанныеТекущегоЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ПалитраСвойств.ТекущиеДанные;

	ТекущееЗначение = ТекущаяСтрока["Значение" + ТекущаяСтрока.Категория];
	
	НаборСвойств = мДанныеТекущегоЭлемента.Элемент.НаборСвойств;
	
	
	//Если ТекущаяСтрока.Категория = "СписокЗначений" Тогда
	//	ТекущаяСтрока.Изменено = Истина;     
	//	МассивЗначений = ТекущаяСтрока.ЗначениеСписокЗначений.ВыгрузитьЗначения();
	//	Если МассивЗначений.Количество() > 0 Тогда
	//		мТекущийЭлемент.НаборСвойств.Вставить(ТекущаяСтрока.ИмяПоля, МассивЗначений);
	//	Иначе
	//		мТекущийЭлемент.НаборСвойств.Удалить(ТекущаяСтрока.ИмяПоля);
	//		ТекущаяСтрока.Изменено = Ложь;     
	//	КонецЕсли;
		
	Если ТекущееЗначение <> ТекущаяСтрока.ЗначениеПоУмолчанию Тогда
		ТекущаяСтрока.Изменено = Истина;     
		//Если ТекущаяСтрока.Категория = "Строка" И ТекущаяСтрока.ИмяПоля = "Тип" Тогда
		//	ОписаниеТипов = Парсер().ПолучитьОписаниеТипов();
		//Парсер().ПарсингНабораСвойств(Новый Структура, Парсер().НовыйТекст("{Тип = " + ТекущаяСтрока.ЗначениеСтрока + "}", 0, 0), ОписаниеТипов);
		//	мТекущийЭлемент.ОписаниеТипов = ОписаниеТипов;
		Если ТекущаяСтрока.Категория = "Цвет" Тогда
			НаборСвойств.Вставить(ТекущаяСтрока.ИмяПоля, ТекущаяСтрока.ЗначениеСтрока);
		Иначе
			НаборСвойств.Вставить(ТекущаяСтрока.ИмяПоля, ТекущееЗначение);
		КонецЕсли;
		
	Иначе
		ТекущаяСтрока.Изменено = Ложь;
		НаборСвойств.Удалить(ТекущаяСтрока.ИмяПоля);
	КонецЕсли;
	
	мОтключитьОбработчикОбновленияТекущегоЭлементаРедактора = Истина;
	
	УстановитьСвойства();     
КонецПроцедуры      

&НаКлиенте
Процедура УстановитьСвойства()  
	АПИ_СоздатьОбновитьЭлемент(мДанныеТекущегоЭлемента);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеДляГенерацииФормы(Префикс = "")
	УправлениеСвойствами().ЗаполнитьНеизвестныеСвойства(мСемантическоеДерево);
	
	ПараметрыВыполнения = ПостроительСхемФормы().СоздатьПараметрыВыполнения();
	ПараметрыВыполнения.Префикс = Префикс;
	ДанныеГенератора = ПостроительСхемФормы().Получить(мСемантическоеДерево, ПараметрыВыполнения);
	Возврат ДанныеГенератора;
КонецФункции

&НаКлиенте
Процедура ДобавитьВставитьЭлемент(ПараметрыДобавления, НовыйЭлемент) 
	РодительЭлементы = ПараметрыДобавления.Родитель.Элементы;
	
	Если ЗначениеЗаполнено(ПараметрыДобавления.Перед) Тогда
		ИндексЭлемента =  РодительЭлементы.Найти(ПараметрыДобавления.Перед);
		РодительЭлементы.Вставить(ИндексЭлемента, НовыйЭлемент);
		Возврат;
	КонецЕсли;
	
	РодительЭлементы.Добавить(НовыйЭлемент);	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьВнешнийПарсинг(Знач Текст) Экспорт
	Результат = мКонтекстОкнаРедактораHTML.parseInputInner(Текст); 
	
	Если СтрНачинаетсяС(Результат, "Ошибка:") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Результат;
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неизвестная ошибка парсинга!";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатСтруктура = СлужебныеФункции().JSONВСтруктуру(Результат);
	Возврат РезультатСтруктура;
КонецФункции

&НаКлиенте
Функция ПолучитьИдентификаторОбработки() Экспорт
	Возврат ИдентификаторОбработки;
КонецФункции

&НаКлиенте
Функция ЗначениеВМассиве(Знач Значение)
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Построить(ДанныеГенератора) Экспорт
	ПостроитьНаСервере(ДанныеГенератора);
КонецПроцедуры

&НаСервере
Процедура ПостроитьНаСервере(Знач ДанныеГенератора) Экспорт
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПостроитьНаСервере(
		ЭтотОбъект, 
		Элементы.ГруппаПросмотр, 
		ДанныеГенератора);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктуальнуюВерсию()
	АктуальнаяВерсия = ПолучитьАктуальнуюВерсию(); 
	
	Если АктуальнаяВерсия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СравнитьВерсии(АктуальнаяВерсия, ТекущаяВерсия) Тогда
		Возврат;
	КонецЕсли;

	ЭтотОбъект.НоваяВерсия = СтрШаблон("Доступна новая версия: %1", АктуальнаяВерсия);
КонецПроцедуры

&НаКлиенте
Функция СравнитьВерсии(АктуальнаяВерсия, ТекущаяВерсия)
	МассивАктуальнаяВерсия = СтрРазделить(АктуальнаяВерсия, ".");
	МассивТекущаяВерсия = СтрРазделить(ТекущаяВерсия, ".");
	Индекс = 0;
	Пока Индекс <= 2 Цикл
		НомерАктуальная = Число(МассивАктуальнаяВерсия[Индекс]);
		НомерТекущая = Число(МассивТекущаяВерсия[Индекс]);
		Если НомерТекущая > НомерАктуальная Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НомерТекущая < НомерАктуальная Тогда
			Возврат Истина;
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ПолучитьАктуальнуюВерсию()
	URL = "repos/crimsongoldteam/md_design/releases";
	
	Попытка
	    Запрос = Новый HTTPЗапрос(URL);
		Таймаут = 30;
		КодВозвратаУспех = 200;
		Соединение = Новый HTTPСоединение("api.github.com", , , , , Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		Результат = Соединение.Получить(Запрос);     
		
		Если Результат.КодСостояния <> КодВозвратаУспех Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Тело = Результат.ПолучитьТелоКакСтроку();
		Результат = СлужебныеФункции().JSONВСоответствие(Тело);
		Если Результат.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли; 
		Версия = Сред(Результат[0]["tag_name"], 2);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Возврат Версия;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()

	УстановитьВидимостьДоступностьПодвала();
	 УстановитьВидимостьГруппыЛево();
	
	Элементы.ГруппаСправка.Видимость = ПоказыватьСправку;
	Элементы.ГруппаПросмотр.Видимость = НЕ ПоказыватьСправку;
	Элементы.ПоказатьСправку.Видимость = НЕ ПоказыватьСправку;
	Элементы.Заполнить.Видимость = НЕ ПоказыватьСправку;
	Элементы.ЗаголовокФормы.Видимость = НЕ ПоказыватьСправку;  

	Элементы.ПоказатьСкрытьВсеСвойства.Пометка = ПоказыватьВсеСвойства;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьПодвала()
	Элементы.ПоказатьСкрытьПодвал.Пометка = ПоказыватьПодвал;
	Элементы.ПалитраСвойств.Видимость = ПоказыватьПодвал;
	Элементы.ПоказатьСкрытьВсеСвойства.Видимость = ПоказыватьПодвал;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГруппыЛево()
	Элементы.ПоказатьСкрытьПроект.Пометка = ПоказыватьГруппуЛево = "Проект";
	Элементы.ПоказатьСкрытьЧатИИ.Пометка = ПоказыватьГруппуЛево = "ЧатИИ";
	
	Элементы.ГруппаЛево.Видимость = ПоказыватьГруппуЛево <> ""; 
	
	Если ПоказыватьГруппуЛево <> "" Тогда
		Элементы.СтраницыЛево.ТекущаяСтраница = Элементы["Страница" + ПоказыватьГруппуЛево];
	КонецЕсли;
	
	Элементы.ПостроитьФорму.КнопкаПоУмолчанию = ПоказыватьГруппуЛево <> "ЧатИИ";
	Элементы.ОтправитьИИ.КнопкаПоУмолчанию = ПоказыватьГруппуЛево = "ЧатИИ";
КонецПроцедуры

&НаКлиенте
Функция ЛевоеИмяГруппыККнопке()

	Результат = Новый Соответствие();
	Результат.Вставить("ГруппаИИ", "РедакторИИ");
	Результат.Вставить("ГруппаДеревоФайлов", "ПоказатьДеревоФайлов");
	Результат.Вставить("ГруппаДеревоЭлементов", "ПоказатьДеревоЭлементов");
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДеревоФайлов()
	
	ДеревоФайлов.ПолучитьЭлементы().Очистить();
	
	ПутьКПапкеСФайлами = СокрЛП(ПутьКПапкеСФайлами);
	Если ЭтоLinux Тогда
		ПутьКПапкеСФайлами = СтрЗаменить(ПутьКПапкеСФайлами, "\", "/");
	Иначе	
		ПутьКПапкеСФайлами = СтрЗаменить(ПутьКПапкеСФайлами, "/", "\");
	КонецЕсли;
	
	ПервыеДваСимвола = Лев(ПутьКПапкеСФайлами, 2);
	ВтораяЧасть = Сред(ПутьКПапкеСФайлами, 3);
	Пока СтрНайти(ВтораяЧасть, "\\") > 0 Цикл
		ВтораяЧасть = СтрЗаменить(ВтораяЧасть, "\\", "\");
	КонецЦикла;	 
	Пока СтрНайти(ВтораяЧасть, "//") > 0 Цикл
		ВтораяЧасть = СтрЗаменить(ВтораяЧасть, "//", "/");
	КонецЦикла;	 
	
	ПутьКПапкеСФайлами = ПервыеДваСимвола + ВтораяЧасть;
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДеревоФайловОбработчикНачатьПоискФайлов", 
		ЭтаФорма, ДополнительныеПараметры);
	НачатьПоискФайлов(ОписаниеОповещения, ПутьКПапкеСФайлами, СтрШаблон("*.%1", РасширениеФайлаНакидка()), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоФайловОбработчикНачатьПоискФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	СтруктураКартинок = СтруктураКартинокДляДереваФайлов();
	Каталоги = Новый Соответствие;
	СписокКаталогов = Новый СписокЗначений;
	СписокФайлов = Новый СписокЗначений;
	БазовыйПуть = УниверсальноеПолноеИмяФайла(ДополнитьСлешВПуть(ПутьКПапкеСФайлами));
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		СписокФайлов.Добавить(ТекФайл, ТекФайл.ПолноеИмя);
		Путь = УниверсальноеПолноеИмяФайла(ТекФайл.Путь);
		Поз = СтрНайти(Путь, БазовыйПуть);
		ОтносительныйПуть = Сред(Путь, Поз + СтрДлина(БазовыйПуть));
		Если Прав(ОтносительныйПуть, 1) = "/" Тогда
			ОтносительныйПуть = Лев(ОтносительныйПуть, СтрДлина(ОтносительныйПуть) - 1);
		КонецЕсли;
		
		Если СтрНайти(ОтносительныйПуть, "/") > 0 Тогда
			МассивСтрок = СтрРазделить(ОтносительныйПуть, "/");
			Стр = "";
			Для Каждого Элем Из МассивСтрок Цикл
				Если НЕ ПустаяСтрока(Стр) Тогда
					Стр = Стр + "/";
				КонецЕсли;
				Стр = Стр + Элем; 
				
				Если НЕ ПустаяСтрока(Стр) Тогда
					Каталоги.Вставить(Стр, Истина);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ОтносительныйПуть) Тогда
			Каталоги.Вставить(ОтносительныйПуть, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элем Из Каталоги Цикл
		СписокКаталогов.Добавить(Элем.Ключ);
	КонецЦикла;
	
	СписокФайлов.СортироватьПоПредставлению();
	СписокКаталогов.СортироватьПоЗначению();
	
	СозданныеКаталоги = Новый Соответствие;
	Для Каждого Элем Из СписокКаталогов Цикл
		МассивСтрок = СтрРазделить(Элем.Значение, "/");
		ЭлРодителя = ДеревоФайлов;
		ЭтоПапка = Истина;
		ПолныйПуть = ПутьКПапкеСФайлами;
		Для Каждого СтрКаталога Из МассивСтрок Цикл
			ПолныйПуть = ДополнитьСлешВПуть(ДополнитьСлешВПуть(ПолныйПуть) + СтрКаталога);
			ЭлементДерева = СозданныеКаталоги[ПолныйПуть];
			
			Если ЭлементДерева = Неопределено Тогда
				ОснЭлементы = ЭлРодителя.ПолучитьЭлементы();
				СтрокаДереваКаталог = ОснЭлементы.Добавить();
				СтрокаДереваКаталог.Имя = СтрКаталога;
				СтрокаДереваКаталог.ПолныйПуть = ПолныйПуть;
				СтрокаДереваКаталог.Картинка = ?(ЭтоПапка, СтруктураКартинок.Папка, СтруктураКартинок.Файл);
				СтрокаДереваКаталог.ЭтоПапка = ЭтоПапка;
				
				СозданныеКаталоги.Вставить(ПолныйПуть, СтрокаДереваКаталог);
				ЭлРодителя = СтрокаДереваКаталог;
			Иначе
				ЭлРодителя = ЭлементДерева;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Элем Из СписокФайлов Цикл
		
		Файл = Элем.Значение;
		ЭлРодителя = СозданныеКаталоги[Файл.Путь];
		
		Если ЭлРодителя = Неопределено Тогда
			ЭлРодителя = ДеревоФайлов;
		КонецЕсли;	 
		
		ОснЭлементы = ЭлРодителя.ПолучитьЭлементы();
		Нов = ОснЭлементы.Добавить();
		Нов.Имя = Файл.Имя;
		Нов.ПолныйПуть = Файл.ПолноеИмя;
		Нов.Картинка = СтруктураКартинок.Файл;
		Нов.ЭтоПапка = Ложь;

	КонецЦикла;
	
	СозданныеКаталоги.Очистить();
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальноеПолноеИмяФайла(Знач ПолноеИмяФайлаИлиФайл, Знач ВНРегистр = Ложь)
	
	Если ТипЗнч(ПолноеИмяФайлаИлиФайл) = Тип("Файл") Тогда
		УниверсальноеПолноеИмя = СтрЗаменить(ПолноеИмяФайлаИлиФайл.ПолноеИмя, "\", "/");
	Иначе
		УниверсальноеПолноеИмя = СтрЗаменить(ПолноеИмяФайлаИлиФайл, "\", "/");
	КонецЕсли;

	Если ВНРегистр Тогда
		УниверсальноеПолноеИмя = НРег(УниверсальноеПолноеИмя);
	КонецЕсли;

	Возврат УниверсальноеПолноеИмя;
	
КонецФункции

&НаКлиенте
Функция СтруктураКартинокДляДереваФайлов()
	
	СтруктураКартинок = Новый Структура;
	
	БинДата = Base64Значение("PHN2ZyB3aWR0aD0iMTYiIGhlaWdodD0iMTYiIHZpZXdCb3g9IjAgMCAxNiAxNiIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHBhdGggZD0iTTEgNEwzIDJIN0w5IDRIMTRDMTQuNTUyMyA0IDE1IDQuNDQ3NzIgMTUgNVYxM0MxNSAxMy41NTIzIDE0LjU1MjMgMTQgMTQgMTRIMkMxLjQ0NzcgMTQgMSAxMy41NTIzIDEgMTNWNFoiIGZpbGw9IiNCQjg3NDQiLz4KPHBhdGggZD0iTTE0IDdIMlYxM0gxNFY3WiIgZmlsbD0iI0Y3REE3RCIvPgo8cGF0aCBkPSJNMTQgNUgyVjZIMTRWNVoiIGZpbGw9IiNGRkUwNjkiLz4KPHBhdGggZD0iTTQgM0wyIDVIOEw2IDNINFoiIGZpbGw9IiNGRkUwNjkiLz4KPC9zdmc+Cg==");
	КартинкаПапки = Новый Картинка(БинДата);
	СтруктураКартинок.Вставить("Папка", КартинкаПапки); 
	
	БинДата = Base64Значение("iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAABS2lUWHRYTUw6Y29tLmFkb2JlLnhtcAAAAAAAPD94cGFja2V0IGJlZ2luPSLvu78iIGlkPSJXNU0wTXBDZWhpSHpyZVN6TlRjemtjOWQiPz4KPHg6eG1wbWV0YSB4bWxuczp4PSJhZG9iZTpuczptZXRhLyIgeDp4bXB0az0iQWRvYmUgWE1QIENvcmUgNS42LWMxMzggNzkuMTU5ODI0LCAyMDE2LzA5LzE0LTAxOjA5OjAxICAgICAgICAiPgogPHJkZjpSREYgeG1sbnM6cmRmPSJodHRwOi8vd3d3LnczLm9yZy8xOTk5LzAyLzIyLXJkZi1zeW50YXgtbnMjIj4KICA8cmRmOkRlc2NyaXB0aW9uIHJkZjphYm91dD0iIi8+CiA8L3JkZjpSREY+CjwveDp4bXBtZXRhPgo8P3hwYWNrZXQgZW5kPSJyIj8+IEmuOgAAAGhJREFUOI1jYKAQMDIwMDD4ZNUXMDAw+JOgb+OWaY0T4DyfrPr9/0kAPln1+2F6mSj1AsUGsKALLFy3nUFLRQGrYlM9TcIGxAd5UtcF2GylrwuQwcCEAc1dQLWEtNE3u4EUfRsptRgOALn3R2pxdRrxAAAAAElFTkSuQmCC");
	КартинкаФайла = Новый Картинка(БинДата);
	СтруктураКартинок.Вставить("Файл", КартинкаФайла); 
	
	Возврат СтруктураКартинок;
	
КонецФункции

&НаКлиенте
Функция ДополнитьСлешВПуть(Знач Каталог) Экспорт
	
	Разделитель = "\";
	
	Если ПустаяСтрока(Каталог) Тогда
		Возврат Каталог;
	КонецЕсли;
	Если ЭтоLinux Тогда
		Разделитель = "/";
		Каталог = СтрЗаменить(Каталог, "\", "/");
	КонецЕсли;
		
	Если Прав(Каталог, 1) <> Разделитель Тогда
		Каталог = Каталог + Разделитель;
	КонецЕсли;
	Возврат Каталог;
	
КонецФункции

&НаКлиенте
Функция РасширениеФайлаНакидка()

	Возврат "txt";

КонецФункции

&НаКлиенте
Процедура УстановитьМодифицированность()
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЦвета()
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗначениеЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму(ИдентификаторОбработки + ".Форма.ФормаВыбораЦвета", , ЭтаФорма, , , , ОписаниеОповещения);
КонецПроцедуры   

&НаКлиенте
Процедура ЗначениеЦветНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяСтрока = Элементы.ПалитраСвойств.ТекущиеДанные;
	
	ТекущаяСтрока.ЗначениеЦвет = РезультатЗакрытия.Цвет;   
	ТекущаяСтрока.ЗначениеСтрока = РезультатЗакрытия.ИмяЦвета;   
	ИзменитьЗначениеСвойстваПалитры();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы()
	Шаблон = "Накидка. v%1. %2";   
	ИмяФайла = ?(ПустаяСтрока(мТекущееИмяФайла), "Новый", мТекущееИмяФайла);
	ЭтаФорма.Заголовок = СтрШаблон(Шаблон, ЭтотОбъект.ТекущаяВерсия, ИмяФайла);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийФайл(ПутьКФайлу)
	Если ПутьКФайлу = Неопределено Тогда
		мПутьКФайлу = "";
		мТекущееИмяФайла = "";
	Иначе
		мПутьКФайлу = ПутьКФайлу;   
		СтруктураИмени = СлужебныеФункции().РазложитьПолноеИмяФайла(ПутьКФайлу); 
		мТекущееИмяФайла = СтруктураИмени.ИмяБезРасширения;
	КонецЕсли;
	ОбновитьЗаголовокФормы();
КонецПроцедуры

&НаСервере
Функция ПолучитьДеревоКонфигурацииНаСервере()
	Результат = Новый Структура;
	МассивРазделовМетаданных = СтрРазделить("Справочники,Документы,Перечисления", ",");
	
	Для Каждого Раздел Из МассивРазделовМетаданных Цикл 
		МассивОбъектов = Новый Массив;
		Результат.Вставить(Раздел, МассивОбъектов);
		Для Каждого ОбъектМетаданных Из Метаданные[Раздел] Цикл
			Структура = Новый Структура("Имя,Синоним,ЭтоПрисоединенныеФайлы,ЭтоНедействительный");
			Структура.Имя = ОбъектМетаданных.Имя;
			Структура.Синоним = ОбъектМетаданных.Представление();
			Структура.ЭтоПрисоединенныеФайлы = СтрЗаканчиваетсяНа(НРег(Структура.Имя), "присоединенныефайлы");
			Структура.ЭтоНедействительный = СтрНачинаетсяС(НРег(Структура.Имя), "удалить");
			
			МассивОбъектов.Добавить(Структура);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьВарианты(Заголовок)  
	Результат = мВариантыТипов.Получить(Заголовок);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	мДеревоМетаданных = ПолучитьДеревоКонфигурацииНаСервере();
	
	ЗапросИИ = Заголовок;
	
	НовыеВарианты = Новый Массив;
	
	Настройки = РаботаСИИ().ПолучитьНастройки();
	Настройки.ПровайдерИИ = ПровайдерИИ;
	Настройки.МодельИИ = МодельИИ;
	Настройки.ТокенИИ = ТокенИИ;
	
	Ответ = РаботаСИИ().ПолучитьВозможныеТипы(ЗапросИИ, Настройки);
	
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Не удалось получить ответ!";
	КонецЕсли;
	
	ПозицияНачала = СтрНайти(Ответ, "[");
	Ответ = Сред(Ответ, ПозицияНачала);
	
	ОтветМассив = СлужебныеФункции().JSONВСтруктуру(Ответ);
	
	МассивЕдинственноеЧисло = Новый Массив;
	МассивМножественноеЧисло = Новый Массив;
	
	Для Каждого СтрОтвет Из ОтветМассив Цикл
		ЕдинственноеЧисло = НРег(СтрОтвет.ЕдинственноеЧисло);
		МножественноеЧисло = НРег(СтрОтвет.МножественноеЧисло);
		
		Если ЕдинственноеЧисло = "номенклатура" Тогда
			МножественноеЧисло = "номенклатура";
		КонецЕсли;
		
		МассивЕдинственноеЧисло.Добавить(ЕдинственноеЧисло);                 
		МассивМножественноеЧисло.Добавить(МножественноеЧисло);
	КонецЦикла;

	Варианты = Новый СписокЗначений;     
	МассивВарианты = Новый Массив;     

	
	Индекс = 0;
	Для Каждого МножественноеЧисло Из МассивМножественноеЧисло Цикл
		ВариантДобавлен = Ложь;
		Для Каждого ЭлементМетаданных Из мДеревоМетаданных.Справочники Цикл     
			ПолноеИмя = "СправочникСсылка." + ЭлементМетаданных.Имя;
			Если МассивВарианты.Найти(ПолноеИмя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементМетаданных.ЭтоПрисоединенныеФайлы Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементМетаданных.ЭтоНедействительный Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНайти(НРег(ЭлементМетаданных.Имя), МножественноеЧисло) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Расстояние = СлужебныеФункции().РасстояниеЛевенштейна(НРег(ЭлементМетаданных.Имя), МножественноеЧисло);
			Варианты.Добавить(Расстояние, ПолноеИмя);
			МассивВарианты.Добавить(ПолноеИмя);
			Если Расстояние = 0 Тогда
				ВариантДобавлен = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлементМетаданных Из мДеревоМетаданных.Перечисления Цикл
			ПолноеИмя = "ПеречислениеСсылка." + ЭлементМетаданных.Имя;
			Если МассивВарианты.Найти(ПолноеИмя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементМетаданных.ЭтоПрисоединенныеФайлы Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементМетаданных.ЭтоНедействительный Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНайти(НРег(ЭлементМетаданных.Имя), МножественноеЧисло) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Расстояние = СлужебныеФункции().РасстояниеЛевенштейна(НРег(ЭлементМетаданных.Имя), МножественноеЧисло);
			Варианты.Добавить(Расстояние, ПолноеИмя);
			МассивВарианты.Добавить(ПолноеИмя); 
			Если Расстояние = 0 Тогда
				ВариантДобавлен = Истина;
			КонецЕсли;
		КонецЦикла;		
		
		Если НЕ ВариантДобавлен Тогда
			НовыеВарианты.Добавить(ОтветМассив[Индекс].МножественноеЧисло);
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Варианты.СортироватьПоЗначению();
	МассивРезультат = Новый Массив;
	Для Каждого Вариант Из Варианты Цикл
		МассивРезультат.Добавить(Вариант.Представление);
	КонецЦикла;
	
	Результат = Новый Структура("Существующие,Новые", МассивРезультат, НовыеВарианты);
	мВариантыТипов.Вставить(Заголовок, Результат);
	
	Возврат Результат;
КонецФункции

#КонецОбласти   

&НаКлиенте
Процедура ЗаполнитьДеревоЭлементов(ЭлементыСД, ЭлементыДерева)
	Для Каждого ЭлементСД Из ЭлементыСД Цикл
		НовыйЭлементДерева = ЭлементыДерева.Добавить();      
		
		Если ЭлементСД.НаборСвойств.Свойство("Заголовок") Тогда
			НовыйЭлементДерева.Представление = ЭлементСД.НаборСвойств.Заголовок;
		Иначе
			НовыйЭлементДерева.Представление = ЭлементСД.Тип;
		КонецЕсли;
		
		Если НЕ ЭлементСД.Свойство("Элементы") Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьДеревоЭлементов(ЭлементСД.Элементы, НовыйЭлементДерева.ПолучитьЭлементы());
	КонецЦикла;
КонецПроцедуры

#Область РедакторТаблицы

&НаКлиенте
Процедура ПостроитьКолонкиПоОписаниюТаблицы(ОписаниеЭлемента, ТаблицаКолонкиЭлементы)
	Для Каждого ОписаниеКолонки Из ОписаниеЭлемента.Колонки Цикл
		СтрокаТаблицы = ТаблицаКолонкиЭлементы.Добавить();
		СтрокаТаблицы.УИД = ОписаниеКолонки.УИД;

		Если ОписаниеКолонки.НаборСвойств.Свойство("Заголовок") Тогда
			СтрокаТаблицы.Заголовок = ОписаниеКолонки.НаборСвойств.Заголовок;
		КонецЕсли;
		
		Если ОписаниеКолонки.НаборСвойств.Свойство("ГоризонтальноеПоложение") Тогда
			СтрокаТаблицы.ГоризонтальноеПоложение = ОписаниеКолонки.НаборСвойств.ГоризонтальноеПоложение;
		Иначе
			СтрокаТаблицы.ГоризонтальноеПоложение = "Лево";
		КонецЕсли;
		СтрокаТаблицы.ЭтоГруппа = (ОписаниеКолонки.Тип = "ГруппаКолонокТаблицы");
		
		ПостроитьКолонкиПоОписаниюТаблицы(ОписаниеКолонки, СтрокаТаблицы.ПолучитьЭлементы());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНовоеОписаниеТаблицы(ТекущееОписание)
	СоответствиеКолонок = Новый Соответствие;
	
	//Если ТекущееОписание = Неопределено Тогда
	//	Результат = Парсер().ПолучитьОписаниеТаблицы(Неопределено);
	//Иначе
		Результат = Новый Структура;
	//	Для Каждого КлючЗначение Из ТекущееОписание Цикл
	//		Если КлючЗначение.Ключ = "Колонки" Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Результат.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	//	КонецЦикла;
	//	
	//	Результат.Вставить("Колонки", Новый Массив);
	//	
	//	ЗаполнитьСоответствиеТекущихКолонок(СоответствиеКолонок, ТекущееОписание);
	//КонецЕсли;
	//
	//ЗаполнитьКолонкиВРезультате(Результат, СоответствиеКолонок, ТаблицаКолонки.ПолучитьЭлементы());
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСоответствиеТекущихКолонок(СоответствиеКолонок, ОписаниеЭлемента)
	Для Каждого Колонка Из ОписаниеЭлемента.Колонки Цикл
		СоответствиеКолонок.Вставить(Колонка.УИД, Колонка);
		ЗаполнитьСоответствиеТекущихКолонок(СоответствиеКолонок, Колонка)
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкиВРезультате(ОписаниеЭлемента, СоответствиеКолонок, ТаблицаКолонкиЭлементы)
	//Для Каждого СтрокаКолонка Из ТаблицаКолонкиЭлементы Цикл
	//	ТекущаяКолонка = СоответствиеКолонок.Получить(СтрокаКолонка.УИД);
	//	
	//	Если ТекущаяКолонка = Неопределено Тогда
	//		ТекущаяКолонка = Парсер().ПолучитьОписаниеКолонкиТаблицы(Неопределено);
	//	КонецЕсли;
	//	ТекущаяКолонка.Колонки.Очистить();
	//	ТекущаяКолонка.НаборСвойств.Заголовок = СтрокаКолонка.Заголовок;    
	//	
	//	ТекущаяКолонка.НаборСвойств.Удалить("ГоризонтальноеПоложение");
	//	Если СтрокаКолонка.ГоризонтальноеПоложение <> "Лево" Тогда
	//		ТекущаяКолонка.НаборСвойств.Вставить("ГоризонтальноеПоложение", СтрокаКолонка.ГоризонтальноеПоложение);
	//	КонецЕсли;
	//	
	//	ТекущаяКолонка.Тип = ?(СтрокаКолонка.ЭтоГруппа,"ГруппаКолонокТаблицы", "КолонкаТаблицы"); 
	//	ОписаниеЭлемента.Колонки.Добавить(ТекущаяКолонка);    
	//	
	//	ЗаполнитьКолонкиВРезультате(ТекущаяКолонка, СоответствиеКолонок, СтрокаКолонка.ПолучитьЭлементы());
	//КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область АПИ 


//export interface IEnterpriseConnector {
//  formatText(): void
//  setText(text: string): void
//  insertText(text: string): void
//  getNewValue(type: string): string | undefined
//  createOrUpdateElement(plainText: string): void
//}

&НаКлиенте
Функция АПИ_ПолучитьПараметрыПередачиЭлемента(Элемент, Путь, ЭтоНовый)
	Возврат Новый Структура("Элемент,Путь,ЭтоНовый", Элемент, Путь, ЭтоНовый);
КонецФункции

&НаКлиенте
Функция АПИ_ПолучитьПараметрыСобытия(ДанныеСобытия)
	Событие = ДанныеСобытия.Event.eventData1C;
	
	Если Событие = Неопределено Или ТипЗнч(Событие) = Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура("ВидСобытия", Событие.event);
	
	Если Результат.ВидСобытия = мСобытиеПриИзмененииСодержимогоРедактора Тогда
		Результат.Вставить("Текст", Событие.params.text);
		Результат.Вставить("СемантическоеДерево",СлужебныеФункции().JSONВСтруктуру( Событие.params.cst));
		Возврат Результат;
	КонецЕсли;            
	
	Если Результат.ВидСобытия = мСобытиеПриИзмененииТекущегоЭлементаРедактора Тогда
		Результат.Вставить("Элемент", СлужебныеФункции().JSONВСтруктуру(Событие.params.element));
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура АПИ_Форматировать()
	мКонтекстОкнаРедактораHTML.formatText();	
КонецПроцедуры

&НаКлиенте
Процедура АПИ_УстановитьТекст(Текст)
	мКонтекстОкнаРедактораHTML.setText(Текст);	
КонецПроцедуры

&НаКлиенте
Процедура АПИ_ВставитьТекстВПозицию(Текст)
	мКонтекстОкнаРедактораHTML.insertText(Текст);	
КонецПроцедуры

&НаКлиенте
Функция АПИ_ПолучитьТаблицу()
	Данные = мКонтекстОкнаРедактораHTML.getTable();
	Возврат СлужебныеФункции().JSONВСтруктуру(Данные);
КонецФункции

&НаКлиенте
Процедура АПИ_СоздатьОбновитьЭлемент(ДанныеЭлемента)   
	Текст = СлужебныеФункции().СтруктураВJSON(ДанныеЭлемента);
	мКонтекстОкнаРедактораHTML.createOrUpdateElement(Текст);		
КонецПроцедуры

&НаКлиенте
Функция АПИ_ПолучитьНовоеЗначение(Тип)
	Данные = мКонтекстОкнаРедактораHTML.getNewValue(Тип);
	Возврат СлужебныеФункции().JSONВСтруктуру(Данные);
КонецФункции

&НаКлиенте
Функция АПИ_ПолучитьТекст()
	Возврат мКонтекстОкнаРедактораHTML.getText();
КонецФункции


#КонецОбласти   

#Область ИнициализацияДанных

ЭтоLinux = Ложь;
СистемнаяИнформация = Новый СистемнаяИнформация;

Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда 
	ЭтоLinux = Истина;
КонецЕсли;

мПрефикс = "__";

мСобытиеПриИзмененииСодержимогоРедактора = "EVENT_CHANGE_CONTENT";
мСобытиеПриИзмененииТекущегоЭлементаРедактора = "EVENT_SELECT_ELEMENT";

#КонецОбласти
