// MIT License

// Copyright (c) 2025 Zherebtsov Nikita <nikita@crimsongold.ru>

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/crimsongoldteam/md_design


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	Палитра = ПолучитьПалитрыЦветовНаСервере();
	
	Шрифт = Новый Шрифт("Calibri", 10);
	
	ШиринаПоля = 5;
	Для СчКолонок = 0 По Палитра.ВГраница() Цикл
		
		МассивОттенки = Палитра[СчКолонок];
		
		ЭлементГруппа = Элементы.Добавить("Группа" + СчКолонок, Тип("ГруппаФормы"), Элементы.ГруппаКонтейнер);
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппа.ОтображатьЗаголовок = Ложь;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ЭлементГруппа.РастягиватьПоГоризонтали = Истина;
		ЭлементГруппа.РастягиватьПоВертикали = Ложь;
		ЭлементГруппа.Ширина = ШиринаПоля;
		
		Для Каждого ЭлементОттенок Из МассивОттенки Цикл
			ИмяГруппы = "ГруппаКнопкаЦвет_" + ЭлементОттенок.Имя;
			Если НЕ ЭлементОттенок.Основной Тогда
				СписокНеобязательныхЭлементов.Добавить(ИмяГруппы);
			КонецЕсли;
			
			ГруппаКнопка = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ЭлементГруппа);
			ГруппаКнопка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопка.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопка.ОтображатьЗаголовок = Ложь;
			ГруппаКнопка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаКнопка.РастягиватьПоГоризонтали = Истина;
			ГруппаКнопка.РастягиватьПоВертикали = Ложь;
			ГруппаКнопка.ЦветФона = ЭлементОттенок.Цвет;
			ГруппаКнопка.Ширина = ШиринаПоля;
			
			КнопкаЦвет = Элементы.Добавить("КнопкаЦвет_" + ЭлементОттенок.Имя, Тип("КнопкаФормы"), ГруппаКнопка);
			КнопкаЦвет.ИмяКоманды = "Выбрать";
			КнопкаЦвет.Заголовок = " ";// ЭлементОттенок.Представление;
			КнопкаЦвет.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			КнопкаЦвет.ЦветФона = ЭлементОттенок.Цвет;
			КнопкаЦвет.ЦветТекста = ЭлементОттенок.ЦветТекста;
			КнопкаЦвет.ОтображениеФигуры = ОтображениеФигурыКнопки.ПриАктивности;
			КнопкаЦвет.РастягиватьПоГоризонтали = Истина;
			КнопкаЦвет.Шрифт = Шрифт;
			КнопкаЦвет.РасширеннаяПодсказка.Заголовок = ЭлементОттенок.Представление;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ИмяКнопки = ТекущийЭлемент.Имя;
	ПозицияРазделителя = СтрНайти(ИмяКнопки, "_");
	ИмяЦвета = Сред(ИмяКнопки, ПозицияРазделителя + 1);
	
	РезультатЗакрытия = Новый Структура("Цвет,ИмяЦвета", WebЦвета[ИмяЦвета], ИмяЦвета);
	
	Закрыть(РезультатЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВсеЦвета(Команда)
	ПоказыватьВсеЦвета = НЕ ПоказыватьВсеЦвета;
	УстановитьВидимостьДоступностьЭлементов()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.ФормаПоказыватьВсеЦвета.Пометка = ПоказыватьВсеЦвета;

	Для Каждого ЭлементСписка Из СписокНеобязательныхЭлементов Цикл
		Элементы[ЭлементСписка.Значение].Видимость = ПоказыватьВсеЦвета;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПалитрыЦветовНаСервере()
	Результат = Новый Массив;        
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Черный", WebЦвета.Черный, WebЦвета.Белый,"Черный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Белый", WebЦвета.Белый, WebЦвета.Черный,"Белый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Серый", WebЦвета.Серый, WebЦвета.Черный,"Серый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Белоснежный", WebЦвета.Белоснежный, WebЦвета.Черный,"Белоснежный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Дымчато-белый", WebЦвета.ДымчатоБелый, WebЦвета.Черный,"ДымчатоБелый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Серебристо-серый", WebЦвета.СеребристоСерый, WebЦвета.Черный,"СеребристоСерый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Серебряный", WebЦвета.Серебряный, WebЦвета.Черный,"Серебряный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-серый", WebЦвета.СветлоСерый, WebЦвета.Черный,"СветлоСерый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-серый", WebЦвета.ТемноСерый, WebЦвета.Черный,"ТемноСерый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-серый", WebЦвета.НейтральноСерый, WebЦвета.Черный,"НейтральноСерый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Тускло-серый", WebЦвета.ТусклоСерый, WebЦвета.Белый,"ТусклоСерый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-грифельно-серый", WebЦвета.СветлоГрифельноСерый, WebЦвета.Черный,"СветлоГрифельноСерый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Грифельно-серый", WebЦвета.ГрифельноСерый, WebЦвета.Белый,"ГрифельноСерый", Истина));

	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Красный", WebЦвета.Красный, WebЦвета.Белый,"Красный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Голубой с красным оттенком", WebЦвета.ГолубойСКраснымОттенком, WebЦвета.Черный,"ГолубойСКраснымОттенком", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Тускло-розовый", WebЦвета.ТусклоРозовый, WebЦвета.Черный,"ТусклоРозовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Розовый", WebЦвета.Розовый, WebЦвета.Черный,"Розовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-розовый", WebЦвета.СветлоРозовый, WebЦвета.Черный,"СветлоРозовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Лосось светлый", WebЦвета.ЛососьСветлый, WebЦвета.Черный,"ЛососьСветлый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Лосось Темный", WebЦвета.ЛососьТемный, WebЦвета.Черный,"ЛососьТемный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Лосось", WebЦвета.Лосось, WebЦвета.Черный,"Лосось", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-коралловый", WebЦвета.СветлоКоралловый, WebЦвета.Черный,"СветлоКоралловый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-красно-фиолетовый", WebЦвета.БледноКрасноФиолетовый, WebЦвета.Черный,"БледноКрасноФиолетовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Тепло-розовый", WebЦвета.ТеплоРозовый, WebЦвета.Черный,"ТеплоРозовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Розово-коричневый", WebЦвета.РозовоКоричневый, WebЦвета.Черный,"РозовоКоричневый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Оранжево-красный", WebЦвета.ОранжевоКрасный, WebЦвета.Белый,"ОранжевоКрасный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Киноварь", WebЦвета.Киноварь, WebЦвета.Белый,"Киноварь"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Малиновый", WebЦвета.Малиновый, WebЦвета.Белый,"Малиновый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Кирпичный", WebЦвета.Кирпичный, WebЦвета.Белый,"Кирпичный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Коричневый", WebЦвета.Коричневый, WebЦвета.Белый,"Коричневый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-красный", WebЦвета.ТемноКрасный, WebЦвета.Белый,"ТемноКрасный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-бордовый", WebЦвета.ТемноБордовый, WebЦвета.Белый,"ТемноБордовый"));
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Оранжевый", WebЦвета.Оранжевый, WebЦвета.Черный,"Оранжевый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Топленое молоко", WebЦвета.ТопленоеМолоко, WebЦвета.Черный,"ТопленоеМолоко", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-Миндальный", WebЦвета.БледноМиндальный, WebЦвета.Черный,"БледноМиндальный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("АнтикБелый", WebЦвета.Антикбелый, WebЦвета.Черный,"Антикбелый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-коричневый", WebЦвета.СветлоКоричневый, WebЦвета.Черный,"СветлоКоричневый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Замша Светлый", WebЦвета.ЗамшаСветлый, WebЦвета.Черный,"ЗамшаСветлый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Персиковый", WebЦвета.Персиковый, WebЦвета.Черный,"Персиковый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Пшеничный", WebЦвета.Пшеничный, WebЦвета.Черный,"Пшеничный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Древесный", WebЦвета.Древесный, WebЦвета.Черный,"Древесный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Рыжевато-коричневый", WebЦвета.РыжеватоКоричневый, WebЦвета.Черный,"РыжеватоКоричневый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Песочно-коричневый", WebЦвета.ПесочноКоричневый, WebЦвета.Черный,"ПесочноКоричневый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Хаки Темный", WebЦвета.ХакиТемный, WebЦвета.Черный,"ХакиТемный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-оранжевый", WebЦвета.ТемноОранжевый, WebЦвета.Черный,"ТемноОранжевый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Томатный", WebЦвета.Томатный, WebЦвета.Черный,"Томатный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Коралловый", WebЦвета.Коралловый, WebЦвета.Черный,"Коралловый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-коричневый", WebЦвета.НейтральноКоричневый, WebЦвета.Черный,"НейтральноКоричневый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Шоколадный", WebЦвета.Шоколадный, WebЦвета.Черный,"Шоколадный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Охра", WebЦвета.Охра, WebЦвета.Белый,"Охра"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Кожано-коричневый", WebЦвета.КожаноКоричневый, WebЦвета.Белый,"КожаноКоричневый", Истина));
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Желтый", WebЦвета.Желтый, WebЦвета.Черный,"Желтый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Слоновая Кость", WebЦвета.СлоноваяКость, WebЦвета.Черный,"СлоноваяКость", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-желтый", WebЦвета.СветлоЖелтый, WebЦвета.Черный,"СветлоЖелтый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Кремовый", WebЦвета.Кремовый, WebЦвета.Черный,"Кремовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Цветок Белый", WebЦвета.ЦветокБелый, WebЦвета.Черный,"ЦветокБелый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Перламутровый", WebЦвета.Перламутровый, WebЦвета.Черный,"Перламутровый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Шелковый оттенок", WebЦвета.ШелковыйОттенок, WebЦвета.Черный,"ШелковыйОттенок"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Лимонный", WebЦвета.Лимонный, WebЦвета.Черный,"Лимонный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Старое кружево", WebЦвета.СтароеКружево, WebЦвета.Черный,"СтароеКружево"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-желтый золотистый", WebЦвета.СветлоЖелтыйЗолотистый, WebЦвета.Черный,"СветлоЖелтыйЗолотистый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бежевый", WebЦвета.Бежевый, WebЦвета.Черный,"Бежевый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Льняной", WebЦвета.Льняной, WebЦвета.Черный,"Льняной"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-золотистый", WebЦвета.СветлоЗолотистый, WebЦвета.Черный,"СветлоЗолотистый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-золотистый", WebЦвета.БледноЗолотистый, WebЦвета.Черный,"БледноЗолотистый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Навахо Белый", WebЦвета.НавахоБелый, WebЦвета.Черный,"НавахоБелый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Хаки", WebЦвета.Хаки, WebЦвета.Черный,"Хаки", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Золотой", WebЦвета.Золотой, WebЦвета.Черный,"Золотой", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Золотистый", WebЦвета.Золотистый, WebЦвета.Черный,"Золотистый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-золотистый", WebЦвета.ТемноЗолотистый, WebЦвета.Черный,"ТемноЗолотистый"));
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Зеленый", WebЦвета.Зеленый, WebЦвета.Белый,"Зеленый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Мятный крем", WebЦвета.МятныйКрем, WebЦвета.Черный,"МятныйКрем"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Роса", WebЦвета.Роса, WebЦвета.Черный,"Роса", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-зеленый", WebЦвета.БледноЗеленый, WebЦвета.Черный,"БледноЗеленый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-зеленый", WebЦвета.НейтральноЗеленый, WebЦвета.Черный,"НейтральноЗеленый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Зелено-желтый", WebЦвета.ЗеленоЖелтый, WebЦвета.Черный,"ЗеленоЖелтый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-зеленый", WebЦвета.СветлоЗеленый, WebЦвета.Черный,"СветлоЗеленый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Зеленовато-желтый", WebЦвета.ЗеленоватоЖелтый, WebЦвета.Черный,"ЗеленоватоЖелтый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Зеленая лужайка", WebЦвета.ЗеленаяЛужайка, WebЦвета.Черный,"ЗеленаяЛужайка"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-весенне-зеленый", WebЦвета.НейтральноВесеннеЗеленый, WebЦвета.Черный,"НейтральноВесеннеЗеленый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Весенне-зеленый", WebЦвета.ВесеннеЗеленый, WebЦвета.Черный,"ВесеннеЗеленый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Зеленовато-лимонный", WebЦвета.ЗеленоватоЛимонный, WebЦвета.Черный,"ЗеленоватоЛимонный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Желто-зеленый", WebЦвета.ЖелтоЗеленый, WebЦвета.Черный,"ЖелтоЗеленый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Лимонно-зеленый", WebЦвета.ЛимонноЗеленый, WebЦвета.Черный,"ЛимонноЗеленый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Тускло-оливковый", WebЦвета.ТусклоОливковый, WebЦвета.Белый,"ТусклоОливковый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Оливковый", WebЦвета.Оливковый, WebЦвета.Белый,"Оливковый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Зеленый лес", WebЦвета.ЗеленыйЛес, WebЦвета.Белый,"ЗеленыйЛес"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-оливково-зеленый", WebЦвета.ТемноОливковоЗеленый, WebЦвета.Белый,"ТемноОливковоЗеленый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-зеленый", WebЦвета.ТемноЗеленый, WebЦвета.Белый,"ТемноЗеленый", Истина));
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Голубой", WebЦвета.Голубой, WebЦвета.Черный,"Голубой", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Лазурный", WebЦвета.Лазурный, WebЦвета.Черный,"Лазурный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Циан светлый", WebЦвета.ЦианСветлый, WebЦвета.Черный,"ЦианСветлый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-бирюзовый", WebЦвета.БледноБирюзовый, WebЦвета.Черный,"БледноБирюзовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Аквамарин", WebЦвета.Аквамарин, WebЦвета.Черный,"Аквамарин", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Циан акварельный", WebЦвета.ЦианАкварельный, WebЦвета.Черный,"ЦианАкварельный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Циан", WebЦвета.Циан, WebЦвета.Черный,"Циан", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бирюзовый", WebЦвета.Бирюзовый, WebЦвета.Черный,"Бирюзовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-бирюзовый", WebЦвета.НейтральноБирюзовый, WebЦвета.Черный,"НейтральноБирюзовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-бирюзовый", WebЦвета.ТемноБирюзовый, WebЦвета.Черный,"ТемноБирюзовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Цвет морской волны Нейтральный", WebЦвета.ЦветМорскойВолныНейтральный, WebЦвета.Черный,"ЦветМорскойВолныНейтральный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-аквамариновый", WebЦвета.НейтральноАквамариновый, WebЦвета.Черный,"НейтральноАквамариновый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Цвет морской волны Светлый", WebЦвета.ЦветМорскойВолныСветлый, WebЦвета.Черный,"ЦветМорскойВолныСветлый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Цвет морской волны Темный", WebЦвета.ЦветМорскойВолныТемный, WebЦвета.Черный,"ЦветМорскойВолныТемный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Серо-синий", WebЦвета.СероСиний, WebЦвета.Черный,"СероСиний"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Цвет морской волны", WebЦвета.ЦветМорскойВолны, WebЦвета.Белый,"ЦветМорскойВолны"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Циан Темный", WebЦвета.ЦианТемный, WebЦвета.Белый,"ЦианТемный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Циан Нейтральный", WebЦвета.ЦианНейтральный, WebЦвета.Белый,"ЦианНейтральный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-грифельно-серый", WebЦвета.ТемноГрифельноСерый, WebЦвета.Белый,"ТемноГрифельноСерый"));
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Синий", WebЦвета.Синий, WebЦвета.Белый,"Синий", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Акварельно-синий", WebЦвета.АкварельноСиний, WebЦвета.Черный,"АкварельноСиний", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Синий с пороховым оттенком", WebЦвета.СинийСПороховымОттенком, WebЦвета.Черный,"СинийСПороховымОттенком", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Голубой со стальным оттенком", WebЦвета.ГолубойСоСтальнымОттенком, WebЦвета.Черный,"ГолубойСоСтальнымОттенком"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-небесно-голубой", WebЦвета.СветлоНебесноГолубой, WebЦвета.Черный,"СветлоНебесноГолубой"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Небесно-голубой", WebЦвета.НебесноГолубой, WebЦвета.Черный,"НебесноГолубой"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Насыщенно-небесно-голубой", WebЦвета.НасыщенноНебесноГолубой, WebЦвета.Черный,"НасыщенноНебесноГолубой", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Сине-серый", WebЦвета.СинеСерый, WebЦвета.Белый,"СинеСерый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Васильковый", WebЦвета.Васильковый, WebЦвета.Черный,"Васильковый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Светло-грифельно-синий", WebЦвета.СветлоГрифельноСиний, WebЦвета.Черный,"СветлоГрифельноСиний"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-грифельно-синий", WebЦвета.НейтральноГрифельноСиний, WebЦвета.Белый,"НейтральноГрифельноСиний"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Синий со стальным оттенком", WebЦвета.СинийСоСтальнымОттенком, WebЦвета.Белый,"СинийСоСтальнымОттенком"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Грифельно-синий", WebЦвета.ГрифельноСиний, WebЦвета.Белый,"ГрифельноСиний"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Королевский Голубой", WebЦвета.КоролевскиГолубой, WebЦвета.Белый,"КоролевскиГолубой", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-грифельно-синий", WebЦвета.ТемноГрифельноСиний, WebЦвета.Белый,"ТемноГрифельноСиний"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-синий", WebЦвета.НейтральноСиний, WebЦвета.Белый,"НейтральноСиний", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Полночно-синий", WebЦвета.ПолночноСиний, WebЦвета.Белый,"ПолночноСиний"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-синий", WebЦвета.ТемноСиний, WebЦвета.Белый,"ТемноСиний", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Ультрамарин", WebЦвета.Ультрамарин, WebЦвета.Белый,"Ультрамарин"));
	
	Колонка = Новый Массив;
	Результат.Добавить(Колонка);
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Фиолетовый", WebЦвета.Фиолетовый, WebЦвета.Черный,"Фиолетовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Призрачно-белый", WebЦвета.ПризрачноБелый, WebЦвета.Черный,"ПризрачноБелый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-лиловый", WebЦвета.БледноЛиловый, WebЦвета.Черный,"БледноЛиловый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Бледно-сиреневый", WebЦвета.БледноСиреневый, WebЦвета.Черный,"БледноСиреневый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Сливовый", WebЦвета.Сливовый, WebЦвета.Черный,"Сливовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Орхидея", WebЦвета.Орхидея, WebЦвета.Черный,"Орхидея"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Орхидея Нейтральный", WebЦвета.ОрхидеяНейтральный, WebЦвета.Черный,"ОрхидеяНейтральный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-пурпурный", WebЦвета.НейтральноПурпурный, WebЦвета.Черный,"НейтральноПурпурный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Сине-фиолетовый", WebЦвета.СинеФиолетовый, WebЦвета.Белый,"СинеФиолетовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Орхидея Темный", WebЦвета.ОрхидеяТемный, WebЦвета.Белый,"ОрхидеяТемный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Темно-фиолетовый", WebЦвета.ТемноФиолетовый, WebЦвета.Белый,"ТемноФиолетовый"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Фуксия", WebЦвета.Фуксия, WebЦвета.Белый,"Фуксия", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Фуксин", WebЦвета.Фуксин, WebЦвета.Белый,"Фуксин"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Насыщенно-розовый", WebЦвета.НасыщенноРозовый, WebЦвета.Белый,"НасыщенноРозовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Красно-фиолетовый", WebЦвета.КрасноФиолетовый, WebЦвета.Белый,"КрасноФиолетовый", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Нейтрально-фиолетово-красный", WebЦвета.НейтральноФиолетовоКрасный, WebЦвета.Белый,"НейтральноФиолетовоКрасный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Фуксин Темный", WebЦвета.ФуксинТемный, WebЦвета.Белый,"ФуксинТемный"));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Пурпурный", WebЦвета.Пурпурный, WebЦвета.Белый,"Пурпурный", Истина));
	Колонка.Добавить(ПолучитьОписаниеЦветаНаСервере("Индиго", WebЦвета.Индиго, WebЦвета.Белый,"Индиго", Истина));
	Возврат Результат;
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьОписаниеЦветаНаСервере(Представление, Цвет, ЦветТекста, Имя, Основной = Ложь)
	Возврат Новый Структура("Представление,Цвет,ЦветТекста,Имя, Основной", Представление, Цвет, ЦветТекста, Имя, Основной);
КонецФункции

#КонецОбласти