#Область ОбработчикиСобытийФормы

&НаКлиенте
Функция Лексема(ИмяПараметра) Экспорт
	СтруктураПараметры = Новый Структура;  
	СтруктураПараметры.Вставить("ФормаЗаголовок", "---");
	
	СтруктураПараметры.Вставить("РазделительГруппаДобавить", "#");
	СтруктураПараметры.Вставить("РазделительГруппа", "+");
	СтруктураПараметры.Вставить("РазделительГруппаОднострочная", "&");
	СтруктураПараметры.Вставить("Уровень", ".");
	СтруктураПараметры.Вставить("КоманднаяПанельНачало", "<");
	СтруктураПараметры.Вставить("КоманднаяПанельКонец", ">");
	СтруктураПараметры.Вставить("КоманднаяПанельРазделительМеню", "-");
	СтруктураПараметры.Вставить("КоманднаяПанельРазделительКнопок", "|");
	СтруктураПараметры.Вставить("ТаблицаРазделитель", "|");
	СтруктураПараметры.Вставить("Картинка", "@");
	СтруктураПараметры.Вставить("ТаблицаКолонкаГруппа", "-");
	СтруктураПараметры.Вставить("ПолеВводаРазделитель", ":");
	СтруктураПараметры.Вставить("СтраницаРазделитель", "/");
	
	СтруктураПараметры.Вставить("ФлажокРазделительГрупп", "|");
	СтруктураПараметры.Вставить("ФлажокНачало", "[");
	СтруктураПараметры.Вставить("ФлажокКонец", "]");

	Возврат СтруктураПараметры[ИмяПараметра];
КонецФункции

#КонецОбласти