#Область ОписаниеПеременных

&НаКлиенте
Перем мСоответствиеСимволовТокенам; 

&НаКлиенте
Перем мСоответствиеЛексемТокенам; 

&НаКлиенте
Перем мВидыТокенов;

&НаКлиенте
Перем мВидыЛексем;

&НаКлиенте
Перем мБуквыЦифры;

#КонецОбласти 

#Область ОбработчикиСобытийФормы
 
&НаКлиенте
Процедура Инициализировать() Экспорт 
	мВидыТокенов = Новый Структура;
	мСоответствиеСимволовТокенам = Новый Соответствие;  
	мБуквыЦифры = Новый Соответствие;
	мСоответствиеЛексемТокенам = Новый Структура;
	
	ВидыТокенов = СтрРазделить(
		"Запятая
		|Точка
		|ТочкаСЗапятой
		|Двоеточие   
		|Собачка
		|ВертикальнаяЧерта
		|Минус
		|Цифра
		|Буква
		|Число
		|Строка
		|СкобкаКруглаяЛевая
		|СкобкаКруглаяПравая
		|Решетка
		|Плюс
		|Равно
		|Амперсанд
		|Слеш
		|УгловаяСкобкаЛевая
		|УгловаяСкобкаПравая
		|ФигурнаяСкобкаЛевая
		|ФигурнаяСкобкаПравая
		|Кавычка
		|ДвойнаяКавычка
		|Пробел
		|Табуляция
		|ПереносСтроки
		|НаборРешеток
		|НаборТире", Символы.ПС); 
	
	Для Каждого Токен Из ВидыТокенов Цикл
		мВидыТокенов.Вставить(Токен, СокрЛП(Токен));
	КонецЦикла; 

	ВидыЛексем = СтрРазделить(
		"НоваяГруппа
		|Группа
		|Страница
		|Заголовок", Символы.ПС); 
	
	Для Каждого Лексема Из ВидыЛексем Цикл
		мВидыЛексем.Вставить(Лексема, СокрЛП(Лексема));
	КонецЦикла; 
	
	мСоответствиеСимволовТокенам.Вставить(",", мВидыТокенов.Запятая);
	мСоответствиеСимволовТокенам.Вставить(".", мВидыТокенов.Точка);
	мСоответствиеСимволовТокенам.Вставить(":", мВидыТокенов.Двоеточие);
	мСоответствиеСимволовТокенам.Вставить("|", мВидыТокенов.ВертикальнаяЧерта);
	мСоответствиеСимволовТокенам.Вставить("@", мВидыТокенов.Собачка);
	мСоответствиеСимволовТокенам.Вставить(";", мВидыТокенов.ТочкаСЗапятой);
	мСоответствиеСимволовТокенам.Вставить("-", мВидыТокенов.Минус); 
	мСоответствиеСимволовТокенам.Вставить("(", мВидыТокенов.СкобкаКруглаяЛевая); 
	мСоответствиеСимволовТокенам.Вставить(")", мВидыТокенов.СкобкаКруглаяПравая); 
	мСоответствиеСимволовТокенам.Вставить("#", мВидыТокенов.Решетка); 
	мСоответствиеСимволовТокенам.Вставить("+", мВидыТокенов.Плюс); 
	мСоответствиеСимволовТокенам.Вставить("@", мВидыТокенов.Амперсанд); 
	мСоответствиеСимволовТокенам.Вставить("/", мВидыТокенов.Слеш); 
	мСоответствиеСимволовТокенам.Вставить("=", мВидыТокенов.Равно); 
	мСоответствиеСимволовТокенам.Вставить("<", мВидыТокенов.УгловаяСкобкаЛевая); 
	мСоответствиеСимволовТокенам.Вставить(">", мВидыТокенов.УгловаяСкобкаПравая); 
	мСоответствиеСимволовТокенам.Вставить("{", мВидыТокенов.ФигурнаяСкобкаЛевая); 
	мСоответствиеСимволовТокенам.Вставить("}", мВидыТокенов.ФигурнаяСкобкаПравая); 
	мСоответствиеСимволовТокенам.Вставить("'", мВидыТокенов.Кавычка); 
	мСоответствиеСимволовТокенам.Вставить("""", мВидыТокенов.ДвойнаяКавычка); 
	мСоответствиеСимволовТокенам.Вставить(" ", мВидыТокенов.Пробел); 
	
	мСоответствиеСимволовТокенам.Вставить(Символы.НПП, мВидыТокенов.Пробел); 
	мСоответствиеСимволовТокенам.Вставить(Символы.ПС, мВидыТокенов.ПереносСтроки); 
	мСоответствиеСимволовТокенам.Вставить(Символы.Таб, мВидыТокенов.Табуляция); 
	
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Цифра, "0", "9");
	
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Буква, "A", "Z");
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Буква, "a", "z");
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Буква, "А", "я");
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Буква, "Ё", "Ё");
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Буква, "ё", "ё");
	ДобавитьВидыТокенов(мСоответствиеСимволовТокенам, мБуквыЦифры, мВидыТокенов.Буква, "_", "_");  
	//
	//мСоответствиеЛексемТокенам.Вставить("#", мВидыЛексем.НоваяГруппа);
	//мСоответствиеЛексемТокенам.Вставить("+", мВидыЛексем.Группа);
	//мСоответствиеЛексемТокенам.Вставить("/", мВидыЛексем.Страница);
	//мСоответствиеЛексемТокенам.Вставить("---", мВидыЛексем.Заголовок);
КонецПроцедуры

&НаКлиенте
Функция Лексема(ИмяПараметра) Экспорт
	СтруктураПараметры = Новый Структура;  
	СтруктураПараметры.Вставить("ФормаЗаголовок", "---");
	
	СтруктураПараметры.Вставить("РазделительГруппаДобавить", "#");
	СтруктураПараметры.Вставить("РазделительГруппа", "+");
	СтруктураПараметры.Вставить("РазделительГруппаОднострочная", "&");
	СтруктураПараметры.Вставить("Уровень", ".");
	СтруктураПараметры.Вставить("КоманднаяПанельНачало", "<");
	СтруктураПараметры.Вставить("КоманднаяПанельКонец", ">");
	СтруктураПараметры.Вставить("КоманднаяПанельРазделительМеню", "-");
	СтруктураПараметры.Вставить("КоманднаяПанельРазделительКнопок", "|");
	СтруктураПараметры.Вставить("ТаблицаРазделитель", "|");
	СтруктураПараметры.Вставить("Картинка", "@");
	СтруктураПараметры.Вставить("ТаблицаКолонкаГруппа", "-");
	СтруктураПараметры.Вставить("ПолеВводаРазделитель", ":");
	СтруктураПараметры.Вставить("СтраницаРазделитель", "/");
	
	СтруктураПараметры.Вставить("ФлажокРазделительГрупп", "|");
	СтруктураПараметры.Вставить("ФлажокНачало", "[");
	СтруктураПараметры.Вставить("ФлажокКонец", "]");

	Возврат СтруктураПараметры[ИмяПараметра];
КонецФункции

&НаКлиенте
Функция ТокенПоСимволу(Символ) Экспорт
	Возврат мСоответствиеСимволовТокенам.Получить(Символ);	
КонецФункции

&НаКлиенте
Функция Токены() Экспорт
	Возврат мВидыТокенов;	
КонецФункции

&НаКлиенте
Функция Лексемы() Экспорт
	Возврат мВидыЛексем;	
КонецФункции

&НаКлиенте
Функция ЭтоБукваЦифра(Символ) Экспорт
	Возврат мБуквыЦифры.Получить(Символ) <> Неопределено;
КонецФункции

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьВидыТокенов(Соответствие, Соответствие2, Токен, СимволНачало, СимволКонец)
	Для Код = КодСимвола(СимволНачало) По КодСимвола(СимволКонец) Цикл
		Соответствие.Вставить(Символ(Код), Токен);
		Соответствие2.Вставить(Символ(Код), Токен);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти