// Элементы

Элемент_Страницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
Элемент_Страницы.Вид = ВидГруппыФормы.Страницы;
Элемент_Страницы.РастягиватьПоГоризонтали = Истина;
Элемент_Страницы.РастягиватьПоВертикали = Ложь;

Элемент_Страница = Элементы.Добавить("Страница", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Страница.Вид = ВидГруппыФормы.Страница;
Элемент_Страница.Заголовок = "Страница";

Элемент_Надпись = Элементы.Добавить("Надпись", Тип("ДекорацияФормы"), Элемент_Страница);
Элемент_Надпись.Вид = ВидДекорацииФормы.Надпись;
Элемент_Надпись.Заголовок = "Элемент 1";