// Элементы

Элемент_Страницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
Элемент_Страницы.Вид = ВидГруппыФормы.Страницы;
Элемент_Страницы.РастягиватьПоГоризонтали = Истина;
Элемент_Страницы.РастягиватьПоВертикали = Ложь;

Элемент_Страница = Элементы.Добавить("Страница", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Страница.Вид = ВидГруппыФормы.Страница;
Элемент_Страница.Заголовок = "Страница";

Элемент_Элемент1 = Элементы.Добавить("Элемент1", Тип("ДекорацияФормы"), Элемент_Страница);
Элемент_Элемент1.Вид = ВидДекорацииФормы.Надпись;
Элемент_Элемент1.Заголовок = "Элемент 1";