// Реквизиты

ДобавляемыеРеквизиты = Новый Массив;

ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Таблица", Новый ОписаниеТипов("ТаблицаЗначений")));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Список", Новый ОписаниеТипов("Строка"), "Таблица"));

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

// Элементы

Элемент_Таблица = Элементы.Добавить("Таблица", Тип("ТаблицаФормы"));
Элемент_Таблица.ПутьКДанным = "Таблица";
Элемент_Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

Элемент_ТаблицаСписок = Элементы.Добавить("ТаблицаСписок", Тип("ПолеФормы"), Элемент_Таблица);
Элемент_ТаблицаСписок.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаСписок.ПутьКДанным = "Таблица.Список";
Элемент_ТаблицаСписок.Заголовок = "Список";