// Элементы

Элемент_Группа1 = Элементы.Добавить("Группа1", Тип("ГруппаФормы"));
Элемент_Группа1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа1.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа1.ОтображатьЗаголовок = Ложь;
Элемент_Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
Элемент_Группа1.РастягиватьПоГоризонтали = Истина;
Элемент_Группа1.РастягиватьПоВертикали = Ложь;

Элемент_Надпись = Элементы.Добавить("Надпись", Тип("ДекорацияФормы"), Элемент_Группа1);
Элемент_Надпись.Вид = ВидДекорацииФормы.Надпись;
Элемент_Надпись.Заголовок = "Элемент группы 1";

Элемент_Надпись1 = Элементы.Добавить("Надпись1", Тип("ДекорацияФормы"), Элемент_Группа1);
Элемент_Надпись1.Вид = ВидДекорацииФормы.Надпись;
Элемент_Надпись1.Заголовок = "Элемент группы 2";