// Элементы

Элемент_Страницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
Элемент_Страницы.Вид = ВидГруппыФормы.Страницы;
Элемент_Страницы.РастягиватьПоГоризонтали = Истина;
Элемент_Страницы.РастягиватьПоВертикали = Ложь;

Элемент_Страница1 = Элементы.Добавить("Страница1", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Страница1.Вид = ВидГруппыФормы.Страница;
Элемент_Страница1.Заголовок = "Страница 1";

Элемент_Элемент1 = Элементы.Добавить("Элемент1", Тип("ДекорацияФормы"), Элемент_Страница1);
Элемент_Элемент1.Вид = ВидДекорацииФормы.Надпись;
Элемент_Элемент1.Заголовок = "Элемент 1";

Элемент_Страница2 = Элементы.Добавить("Страница2", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Страница2.Вид = ВидГруппыФормы.Страница;
Элемент_Страница2.Заголовок = "Страница 2";

Элемент_Элемент2 = Элементы.Добавить("Элемент2", Тип("ДекорацияФормы"), Элемент_Страница2);
Элемент_Элемент2.Вид = ВидДекорацииФормы.Надпись;
Элемент_Элемент2.Заголовок = "Элемент 2";