// Элементы

Элемент_КоманднаяПанель = Элементы.Добавить("КоманднаяПанель", Тип("ГруппаФормы"));
Элемент_КоманднаяПанель.Вид = ВидГруппыФормы.КоманднаяПанель;
Элемент_КоманднаяПанель.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
Элемент_КоманднаяПанель.РастягиватьПоГоризонтали = Ложь;

Элемент_Кнопка1 = Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), Элемент_КоманднаяПанель);
Элемент_Кнопка1.ИмяКоманды = "__КомандаЗаглушка";
Элемент_Кнопка1.Заголовок = "Кнопка 1";
<<<<<<< HEAD
=======
Элемент_Кнопка1.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево;
Элемент_Кнопка1.Отображение = ОтображениеКнопки.КартинкаИТекст;
>>>>>>> upstream/develop

Элемент_Меню = Элементы.Добавить("Меню", Тип("ГруппаФормы"), Элемент_КоманднаяПанель);
Элемент_Меню.Вид = ВидГруппыФормы.Подменю;
Элемент_Меню.Заголовок = "Меню";
<<<<<<< HEAD

Элемент_Подменю = Элементы.Добавить("Подменю", Тип("КнопкаФормы"), Элемент_Меню);
Элемент_Подменю.ИмяКоманды = "__КомандаЗаглушка";
Элемент_Подменю.Заголовок = "Подменю";
=======
Элемент_Меню.Отображение = ОтображениеКнопки.КартинкаИТекст;

Элемент_Подменю = Элементы.Добавить("Подменю", Тип("КнопкаФормы"), Элемент_Меню);
Элемент_Подменю.ИмяКоманды = "__КомандаЗаглушка";
Элемент_Подменю.Заголовок = "Подменю";
Элемент_Подменю.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево;
Элемент_Подменю.Отображение = ОтображениеКнопки.КартинкаИТекст;
>>>>>>> upstream/develop
