// Элементы

Элемент_Группа = Элементы.Добавить("Группа", Тип("ГруппаФормы"));
Элемент_Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа.ОтображатьЗаголовок = Ложь;
Элемент_Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
Элемент_Группа.РастягиватьПоГоризонтали = Истина;
Элемент_Группа.РастягиватьПоВертикали = Ложь;

Элемент_Группа1 = Элементы.Добавить("Группа1", Тип("ГруппаФормы"), Элемент_Группа);
Элемент_Группа1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа1.Заголовок = "Группа 1";
Элемент_Группа1.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Группа1.РастягиватьПоГоризонтали = Истина;
Элемент_Группа1.РастягиватьПоВертикали = Ложь;

Элемент_ЭлементГруппы1 = Элементы.Добавить("ЭлементГруппы1", Тип("ДекорацияФормы"), Элемент_Группа1);
Элемент_ЭлементГруппы1.Вид = ВидДекорацииФормы.Надпись;
Элемент_ЭлементГруппы1.Заголовок = "Элемент группы 1";

Элемент_Группа2 = Элементы.Добавить("Группа2", Тип("ГруппаФормы"), Элемент_Группа);
Элемент_Группа2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа2.Заголовок = "Группа 2";
Элемент_Группа2.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Группа2.РастягиватьПоГоризонтали = Истина;
Элемент_Группа2.РастягиватьПоВертикали = Ложь;

Элемент_ЭлементГруппы2 = Элементы.Добавить("ЭлементГруппы2", Тип("ДекорацияФормы"), Элемент_Группа2);
Элемент_ЭлементГруппы2.Вид = ВидДекорацииФормы.Надпись;
Элемент_ЭлементГруппы2.Заголовок = "Элемент группы 2";