// Элементы

Элемент_Группа = Элементы.Добавить("Группа", Тип("ГруппаФормы"));
Элемент_Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа.ОтображатьЗаголовок = Ложь;
Элемент_Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
Элемент_Группа.РастягиватьПоГоризонтали = Истина;
Элемент_Группа.РастягиватьПоВертикали = Ложь;

Элемент_Заголовок1 = Элементы.Добавить("Заголовок1", Тип("ГруппаФормы"), Элемент_Группа);
Элемент_Заголовок1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Заголовок1.Заголовок = "Заголовок 1";
Элемент_Заголовок1.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Заголовок1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Заголовок1.РастягиватьПоГоризонтали = Истина;
Элемент_Заголовок1.РастягиватьПоВертикали = Ложь;

Элемент_Страницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"), Элемент_Заголовок1);
Элемент_Страницы.Вид = ВидГруппыФормы.Страницы;
Элемент_Страницы.РастягиватьПоГоризонтали = Истина;
Элемент_Страницы.РастягиватьПоВертикали = Ложь;

Элемент_Страница1 = Элементы.Добавить("Страница1", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Страница1.Вид = ВидГруппыФормы.Страница;
Элемент_Страница1.Заголовок = "Страница 1";

Элемент_ЭлементНаСтранице1 = Элементы.Добавить("ЭлементНаСтранице1", Тип("ДекорацияФормы"), Элемент_Страница1);
Элемент_ЭлементНаСтранице1.Вид = ВидДекорацииФормы.Надпись;
Элемент_ЭлементНаСтранице1.Заголовок = "Элемент на странице 1";

Элемент_Заголовок2 = Элементы.Добавить("Заголовок2", Тип("ГруппаФормы"), Элемент_Группа);
Элемент_Заголовок2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Заголовок2.Заголовок = "Заголовок 2";
Элемент_Заголовок2.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Заголовок2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Заголовок2.РастягиватьПоГоризонтали = Истина;
Элемент_Заголовок2.РастягиватьПоВертикали = Ложь;

Элемент_Страницы1 = Элементы.Добавить("Страницы1", Тип("ГруппаФормы"), Элемент_Заголовок2);
Элемент_Страницы1.Вид = ВидГруппыФормы.Страницы;
Элемент_Страницы1.РастягиватьПоГоризонтали = Истина;
Элемент_Страницы1.РастягиватьПоВертикали = Ложь;

Элемент_Страница2 = Элементы.Добавить("Страница2", Тип("ГруппаФормы"), Элемент_Страницы1);
Элемент_Страница2.Вид = ВидГруппыФормы.Страница;
Элемент_Страница2.Заголовок = "Страница 2";

Элемент_ЭлементНаСтранице2 = Элементы.Добавить("ЭлементНаСтранице2", Тип("ДекорацияФормы"), Элемент_Страница2);
Элемент_ЭлементНаСтранице2.Вид = ВидДекорацииФормы.Надпись;
Элемент_ЭлементНаСтранице2.Заголовок = "Элемент на странице 2";