// Реквизиты

ДобавляемыеРеквизиты = Новый Массив;

ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Таблица", Новый ОписаниеТипов("ТаблицаЗначений")));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка", Новый ОписаниеТипов("Строка"), "Таблица"));

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

// Элементы

Элемент_Таблица = Элементы.Добавить("Таблица", Тип("ТаблицаФормы"));
Элемент_Таблица.ПутьКДанным = "Таблица";
Элемент_Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

Элемент_ТаблицаКолонка = Элементы.Добавить("ТаблицаКолонка", Тип("ПолеФормы"), Элемент_Таблица);
Элемент_ТаблицаКолонка.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаКолонка.ПутьКДанным = "Таблица.Колонка";
Элемент_ТаблицаКолонка.ОтображатьЗаголовок = Ложь;