// Реквизиты

ДобавляемыеРеквизиты = Новый Массив;

ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Таблица", Новый ОписаниеТипов("ТаблицаЗначений")));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка1", Новый ОписаниеТипов("Строка"), "Таблица"));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Подколонка11", Новый ОписаниеТипов("Строка"), "Таблица"));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Подколонка12", Новый ОписаниеТипов("Строка"), "Таблица"));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка2", Новый ОписаниеТипов("Строка"), "Таблица"));

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

// Элементы

Элемент_Таблица = Элементы.Добавить("Таблица", Тип("ТаблицаФормы"));
Элемент_Таблица.ПутьКДанным = "Таблица";
Элемент_Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

Элемент_ГруппаВертикальнаяКолонка1 = Элементы.Добавить("ГруппаВертикальнаяКолонка1", Тип("ГруппаФормы"), Элемент_Таблица);
Элемент_ГруппаВертикальнаяКолонка1.Вид = ВидГруппыФормы.ГруппаКолонок;
Элемент_ГруппаВертикальнаяКолонка1.Группировка = ГруппировкаКолонок.Вертикальная;

Элемент_ТаблицаКолонка1 = Элементы.Добавить("ТаблицаКолонка1", Тип("ПолеФормы"), Элемент_ГруппаВертикальнаяКолонка1);
Элемент_ТаблицаКолонка1.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаКолонка1.ПутьКДанным = "Таблица.Колонка1";
Элемент_ТаблицаКолонка1.Заголовок = "Колонка 1";

Элемент_ГруппаГоризонтальнаяКолонка1 = Элементы.Добавить("ГруппаГоризонтальнаяКолонка1", Тип("ГруппаФормы"), Элемент_ГруппаВертикальнаяКолонка1);
Элемент_ГруппаГоризонтальнаяКолонка1.Вид = ВидГруппыФормы.ГруппаКолонок;
Элемент_ГруппаГоризонтальнаяКолонка1.Группировка = ГруппировкаКолонок.Горизонтальная;

Элемент_ТаблицаПодколонка11 = Элементы.Добавить("ТаблицаПодколонка11", Тип("ПолеФормы"), Элемент_ГруппаГоризонтальнаяКолонка1);
Элемент_ТаблицаПодколонка11.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаПодколонка11.ПутьКДанным = "Таблица.Подколонка11";
Элемент_ТаблицаПодколонка11.Заголовок = "Подколонка 1.1";

Элемент_ТаблицаПодколонка12 = Элементы.Добавить("ТаблицаПодколонка12", Тип("ПолеФормы"), Элемент_ГруппаГоризонтальнаяКолонка1);
Элемент_ТаблицаПодколонка12.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаПодколонка12.ПутьКДанным = "Таблица.Подколонка12";
Элемент_ТаблицаПодколонка12.Заголовок = "Подколонка 1.2";

Элемент_ТаблицаКолонка2 = Элементы.Добавить("ТаблицаКолонка2", Тип("ПолеФормы"), Элемент_Таблица);
Элемент_ТаблицаКолонка2.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаКолонка2.ПутьКДанным = "Таблица.Колонка2";
Элемент_ТаблицаКолонка2.Заголовок = "Колонка 2";