// Реквизиты

ДобавляемыеРеквизиты = Новый Массив;

ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Поле", Новый ОписаниеТипов("Число,Строка,Булево,Дата", Новый КвалификаторыЧисла(15, 2), Новый КвалификаторыСтроки(100), Новый КвалификаторыДаты(ЧастиДаты.Время))));

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

// Элементы

Элемент_Поле = Элементы.Добавить("Поле", Тип("ПолеФормы"));
Элемент_Поле.ПутьКДанным = "Поле";
Элемент_Поле.Вид = ВидПоляФормы.ПолеВвода;
Элемент_Поле.АвтоМаксимальнаяШирина = Ложь;
Элемент_Поле.Заголовок = "Поле";
Элемент_Поле.РастягиватьПоГоризонтали = Истина;