// Элементы

Элемент_КоманднаяПанель = Элементы.Добавить("КоманднаяПанель", Тип("ГруппаФормы"));
Элемент_КоманднаяПанель.Вид = ВидГруппыФормы.КоманднаяПанель;
Элемент_КоманднаяПанель.РастягиватьПоГоризонтали = Ложь;

Элемент_Кнопка1 = Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), Элемент_КоманднаяПанель);
Элемент_Кнопка1.ИмяКоманды = "КомандаЗаглушка";
Элемент_Кнопка1.Заголовок = "Кнопка 1";
Элемент_Кнопка1.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;

Элемент_Меню = Элементы.Добавить("Меню", Тип("ГруппаФормы"), Элемент_КоманднаяПанель);
Элемент_Меню.Вид = ВидГруппыФормы.Подменю;
Элемент_Меню.Заголовок = "Меню";

Элемент_Подменю = Элементы.Добавить("Подменю", Тип("КнопкаФормы"), Элемент_Меню);
Элемент_Подменю.ИмяКоманды = "КомандаЗаглушка";
Элемент_Подменю.Заголовок = "Подменю";
Элемент_Подменю.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;