// Элементы

Элемент_КоманднаяПанель = Элементы.Добавить("КоманднаяПанель", Тип("ГруппаФормы"));
Элемент_КоманднаяПанель.Вид = ВидГруппыФормы.КоманднаяПанель;
Элемент_КоманднаяПанель.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
Элемент_КоманднаяПанель.РастягиватьПоГоризонтали = Ложь;

Элемент_Кнопка1 = Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), Элемент_КоманднаяПанель);
Элемент_Кнопка1.ИмяКоманды = "__КомандаЗаглушка";
Элемент_Кнопка1.Заголовок = "Кнопка 1";

Элемент_Кнопка2 = Элементы.Добавить("Кнопка2", Тип("КнопкаФормы"), Элемент_КоманднаяПанель);
Элемент_Кнопка2.ИмяКоманды = "__КомандаЗаглушка";
Элемент_Кнопка2.Заголовок = "Кнопка 2";