// Реквизиты

ДобавляемыеРеквизиты = Новый Массив;

ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Таблица", Новый ОписаниеТипов("ТаблицаЗначений")));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка1", Новый ОписаниеТипов("Строка"), "Таблица"));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка2", Новый ОписаниеТипов("Строка"), "Таблица"));

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

// Элементы

Элемент_Таблица = Элементы.Добавить("Таблица", Тип("ТаблицаФормы"));
Элемент_Таблица.ПутьКДанным = "Таблица";
Элемент_Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

Элемент_ТаблицаКолонка1 = Элементы.Добавить("ТаблицаКолонка1", Тип("ПолеФормы"), Элемент_Таблица);
Элемент_ТаблицаКолонка1.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаКолонка1.ПутьКДанным = "Таблица.Колонка1";
Элемент_ТаблицаКолонка1.Заголовок = "Колонка 1";

Элемент_ТаблицаКолонка2 = Элементы.Добавить("ТаблицаКолонка2", Тип("ПолеФормы"), Элемент_Таблица);
Элемент_ТаблицаКолонка2.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаКолонка2.ПутьКДанным = "Таблица.Колонка2";
Элемент_ТаблицаКолонка2.Заголовок = "Колонка 2";