// Элементы

Элемент_Группа1 = Элементы.Добавить("Группа1", Тип("ГруппаФормы"));
Элемент_Группа1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа1.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа1.ОтображатьЗаголовок = Ложь;
Элемент_Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
Элемент_Группа1.РастягиватьПоГоризонтали = Истина;
Элемент_Группа1.РастягиватьПоВертикали = Ложь;

Элемент_Группа2 = Элементы.Добавить("Группа2", Тип("ГруппаФормы"), Элемент_Группа1);
Элемент_Группа2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа2.Заголовок = "";
Элемент_Группа2.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа2.ОтображатьЗаголовок = Ложь;
Элемент_Группа2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Группа2.РастягиватьПоГоризонтали = Истина;
Элемент_Группа2.РастягиватьПоВертикали = Ложь;

Элемент_Надпись = Элементы.Добавить("Надпись", Тип("ДекорацияФормы"), Элемент_Группа2);
Элемент_Надпись.Вид = ВидДекорацииФормы.Надпись;
Элемент_Надпись.Заголовок = "Элемент группы 1";

Элемент_Группа3 = Элементы.Добавить("Группа3", Тип("ГруппаФормы"), Элемент_Группа1);
Элемент_Группа3.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа3.Заголовок = "";
Элемент_Группа3.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа3.ОтображатьЗаголовок = Ложь;
Элемент_Группа3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Группа3.РастягиватьПоГоризонтали = Истина;
Элемент_Группа3.РастягиватьПоВертикали = Ложь;

Элемент_Надпись1 = Элементы.Добавить("Надпись1", Тип("ДекорацияФормы"), Элемент_Группа3);
Элемент_Надпись1.Вид = ВидДекорацииФормы.Надпись;
Элемент_Надпись1.Заголовок = "Элемент группы 2";