// Элементы

Элемент_Страницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
Элемент_Страницы.Вид = ВидГруппыФормы.Страницы;
Элемент_Страницы.РастягиватьПоГоризонтали = Истина;
Элемент_Страницы.РастягиватьПоВертикали = Ложь;

Элемент_Вкладка1 = Элементы.Добавить("Вкладка1", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Вкладка1.Вид = ВидГруппыФормы.Страница;
Элемент_Вкладка1.Заголовок = "Вкладка 1";

Элемент_Группа = Элементы.Добавить("Группа", Тип("ГруппаФормы"), Элемент_Вкладка1);
Элемент_Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа.ОтображатьЗаголовок = Ложь;
Элемент_Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
Элемент_Группа.РастягиватьПоГоризонтали = Истина;
Элемент_Группа.РастягиватьПоВертикали = Ложь;

Элемент_Группа1 = Элементы.Добавить("Группа1", Тип("ГруппаФормы"), Элемент_Группа);
Элемент_Группа1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа1.Заголовок = "Группа 1";
Элемент_Группа1.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Группа1.РастягиватьПоГоризонтали = Истина;
Элемент_Группа1.РастягиватьПоВертикали = Ложь;

Элемент_Реквизит1 = Элементы.Добавить("Реквизит1", Тип("ДекорацияФормы"), Элемент_Группа1);
Элемент_Реквизит1.Вид = ВидДекорацииФормы.Надпись;
Элемент_Реквизит1.Заголовок = "Реквизит 1";

Элемент_Группа2 = Элементы.Добавить("Группа2", Тип("ГруппаФормы"), Элемент_Группа);
Элемент_Группа2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа2.Заголовок = "Группа2";
Элемент_Группа2.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
Элемент_Группа2.РастягиватьПоГоризонтали = Истина;
Элемент_Группа2.РастягиватьПоВертикали = Ложь;

Элемент_Реквизит2 = Элементы.Добавить("Реквизит2", Тип("ДекорацияФормы"), Элемент_Группа2);
Элемент_Реквизит2.Вид = ВидДекорацииФормы.Надпись;
Элемент_Реквизит2.Заголовок = "Реквизит2";

Элемент_Вкладка2 = Элементы.Добавить("Вкладка2", Тип("ГруппаФормы"), Элемент_Страницы);
Элемент_Вкладка2.Вид = ВидГруппыФормы.Страница;
Элемент_Вкладка2.Заголовок = "Вкладка 2";

Элемент_ПростоТекст = Элементы.Добавить("ПростоТекст", Тип("ДекорацияФормы"), Элемент_Вкладка2);
Элемент_ПростоТекст.Вид = ВидДекорацииФормы.Надпись;
Элемент_ПростоТекст.Заголовок = "Просто текст";