// Элементы

Элемент_Группа = Элементы.Добавить("Группа", Тип("ГруппаФормы"));
Элемент_Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
Элемент_Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
Элемент_Группа.ОтображатьЗаголовок = Ложь;
Элемент_Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
Элемент_Группа.РастягиватьПоГоризонтали = Истина;
Элемент_Группа.РастягиватьПоВертикали = Ложь;

Элемент_ЭлементГруппы1 = Элементы.Добавить("ЭлементГруппы1", Тип("ДекорацияФормы"), Элемент_Группа);
Элемент_ЭлементГруппы1.Вид = ВидДекорацииФормы.Надпись;
Элемент_ЭлементГруппы1.Заголовок = "Элемент группы 1";

Элемент_ЭлементГруппы2 = Элементы.Добавить("ЭлементГруппы2", Тип("ДекорацияФормы"), Элемент_Группа);
Элемент_ЭлементГруппы2.Вид = ВидДекорацииФормы.Надпись;
Элемент_ЭлементГруппы2.Заголовок = "Элемент группы 2";