// Реквизиты

ДобавляемыеРеквизиты = Новый Массив;

ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Таблица", Новый ОписаниеТипов("ТаблицаЗначений")));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ФлажокКолонка1", Новый ОписаниеТипов("Булево"), "Таблица"));
ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка1", Новый ОписаниеТипов("Строка"), "Таблица"));

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

// Элементы

Элемент_Таблица = Элементы.Добавить("Таблица", Тип("ТаблицаФормы"));
Элемент_Таблица.ПутьКДанным = "Таблица";
Элемент_Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

Элемент_ГруппаВместеКолонка1 = Элементы.Добавить("ГруппаВместеКолонка1", Тип("ГруппаФормы"), Элемент_Таблица);
Элемент_ГруппаВместеКолонка1.Вид = ВидГруппыФормы.ГруппаКолонок;
Элемент_ГруппаВместеКолонка1.Группировка = ГруппировкаКолонок.ВЯчейке;
Элемент_ГруппаВместеКолонка1.Заголовок = "Колонка 1";
Элемент_ГруппаВместеКолонка1.ОтображатьВШапке = Истина;

Элемент_ТаблицаФлажокКолонка1 = Элементы.Добавить("ТаблицаФлажокКолонка1", Тип("ПолеФормы"), Элемент_ГруппаВместеКолонка1);
Элемент_ТаблицаФлажокКолонка1.Вид = ВидПоляФормы.ПолеФлажка;
Элемент_ТаблицаФлажокКолонка1.ПутьКДанным = "Таблица.ФлажокКолонка1";
Элемент_ТаблицаФлажокКолонка1.ОтображатьВШапке = Ложь;
Элемент_ТаблицаФлажокКолонка1.Заголовок = "Колонка 1";

Элемент_ТаблицаКолонка1 = Элементы.Добавить("ТаблицаКолонка1", Тип("ПолеФормы"), Элемент_ГруппаВместеКолонка1);
Элемент_ТаблицаКолонка1.Вид = ВидПоляФормы.ПолеВвода;
Элемент_ТаблицаКолонка1.ПутьКДанным = "Таблица.Колонка1";
Элемент_ТаблицаКолонка1.Заголовок = "Колонка 1";
Элемент_ТаблицаКолонка1.ОтображатьВШапке = Ложь;