ОсновнойОбъект = ПолучитьОсновнойОбъект();

// ПриОпределенииНастроекПечати
ОбщийМодуль = ПолучитьМодуль(ТипыМодулей().ОбщийМодуль, "УправлениеПечатьюПереопределяемый");

Метод = СоздатьПолучитьМетод(
		ОбщийМодуль,
		ПолучитьПрефиксРасширения() + "ПриОпределенииНастроекПечати",
		"ПрограммныйИнтерфейс",
		Ложь);
Если НЕ Метод.Существует Тогда
	Если ВыгружатьВРасширение Тогда
		Метод.Содержимое.Аннотация = "После";
		Метод.Содержимое.Экспортная = Истина;
		Метод.Содержимое.ИмяРасширяемогоМетода = "ПриОпределенииНастроекПечати";
		ДобавитьПараметрВМетод(Метод, "Отказ");
	Иначе
		ВызватьИсключение("Метод ПриОпределенииНастроекПечати не найден");
	КонецЕсли;
КонецЕсли;

ОписаниеРаздела = ПолучитьРазделМетаданныхПоИмени(ОсновнойОбъект.Тип);

ДобавитьКТелуМетода(Метод,
	СтрШаблон("Настройки.ОбъектыПечати.Добавить(%1.%2);", ОписаниеРаздела.ИмяМнож, ОсновнойОбъект.Имя));

МодульМенеджера = ПолучитьМодуль(ТипыМодулей().МодульМенеджера, ОсновнойОбъект);

// ПриОпределенииНастроекПечати
Метод = СоздатьПолучитьМетод(МодульМенеджера, ПолучитьПрефиксРасширения() + "ПриОпределенииНастроекПечати", "ПрограммныйИнтерфейс", Ложь);
Если НЕ Метод.Существует Тогда
	Если ВыгружатьВРасширение Тогда
		Метод.Содержимое.Аннотация = "После";
		Метод.Содержимое.ИмяРасширяемогоМетода = "ПриОпределенииНастроекПечати";
	КонецЕсли;
	Метод.Содержимое.Экспортная = Истина;
	Метод.Содержимое.Комментарий =
		"Переопределяет настройки печати для объекта.
		|
		|Параметры:
		|  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
		|";
	ДобавитьПараметрВМетод(Метод, "Настройки");
КонецЕсли;
ДобавитьКТелуМетода(Метод, "Настройки.ПриДобавленииКомандПечати = Истина;");

// ДобавитьКомандыПечати
Метод = СоздатьПолучитьМетод(МодульМенеджера, ПолучитьПрефиксРасширения() + "ДобавитьКомандыПечати", "ПрограммныйИнтерфейс", Ложь);
Если НЕ Метод.Существует Тогда
	Если ВыгружатьВРасширение Тогда
		Метод.Содержимое.Аннотация = "После";
		Метод.Содержимое.ИмяРасширяемогоМетода = "ДобавитьКомандыПечати";
	КонецЕсли;
	
	Метод.Содержимое.Экспортная = Истина;
	Метод.Содержимое.Комментарий =
		"Заполняет список команд печати.
		|
		|Параметры:
		|  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
		|";
	ДобавитьПараметрВМетод(Метод, "КомандыПечати");
КонецЕсли;