ОсновнойОбъект = ПолучитьОсновнойОбъект();

// ПриОпределенииНастроекПечати
ОбщийМодуль = ПолучитьМодуль(ТипыМодулей().ОбщийМодуль, "УправлениеПечатьюПереопределяемый");

Метод = СоздатьПолучитьМетод(ОбщийМодуль, "ПриОпределенииНастроекПечати", "ПрограммныйИнтерфейс", Ложь);
Если НЕ Метод.Существует Тогда
	ВызватьИсключение("Метод ПриОпределенииНастроекПечати не найден");
КонецЕсли;

ОписаниеРаздела = ПолучитьРазделМетаданныхПоИмени(ОсновнойОбъект.Тип);

ДобавитьКТелуМетода(Метод,
	СтрШаблон("Настройки.ОбъектыПечати.Добавить(%1.%2);", ОписаниеРаздела.ИмяМнож, ОсновнойОбъект.Имя));

МодульМенеджера = ПолучитьМодуль(ТипыМодулей().МодульМенеджера, ОсновнойОбъект);

// ПриОпределенииНастроекПечати
Метод = СоздатьПолучитьМетод(МодульМенеджера, "ПриОпределенииНастроекПечати", "ПрограммныйИнтерфейс", Ложь);
Если НЕ Метод.Существует Тогда
	Метод.Содержимое.Экспортная = Истина;
	Метод.Содержимое.Комментарий =
		"Переопределяет настройки печати для объекта.
		|
		|Параметры:
		|  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
		|";
	ДобавитьПараметрВМетод(Метод, "Настройки");
КонецЕсли;
ДобавитьКТелуМетода(Метод, "Настройки.ПриДобавленииКомандПечати = Истина;");

// ДобавитьКомандыПечати
Метод = СоздатьПолучитьМетод(МодульМенеджера, "ДобавитьКомандыПечати", "ПрограммныйИнтерфейс", Ложь);
Если НЕ Метод.Существует Тогда
	Метод.Содержимое.Экспортная = Истина;
	Метод.Содержимое.Комментарий =
		"Заполняет список команд печати.
		|
		|Параметры:
		|  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
		|";
	ДобавитьПараметрВМетод(Метод, "КомандыПечати");
КонецЕсли;