ПолноеИмяФормы = "Справочник.Контрагенты.Форма";

// ПриСозданииНаСервере
ОписаниеПроцедуры = ПолучитьПроцедуруФункцию(ПолноеИмяФормы, "ПриСозданииНаСервере");
ОписаниеПроцедуры.Имя = "ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)";
ОписаниеПроцедуры.Область = "ОбработчикиСобытийФормы";
ОписаниеПроцедуры.Префикс = "&НаСервере";
ОписаниеПроцедуры.Тело = ОписаниеПроцедуры.Тело
	+ "// СтандартныеПодсистемы.ПодключаемыеКоманды
	|ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	|// Конец СтандартныеПодсистемы.ПодключаемыеКоманды";
ОбновитьПроцедуру(ОписаниеПроцедуры);
УстановитьОбработчикСобытия(ПолноеИмяФормы, "Форма", "ПриСозданииНаСервере", "ПриСозданииНаСервере");

// ПриЧтенииНаСервере
ОписаниеПроцедуры = ПолучитьПроцедуруФункцию(ПолноеИмяФормы, "ПриЧтенииНаСервере");
ОписаниеПроцедуры.Имя = "ПриЧтенииНаСервере(ТекущийОбъект)";
ОписаниеПроцедуры.Область = "ОбработчикиСобытийФормы";
ОписаниеПроцедуры.Префикс = "&НаСервере";
ОписаниеПроцедуры.Тело = ОписаниеПроцедуры.Тело
	+ "// СтандартныеПодсистемы.ПодключаемыеКоманды
	|ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	|// Конец СтандартныеПодсистемы.ПодключаемыеКоманды";

ОбновитьПроцедуру(ОписаниеПроцедуры);
УстановитьОбработчикСобытия(ПолноеИмяФормы, "Форма", "ПриЧтенииНаСервере", "ПриЧтенииНаСервере");