// MIT License

// Copyright (c) 2025 Zherebtsov Nikita <nikita@crimsongold.ru>

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/crimsongoldteam/md_design

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// https://infostart.ru/1c/tools/1522958/
	
	СписокКартинок.Добавить("АктивироватьЗадачу");
	СписокКартинок.Добавить("АктивныеПользователи");
	СписокКартинок.Добавить("БизнесПроцесс");
	СписокКартинок.Добавить("БизнесПроцессОбъект");
	СписокКартинок.Добавить("ВводНаОсновании");
	СписокКартинок.Добавить("ВидРасчета");
	СписокКартинок.Добавить("ВложеннаяТаблица");
	СписокКартинок.Добавить("ВнешнийИсточникДанных");
	СписокКартинок.Добавить("ВнешнийИсточникДанныхКуб");
	СписокКартинок.Добавить("ВнешнийИсточникДанныхКубТаблицаИзмерения");
	СписокКартинок.Добавить("ВнешнийИсточникДанныхТаблица");
	СписокКартинок.Добавить("ВнешнийИсточникДанныхФункция");
	СписокКартинок.Добавить("ВосстановитьЗначения");
	СписокКартинок.Добавить("Вперед");
	СписокКартинок.Добавить("ВыборКомпоновкиДанных");
	СписокКартинок.Добавить("ВыборКомпоновкиДанныхНедоступный");
	СписокКартинок.Добавить("Выбрать");
	СписокКартинок.Добавить("ВыбратьВерхнийУровень");
	СписокКартинок.Добавить("ВыбратьЗначение");
	СписокКартинок.Добавить("ВыбратьТип");
	СписокКартинок.Добавить("ВывестиСписок");
	СписокКартинок.Добавить("ВыполнитьЗадачу");
	СписокКартинок.Добавить("ГеографическаяСхема");
	СписокКартинок.Добавить("ГрафическаяСхема");
	СписокКартинок.Добавить("ГрупповоеОбсуждение");
	СписокКартинок.Добавить("Дебет");
	СписокКартинок.Добавить("ДебетКредит");
	СписокКартинок.Добавить("Дендрограмма");
	СписокКартинок.Добавить("Диаграмма");
	СписокКартинок.Добавить("ДиаграммаГанта");
	СписокКартинок.Добавить("ДиалогВопрос");
	СписокКартинок.Добавить("ДиалогВосклицание");
	СписокКартинок.Добавить("ДиалогИнформация");
	СписокКартинок.Добавить("ДиалогСтоп");
	СписокКартинок.Добавить("ДобавитьВИзбранное");
	СписокКартинок.Добавить("Документ");
	СписокКартинок.Добавить("ДокументОбъект");
	СписокКартинок.Добавить("ЖурналДокументов");
	СписокКартинок.Добавить("ЖурналРегистрации");
	СписокКартинок.Добавить("ЖурналРегистрацииПоПользователю");
	СписокКартинок.Добавить("ЗагрузитьНастройкиОтчета");
	СписокКартинок.Добавить("Задача");
	СписокКартинок.Добавить("ЗадачаОбъект");
	СписокКартинок.Добавить("ЗакончитьРедактирование");
	СписокКартинок.Добавить("Закрыть");
	СписокКартинок.Добавить("Заменить");
	СписокКартинок.Добавить("Записать");
	СписокКартинок.Добавить("ЗаписатьИЗакрыть");
	СписокКартинок.Добавить("ЗаписатьИзменения");
	СписокКартинок.Добавить("ЗатенитьФлажки");
	СписокКартинок.Добавить("ЗафиксироватьТаблицу");
	СписокКартинок.Добавить("ИерархическийПросмотр");
	СписокКартинок.Добавить("Избранное");
	СписокКартинок.Добавить("Изменить");
	СписокКартинок.Добавить("ИзменитьМасштаб");
	СписокКартинок.Добавить("ИзменитьФорму");
	СписокКартинок.Добавить("Измерение");
	СписокКартинок.Добавить("Информация");
	СписокКартинок.Добавить("История");
	СписокКартинок.Добавить("ИсторияДанных");
	СписокКартинок.Добавить("ИсторияОтборов");
	СписокКартинок.Добавить("Календарь");
	СписокКартинок.Добавить("Калькулятор");
	СписокКартинок.Добавить("Картинка");
	СписокКартинок.Добавить("КомандаМенюФункций");
	СписокКартинок.Добавить("Константа");
	СписокКартинок.Добавить("КонструкторЗапроса");
	СписокКартинок.Добавить("КонструкторЗапросаВложенныйЗапрос");
	СписокКартинок.Добавить("КонструкторЗапросаВременнаяТаблица");
	СписокКартинок.Добавить("КонструкторЗапросаГруппаВременныхТаблиц");
	СписокКартинок.Добавить("КонструкторЗапросаЗаменитьТаблицу");
	СписокКартинок.Добавить("КонструкторЗапросаОписаниеВременнойТаблицы");
	СписокКартинок.Добавить("КонструкторЗапросаОтображатьТаблицыИзменений");
	СписокКартинок.Добавить("КонструкторЗапросаПараметрыТаблицы");
	СписокКартинок.Добавить("КонструкторЗапросаСоздатьВложенныйЗапрос");
	СписокКартинок.Добавить("КонструкторЗапросаСоздатьЗапросУничтоженияВременнойТаблицы");
	СписокКартинок.Добавить("КонструкторЗапросаСоздатьОписаниеВременнойТаблицы");
	СписокКартинок.Добавить("КонструкторНастроекКомпоновкиДанных");
	СписокКартинок.Добавить("Кредит");
	СписокКартинок.Добавить("КритерийОтбора");
	СписокКартинок.Добавить("Лупа");
	СписокКартинок.Добавить("Назад");
	СписокКартинок.Добавить("Найти");
	СписокКартинок.Добавить("НайтиВДереве");
	СписокКартинок.Добавить("НайтиВСодержании");
	СписокКартинок.Добавить("НайтиВСписке");
	СписокКартинок.Добавить("НайтиПоНомеру");
	СписокКартинок.Добавить("НайтиПредыдущий");
	СписокКартинок.Добавить("НайтиСледующий");
	СписокКартинок.Добавить("НастроитьСписок");
	СписокКартинок.Добавить("Настройка");
	СписокКартинок.Добавить("НастройкаСписка");
	СписокКартинок.Добавить("НастройкиОтчета");
	СписокКартинок.Добавить("НачатьВидеоконференцию");
	СписокКартинок.Добавить("НеБеспокоить");
	СписокКартинок.Добавить("НеОповещать");
	СписокКартинок.Добавить("НоваяВложеннаяСхемаКомпоновкиДанных");
	СписокКартинок.Добавить("НоваяГруппировкаКомпоновкиДанных");
	СписокКартинок.Добавить("НоваяДиаграммаКомпоновкиДанных");
	СписокКартинок.Добавить("НоваяТаблицаКомпоновкиДанных");
	СписокКартинок.Добавить("НовоеОбсуждение");
	СписокКартинок.Добавить("НовоеОкно");
	СписокКартинок.Добавить("Обновить");
	СписокКартинок.Добавить("Обработка");
	СписокКартинок.Добавить("Обсуждения");
	СписокКартинок.Добавить("Оповещать");
	СписокКартинок.Добавить("Оповещения");
	СписокКартинок.Добавить("Остановить");
	СписокКартинок.Добавить("ОтборИСортировка");
	СписокКартинок.Добавить("ОтборКомпоновкиДанных");
	СписокКартинок.Добавить("ОтборКомпоновкиДанныхНедоступный");
	СписокКартинок.Добавить("ОтборПоВиду");
	СписокКартинок.Добавить("ОтборПоТекущемуЗначению");
	СписокКартинок.Добавить("ОтключитьОтбор");
	СписокКартинок.Добавить("ОткрытьСАвтономногоСервера");
	СписокКартинок.Добавить("ОткрытьСОсновногоСервера");
	СписокКартинок.Добавить("ОткрытьФайл");
	СписокКартинок.Добавить("ОтменаПроведения");
	СписокКартинок.Добавить("ОтменитьПоиск");
	СписокКартинок.Добавить("ОтправитьСообщение");
	СписокКартинок.Добавить("Отчет");
	СписокКартинок.Добавить("ОформлениеВоcклицательныйЗнак");
	СписокКартинок.Добавить("ОформлениеДефисЖелтый");
	СписокКартинок.Добавить("ОформлениеЗвездаЗаполненная");
	СписокКартинок.Добавить("ОформлениеЗвездаЗаполненнаяНаполовину");
	СписокКартинок.Добавить("ОформлениеЗвездаПустая");
	СписокКартинок.Добавить("ОформлениеЗнакВоcклицательныйЗнак");
	СписокКартинок.Добавить("ОформлениеЗнакКрест");
	СписокКартинок.Добавить("ОформлениеЗнакФлажок");
	СписокКартинок.Добавить("ОформлениеКвадратыЗаполненные");
	СписокКартинок.Добавить("ОформлениеКвадратыЗаполненныеДва");
	СписокКартинок.Добавить("ОформлениеКвадратыЗаполненныеОдин");
	СписокКартинок.Добавить("ОформлениеКвадратыЗаполненныеТри");
	СписокКартинок.Добавить("ОформлениеКвадратыПустые");
	СписокКартинок.Добавить("ОформлениеКрест");
	СписокКартинок.Добавить("ОформлениеКругЖелтый");
	СписокКартинок.Добавить("ОформлениеКругЗаполненный");
	СписокКартинок.Добавить("ОформлениеКругЗаполненныйНаДвеЧетверти");
	СписокКартинок.Добавить("ОформлениеКругЗаполненныйНаОднуЧетверть");
	СписокКартинок.Добавить("ОформлениеКругЗаполненныйНаТриЧетверти");
	СписокКартинок.Добавить("ОформлениеКругЗеленый");
	СписокКартинок.Добавить("ОформлениеКругКрасный");
	СписокКартинок.Добавить("ОформлениеКругПустой");
	СписокКартинок.Добавить("ОформлениеКругЧерный");
	СписокКартинок.Добавить("ОформлениеСтрелкаВверхЗеленая");
	СписокКартинок.Добавить("ОформлениеСтрелкаВверхСерая");
	СписокКартинок.Добавить("ОформлениеСтрелкаВнизКрасная");
	СписокКартинок.Добавить("ОформлениеСтрелкаВнизСерая");
	СписокКартинок.Добавить("ОформлениеСтрелкаВправоЖелтая");
	СписокКартинок.Добавить("ОформлениеСтрелкаВправоСерая");
	СписокКартинок.Добавить("ОформлениеСтрелкаНаклоннаяВверхЖелтая");
	СписокКартинок.Добавить("ОформлениеСтрелкаНаклоннаяВверхЗеленая");
	СписокКартинок.Добавить("ОформлениеСтрелкаНаклоннаяВверхСерая");
	СписокКартинок.Добавить("ОформлениеСтрелкаНаклоннаяВнизЖелтая");
	СписокКартинок.Добавить("ОформлениеСтрелкаНаклоннаяВнизКрасная");
	СписокКартинок.Добавить("ОформлениеСтрелкаНаклоннаяВнизСерая");
	СписокКартинок.Добавить("ОформлениеТреугольникВверхЗеленый");
	СписокКартинок.Добавить("ОформлениеТреугольникВнизКрасный");
	СписокКартинок.Добавить("ОформлениеФлагЖелтый");
	СписокКартинок.Добавить("ОформлениеФлагЗеленый");
	СписокКартинок.Добавить("ОформлениеФлагКрасный");
	СписокКартинок.Добавить("ОформлениеФлажок");
	СписокКартинок.Добавить("Очистить");
	СписокКартинок.Добавить("Параметры");
	СписокКартинок.Добавить("ПараметрыВыводаКомпоновкиДанных");
	СписокКартинок.Добавить("ПараметрыВыводаКомпоновкиДанныхНедоступные");
	СписокКартинок.Добавить("ПараметрыДанныхКомпоновкиДанных");
	СписокКартинок.Добавить("Переименовать");
	СписокКартинок.Добавить("ПерейтиВперед");
	СписокКартинок.Добавить("ПерейтиККонцу");
	СписокКартинок.Добавить("ПерейтиКНачалу");
	СписокКартинок.Добавить("ПерейтиНазад");
	СписокКартинок.Добавить("ПерейтиПоВнешнейНавигационнойСсылке");
	СписокКартинок.Добавить("ПерейтиПоНавигационнойСсылке");
	СписокКартинок.Добавить("ПереключитьАктивность");
	СписокКартинок.Добавить("ПереместитьВверх");
	СписокКартинок.Добавить("ПереместитьВлево");
	СписокКартинок.Добавить("ПереместитьВниз");
	СписокКартинок.Добавить("ПереместитьВправо");
	СписокКартинок.Добавить("ПеренестиЭлемент");
	СписокКартинок.Добавить("Перечисление");
	СписокКартинок.Добавить("Перечитать");
	СписокКартинок.Добавить("Печать");
	СписокКартинок.Добавить("ПечатьСразу");
	СписокКартинок.Добавить("ПланВидовРасчета");
	СписокКартинок.Добавить("ПланВидовРасчетаОбъект");
	СписокКартинок.Добавить("ПланВидовХарактеристик");
	СписокКартинок.Добавить("ПланВидовХарактеристикОбъект");
	СписокКартинок.Добавить("ПланОбмена");
	СписокКартинок.Добавить("ПланОбменаОбъект");
	СписокКартинок.Добавить("ПланСчетов");
	СписокКартинок.Добавить("ПланСчетовОбъект");
	СписокКартинок.Добавить("ПоискДанных");
	СписокКартинок.Добавить("ПоказатьВСписке");
	СписокКартинок.Добавить("ПоказатьДанные");
	СписокКартинок.Добавить("ПолеВводаВыбрать");
	СписокКартинок.Добавить("ПолеВводаВыбратьТип");
	СписокКартинок.Добавить("ПолеВводаКалендарь");
	СписокКартинок.Добавить("ПолеВводаКалькулятор");
	СписокКартинок.Добавить("ПолеВводаОткрыть");
	СписокКартинок.Добавить("ПолеВводаОчистить");
	СписокКартинок.Добавить("ПолучитьНавигационнуюСсылку");
	СписокКартинок.Добавить("Пользователь");
	СписокКартинок.Добавить("ПользовательБезНеобходимыхСвойств");
	СписокКартинок.Добавить("ПользовательИнтеграцииСистемыВзаимодействия");
	СписокКартинок.Добавить("ПользовательСАутентификацией");
	СписокКартинок.Добавить("ПользовательСистемыВзаимодействия");
	СписокКартинок.Добавить("ПользовательскиеПоляКомпоновкиДанных");
	СписокКартинок.Добавить("ПоляГруппировкиКомпоновкиДанных");
	СписокКартинок.Добавить("ПоляГруппировкиКомпоновкиДанныхНедоступные");
	СписокКартинок.Добавить("ПометитьНаУдаление");
	СписокКартинок.Добавить("ПорядокКомпоновкиДанных");
	СписокКартинок.Добавить("ПорядокКомпоновкиДанныхНедоступный");
	СписокКартинок.Добавить("Предыдущий");
	СписокКартинок.Добавить("Прикрепить");
	СписокКартинок.Добавить("Провести");
	СписокКартинок.Добавить("ПроизвольноеВыражение");
	СписокКартинок.Добавить("ПросмотрПоВладельцу");
	СписокКартинок.Добавить("ПрочитатьИзменения");
	СписокКартинок.Добавить("РазвернутьВсе");
	СписокКартинок.Добавить("РегистрБухгалтерии");
	СписокКартинок.Добавить("РегистрНакопления");
	СписокКартинок.Добавить("РегистрРасчета");
	СписокКартинок.Добавить("РегистрСведений");
	СписокКартинок.Добавить("РегистрСведенийЗапись");
	СписокКартинок.Добавить("РегламентноеЗадание");
	СписокКартинок.Добавить("РегламентныеЗадания");
	СписокКартинок.Добавить("РедактироватьВДиалоге");
	СписокКартинок.Добавить("РежимПросмотраСписка");
	СписокКартинок.Добавить("РежимПросмотраСпискаДерево");
	СписокКартинок.Добавить("РежимПросмотраСпискаИерархическийСписок");
	СписокКартинок.Добавить("РежимПросмотраСпискаСписок");
	СписокКартинок.Добавить("Реквизит");
	СписокКартинок.Добавить("Ресурс");
	СписокКартинок.Добавить("СвернутьВсе");
	СписокКартинок.Добавить("СводнаяДиаграмма");
	СписокКартинок.Добавить("Свойства");
	СписокКартинок.Добавить("Сегодня");
	СписокКартинок.Добавить("Символ");
	СписокКартинок.Добавить("СинтаксическийКонтроль");
	СписокКартинок.Добавить("СкопироватьОбъект");
	СписокКартинок.Добавить("СкопироватьЭлементСписка");
	СписокКартинок.Добавить("Следующий");
	СписокКартинок.Добавить("СнятьФлажки");
	СписокКартинок.Добавить("СоздатьГруппу");
	СписокКартинок.Добавить("СоздатьНачальныйОбраз");
	СписокКартинок.Добавить("СоздатьЭлементСписка");
	СписокКартинок.Добавить("Сообщение");
	СписокКартинок.Добавить("СортироватьСписок");
	СписокКартинок.Добавить("СортироватьСписокПоВозрастанию");
	СписокКартинок.Добавить("СортироватьСписокПоУбыванию");
	СписокКартинок.Добавить("Сортировка");
	СписокКартинок.Добавить("СохранитьЗначения");
	СписокКартинок.Добавить("СохранитьНастройкиОтчета");
	СписокКартинок.Добавить("СохранитьФайл");
	СписокКартинок.Добавить("Справка");
	СписокКартинок.Добавить("СправкаФормы");
	СписокКартинок.Добавить("Справочник");
	СписокКартинок.Добавить("СправочникОбъект");
	СписокКартинок.Добавить("СтандартнаяНастройкаКомпоновкиДанных");
	СписокКартинок.Добавить("СтартБизнесПроцесса");
	СписокКартинок.Добавить("СформироватьОтчет");
	СписокКартинок.Добавить("ТабличныйДокументВставитьПримечание");
	СписокКартинок.Добавить("ТабличныйДокументВставитьРазрывСтраницы");
	СписокКартинок.Добавить("ТабличныйДокументОтображатьГруппировки");
	СписокКартинок.Добавить("ТабличныйДокументОтображатьЗаголовки");
	СписокКартинок.Добавить("ТабличныйДокументОтображатьПримечания");
	СписокКартинок.Добавить("ТабличныйДокументОтображатьСетку");
	СписокКартинок.Добавить("ТабличныйДокументТолькоПросмотр");
	СписокКартинок.Добавить("ТабличныйДокументУдалитьПримечание");
	СписокКартинок.Добавить("ТабличныйДокументУдалитьРазрывСтраницы");
	СписокКартинок.Добавить("УвеличитьМасштаб");
	СписокКартинок.Добавить("Удалить");
	СписокКартинок.Добавить("УдалитьНепосредственно");
	СписокКартинок.Добавить("УменьшитьМасштаб");
	СписокКартинок.Добавить("УправлениеПоиском");
	СписокКартинок.Добавить("УровеньВверх");
	СписокКартинок.Добавить("УровеньВниз");
	СписокКартинок.Добавить("УсловноеОформлениеКомпоновкиДанных");
	СписокКартинок.Добавить("УсловноеОформлениеКомпоновкиДанныхНедоступное");
	СписокКартинок.Добавить("УстановитьВремя");
	СписокКартинок.Добавить("УстановитьИнтервал");
	СписокКартинок.Добавить("УстановитьФлажки");
	СписокКартинок.Добавить("Форма");
	СписокКартинок.Добавить("ХранилищеНастроек");
	
	Для Каждого МетаКартинка Из Метаданные.ОбщиеКартинки Цикл
		СписокКартинок.Добавить(МетаКартинка.Имя);
	КонецЦикла;
	
	СписокКартинок.СортироватьПоЗначению();
	
	МассивОтсутствующих = Новый Массив;
	Для Каждого ЭлементСписка Из СписокКартинок Цикл
		Попытка
			ЭлементСписка.Картинка = БиблиотекаКартинок[ЭлементСписка.Значение];
		Исключение
			МассивОтсутствующих.Добавить(ЭлементСписка);
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого ОтсутствующийЭлемент Из МассивОтсутствующих Цикл
		СписокКартинок.Удалить(ОтсутствующийЭлемент);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокКартинокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = СписокКартинок.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Закрыть(ТекущаяСтрока.Значение);
КонецПроцедуры

#КонецОбласти
